[
    "Urban Studies and Planning (Course 11)",
    [
        "head",
        "Introductory Subjects"
    ],
    [
        "block",
        [
            "title",
            "11.001[J] Introduction to Urban Design and Development"
        ],
        [
            "prerec",
            "Same subject as 4.250[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines the evolving structure of cities and the way that cities, suburbs, and metropolitan areas can be designed and developed. Surveys the ideas of a wide range of people who have addressed urban problems. Stresses the connection between values and design. Demonstrates how physical, social, political and economic forces interact to shape and reshape cities over time. Introduces links between urban design and urban science."
        ],
        [
            "inst",
            [
                "L. Vale (fall); A. Sevtsuk (spring)"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.002[J] Making Public Policy"
        ],
        [
            "prerec",
            "Same subject as 17.30[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines how the struggle among competing advocates shapes the outputs of government. Considers how conditions become problems for government to solve, why some political arguments are more persuasive than others, why some policy tools are preferred over others, and whether policies achieve their goals. Investigates the interactions among elected officials, think tanks, interest groups, the media, and the public in controversies over global warming, urban sprawl, Social Security, health care, education, and other issues."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.003[J] Methods of Policy Analysis"
        ],
        [
            "prerec",
            "Same subject as 17.303[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=11.002\" title=\"11.002[J]\" class=\"bubblelink code\" onclick=\"return showCourse(this, '11.002');\">11.002[J]</a>; <i>Coreq: <a href=\"/search/?P=14.01\" title=\"14.01\" class=\"bubblelink code\" onclick=\"return showCourse(this, '14.01');\">14.01</a></i> "
            ]
        ],
        [
            "desc",
            "Provides students with an introduction to public policy analysis. Examines various approaches to policy analysis by considering the concepts, tools, and methods used in economics, political science, and other disciplines. Students apply and critique these approaches through case studies of current public policy problems."
        ],
        [
            "inst",
            [
                "C. Abbanat"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.004[J] People and the Planet: Environmental Histories and Engineering"
        ],
        [
            "prerec",
            "Same subject as STS.033[J]\nSubject meets with 11.204[J], IDS.524[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Explores historical and cultural aspects of complex environmental problems and engineering approaches to sustainable solutions. Introduces quantitative analyses and methodological tools to understand environmental issues that have human and natural components. Demonstrates concepts through a series of historical and cultural analyses of environmental challenges and their engineering responses. Builds writing, quantitative modeling, and analytical skills in assessing environmental systems problems and developing engineering solutions. Through environmental data gathering and analysis, students engage with the challenges and possibilities of engineering in complex, interacting systems, and investigate plausible, symbiotic, systems-oriented solutions. Students taking graduate version complete additional analysis of reading assignments and a more in-depth and longer final paper. "
        ],
        [
            "inst",
            [
                "A. Slocum",
                "R. Scheffler",
                "J. Trancik"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.005 Introduction to International Development"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Introduces the political economy of international economic development planning, using an applied, quantitative approach. Considers why some countries are able to develop faster than others. Presents major theories and models of development and underdevelopment, providing tools to understand the mechanisms and processes behind economic growth and broader notions of progress. Offers an alternative view of development, focusing on the persistence of dichotomies in current theory and practice. Using specific cases, explores how different combinations of actors and institutions at various scales may promote or inhibit economic development. Students re-examine conventional knowledge and engage critically with the assumptions behind current thinking and policy."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.006 Poverty and Economic Security"
        ],
        [
            "prerec",
            "Subject meets with 11.206"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Explores the evolution of poverty and economic security in the US within a global context. Examines the impacts of recent economic restructuring and globalization. Reviews current debates about the fate of the middle class, sources of increasing inequality, and approaches to advancing economic opportunity and security. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "A. Glasmeier"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.007 Urban and Environmental Technology Implementation Lab"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Spring)"
            ]
        ],
        [
            "desc",
            "Real-world clients and environmental problems form the basis of a project in which teams of students develop strategies for analysis and implementation of new sensor technology within cities. Working closely with a partner or client based on the MIT campus or in Cambridge, students assess the environmental problem, implement prototypes, and recommend promising solutions to the client for implementation. Equipment and working space provided. Limited to 12."
        ],
        [
            "inst",
            [
                "D. Hsu"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.008 Undergraduate Planning Seminar (New)"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "A weekly seminar that includes discussions on topics in cities and urban planning, including guest lectures from DUSP faculty and practicing planners. Topics include urban science, zoning, architecture and urban design, urban sociology, politics and public policy, transportation and mobility, democratic governance, civil rights and social justice, urban economics, affordable housing, environmental policy and planning, real estate and economic development, agriculture and food policy, public health, and international development. Weekly student presentations on local planning issues and current events; occasional walking tours or arranged field trips. May be repeated for credit. Enrollment may be limited; preference to Course 11 and 11-6 sophomores and juniors."
        ],
        [
            "inst",
            [
                "E. Glenn"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.011 The Art and Science of Negotiation"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Introduction to negotiation theory and practice. Applications in government, business, and nonprofit settings are examined. Combines a \"hands-on\" personal skill-building orientation with a look at pertinent tactical and strategic foundations. Preparation insights, persuasion tools, ethical benchmarks, and institutional influences are examined as they shape our ability to analyze problems, negotiate agreements, and resolve disputes in social, organizational, and political circumstances characterized by interdependent interests. Enrollment limited by lottery; consult class website for information and deadlines."
        ],
        [
            "inst",
            [
                "B. Verdini"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.013[J] American Urban History"
        ],
        [
            "prerec",
            "Same subject as 21H.217[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Seminar on the history of institutions and institutional change in American cities from roughly 1850 to the present. Among the institutions to be looked at are political machines, police departments, courts, schools, prisons, public authorities, and universities. Focuses on readings and discussions."
        ],
        [
            "inst",
            [
                "E. Glenn "
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.014[J] History of the Built Environment in the US"
        ],
        [
            "prerec",
            "Same subject as 21H.218[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Seminar on the history of selected features of the physical environment of urban America. Among the features considered are parks, cemeteries, tenements, suburbs, zoos, skyscrapers, department stores, supermarkets, and amusement parks."
        ],
        [
            "inst",
            [
                "R. M. Fogelson"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.015[J] Riots, Strikes, and Conspiracies in American History"
        ],
        [
            "prerec",
            "Same subject as 21H.226[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21H.226[J]."
        ],
        [
            "inst",
            [
                "A. Pope"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.016[J] The Once and Future City"
        ],
        [
            "prerec",
            "Same subject as 4.211[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines the evolving structure of cities, the dynamic processes that shape them, and the significance of a city's history for its future development. Develops the ability to read urban form as an interplay of natural processes and human purposes over time. Field assignments in Boston provide the opportunity to use, develop, and refine these concepts. Enrollment limited."
        ],
        [
            "inst",
            [
                "A. Spirn"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.021[J] Environmental Law, Policy, and Economics: Pollution Prevention and Control"
        ],
        [
            "prerec",
            "Same subject as 1.801[J], 17.393[J], IDS.060[J]\nSubject meets with 1.811[J], 11.630[J], 15.663[J], IDS.540[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Analyzes federal and state regulation of air and water pollution, hazardous waste, greenhouse gas emissions, and production/use of toxic chemicals. Analyzes pollution/climate change as economic problems and failure of markets. Explores the role of science and economics in legal decisions. Emphasizes use of legal mechanisms and alternative approaches (i.e., economic incentives, voluntary approaches) to control pollution and encourage chemical accident and pollution prevention. Focuses on major federal legislation, underlying administrative system, and common law in analyzing environmental policy, economic consequences, and role of the courts. Discusses classical pollutants and toxic industrial chemicals, greenhouse gas emissions, community right-to-know, and environmental justice. Develops basic legal skills: how to read/understand cases, regulations, and statutes. Students taking graduate version explore the subject in greater depth."
        ],
        [
            "inst",
            [
                "N. Ashford",
                "C. Caldart"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.022[J] Regulation of Chemicals, Radiation, and Biotechnology"
        ],
        [
            "prerec",
            "Same subject as 1.802[J], IDS.061[J]\nSubject meets with 1.812[J], 10.805[J], 11.631[J], IDS.436[J], IDS.541[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=IDS.060\" title=\"IDS.060[J]\" class=\"bubblelink code\" onclick=\"return showCourse(this, 'IDS.060');\">IDS.060[J]</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Focuses on policy design and evaluation in the regulation of hazardous substances and processes. Includes risk assessment, industrial chemicals, pesticides, food contaminants, pharmaceuticals, radiation and radioactive wastes, product safety, workplace hazards, indoor air pollution, biotechnology, victims' compensation, and administrative law. Health and economic consequences of regulation, as well as its potential to spur technological change, are discussed for each regulatory regime. Students taking the graduate version are expected to explore the subject in greater depth."
        ],
        [
            "inst",
            [
                "N. Ashford",
                "C. Caldart"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.024 Modeling Pedestrian Activity in Cities"
        ],
        [
            "prerec",
            "Subject meets with 11.324"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Investigates the interaction between pedestrian activity, urban form, and land-use patterns in relatively dense urban environments. Informed by recent literature on pedestrian mobility, behavior, and biases, subject takes a practical approach, using software tools and analysis methods to operationalize and model pedestrian activity. Uses simplified yet powerful and scalable network analysis methods that focus uniquely on pedestrians, rather than engaging in comprehensive travel demand modeling across all modes. Emphasizes not only modeling or predicting pedestrian activity in given built settings, but also analyzing and understanding how changes in the built environment — land use changes, density changes, and connectivity changes — can affect pedestrian activity. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "A. Sevtsuk "
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.025[J] D-Lab: Development"
        ],
        [
            "prerec",
            "Same subject as EC.701[J]\nSubject meets with 11.472[J], EC.781[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject EC.701[J]. Enrollment limited by lottery; must attend first class session."
        ],
        [
            "inst",
            [
                "S. L. Hsu",
                "B. Sanyal"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.026[J] Downtown"
        ],
        [
            "prerec",
            "Same subject as 21H.321[J]\nSubject meets with 11.339"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21H.321[J]."
        ],
        [
            "inst",
            [
                "R. M. Fogelson"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.027 City to City: Comparing, Researching, and Reflecting on Practice"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: U (Spring)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Introduces students to practice through researching, writing, and working for and with nonprofits. Students work directly with nonprofits and community partners to help find solutions to real world problems; interview planners and other field experts, and write and present findings to nonprofit partners and community audiences."
        ],
        [
            "inst",
            [
                "C. Abbanat"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.029[J] Mobility Ventures: Driving Innovation in Transportation Systems"
        ],
        [
            "prerec",
            "Same subject as 15.3791[J]\nSubject meets with 11.529[J], 15.379[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Explores technological, behavioral, policy, and systems-wide frameworks for innovation in transportation systems, complemented with case studies across the mobility spectrum, from autonomous vehicles to urban air mobility to last-mile sidewalk robots. Students interact with a series of guest lecturers from CEOs and other business and government executives who are actively reshaping the future of mobility. Interdisciplinary teams of students collaborate to deliver business plans for proposed mobility-focused startups with an emphasis on primary market research. Students taking graduate version complete additional assignments. Preference to juniors and seniors."
        ],
        [
            "inst",
            [
                "J. Zhao",
                "J. Moavenzadeh",
                "J. Larios Berlin"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.041 Introduction to Housing, Community, and Economic Development"
        ],
        [
            "prerec",
            "Subject meets with 11.401"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Provides a critical introduction to the shape and determinants of political, social, and economic inequality in America, with a focus on racial and economic justice. Explores the role of the city in visions of justice. Analyzes the historical, political, and institutional contexts of housing and community development policy in the US, including federalism, municipal fragmentation, and decentralized public financing. Introduces major dimensions in US housing policy, such as housing finance, public housing policy, and state and local housing affordability mechanisms. Reviews major themes in community economic development, including drivers of economic inequality, small business policy, employment policy, and cooperative economics. Expectations and evaluation criteria differ for students taking graduate version."
        ],
        [
            "inst",
            [
                "J. Steil"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.045[J] Power: Interpersonal, Organizational, and Global Dimensions"
        ],
        [
            "prerec",
            "Same subject as 15.302[J], 17.045[J], 21A.127[J]\nSubject meets with 21A.129"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21A.127[J]."
        ],
        [
            "inst",
            [
                "S. Silbey"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.067 Land Use Law and Politics: Race, Place, and Law"
        ],
        [
            "prerec",
            "Subject meets with 11.367"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Explores conceptions of spatial justice and introduces students to basic principles of US law and legal analysis, focused on property, land use, equal protection, civil rights, fair housing, and local government law, in order to examine who should control how land is used. Examines the rights of owners of land and the types of regulatory and market-based tools that are available to control land use, and discusses why and when government regulation, rather than private market ordering, might be necessary to control land use patterns. Explores basic principles of civil rights and anti-discrimination law and focuses on particular civil rights problems associated with the land use regulatory system, such as exclusionary zoning, residential segregation, the fair distribution of undesirable land uses, and gentrification. Introduces basic skills of statutory drafting and interpretation. Assignments differ for those taking the graduate version."
        ],
        [
            "inst",
            [
                "J. Steil"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.074 Cybersecurity Clinic"
        ],
        [
            "prerec",
            "Subject meets with 11.274"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Provides an opportunity for MIT students to become certified in methods of assessing the vulnerability of public agencies (particularly agencies that manage critical urban infrastructure) to the risk of cyberattack. Certification involves completing an 8-hour, self-paced, online set of four modules during the first four weeks of the semester followed by a competency exam. Students who successfully complete the exam become certified. The certified students work in teams with client agencies in various cities around the United States. Through preparatory interactions with the agencies, and short on-site visits, teams prepare vulnerability assessments that client agencies can use to secure the technical assistance and financial support they need to manage the risks of cyberattack they are facing. Students taking graduate version complete additional assignments. Limited to 15."
        ],
        [
            "inst",
            [
                "L. Susskind"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.092 Renewable Energy Facility Siting Clinic (New)"
        ],
        [
            "prerec",
            "Subject meets with 11.592"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Presents methods for resolving facility siting disputes, particularly those involving renewable energy. After completing four modules and a competency exam for MITx certification, students work in teams to help client communities in various cities around the United States. Through direct interactions with the proponents and opponents of facilities subject to local opposition, students complete a stakeholder assessment and offer joint fact-finding and collaborative problem-solving assistance. The political, legal, financial, and regulatory aspects of facility siting, particularly for renewable energy, are reviewed along with key infrastructure planning principles. Students taking the graduate version complete additional assignments. Limited to 15."
        ],
        [
            "inst",
            [
                "L. Susskind"
            ]
        ]
    ],
    [
        "head",
        "Specialized Subjects"
    ],
    [
        "block",
        [
            "title",
            "11.100 Introduction to Computational Thinking in Cities"
        ],
        [
            "prerec",
            "Prereq: None. Coreq: 6.100B"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Fall)"
            ]
        ],
        [
            "desc",
            "Highlights how computer science may inform and impact how cities are conceptualized, planned, designed, regulated, and managed. The first half of the class explores the history of computational approaches in urban planning between around 1950 and 2020. The second half attempts to connect the data science concepts learned in 6.100B to topics in city planning and design. Subject can count toward the 6-unit discovery-focused credit limit for first-year students."
        ],
        [
            "inst",
            [
                "A. Sevtsuk"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.107 Tools and Techniques for Inclusive Economic Development"
        ],
        [
            "prerec",
            "Subject meets with 11.407"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Introduces tools and techniques in economic development planning. Extensive use of data collection, analysis, and display techniques. Students build interpretive intuition skills through user experience design activities and develop a series of memos summarizing the results of their data analysis. These are aggregated into a final report, and include the tools developed over the semester. Students taking graduate version complete modified assignments focused on developing computer applications."
        ],
        [
            "inst",
            [
                "A. Glasmeier"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.111[J] Leadership in Negotiation: Advanced Applications"
        ],
        [
            "prerec",
            "Same subject as 17.381[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=11.011\" title=\"11.011\" class=\"bubblelink code\" onclick=\"return showCourse(this, '11.011');\">11.011</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Building on the skills and strategies honed in 11.011, explores advanced negotiation practice. Emphasizes an experiential skill-building approach, underpinned by cutting-edge cases and innovative research. Examines applications in high-stakes management, public policy, social entrepreneurship, international diplomacy, and scientific discovery. Strengthens collaborative decision-making, persuasion, and leadership skills by negotiating across different media and through personalized coaching, enhancing students' ability to proactively engage stakeholders, transform organizations, and inspire communities. Limited by lottery; consult class website for information and deadlines."
        ],
        [
            "inst",
            [
                "B. Verdini"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.113 The Economic Approach to Cities and Environmental Sustainability"
        ],
        [
            "prerec",
            "Subject meets with 11.413"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=1.010\" title=\"1.010\" class=\"bubblelink code\" onclick=\"return showCourse(this, '1.010');\">1.010</a>, <a href=\"/search/?P=14.30\" title=\"14.30\" class=\"bubblelink code\" onclick=\"return showCourse(this, '14.30');\">14.30</a>, <a href=\"/search/?P=18.650\" title=\"18.650[J]\" class=\"bubblelink code\" onclick=\"return showCourse(this, '18.650');\">18.650[J]</a>, or permission of instructor "
            ]
        ],
        [
            "desc",
            "Provides a systematic framework of the interplay (both tension and synergy) between urbanization and environmental sustainability from a global perspective. Enhances analytical reasoning and quantitative skills to assist evidence-based empirical study and policy design evaluation. Explores the causes and consequences of urban environmental quality dynamics, and provides econometric tools to quantify such relationships. Examines state-of-the-art research in this field by introducing empirical studies from both developing and developed countries (highlighting fast urbanization). Themes include urban production, households, transportation and form, as well as political economy and climate resilience. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "S. Zheng"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.119 NEET Seminar: Digital Cities"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Seminar for students enrolled in the Digital Cities NEET thread. Focuses on topics around clean energy and sustainability in cities via guest lectures and research discussions."
        ],
        [
            "inst",
            [
                "C. Cong"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.122[J] Law, Technology, and Public Policy"
        ],
        [
            "prerec",
            "Same subject as IDS.066[J]\nSubject meets with 11.422[J], 15.655[J], IDS.435[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject IDS.066[J]."
        ],
        [
            "inst",
            [
                "N. Ashford",
                "C. Caldart"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.123 Big Plans and Mega-Urban Landscapes"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Spring)"
            ]
        ],
        [
            "desc",
            "Explores the physical, ecological, technological, political, economic and cultural implications of big plans and mega-urban landscapes in a global context. Uses local and international case studies to understand the process of making major changes to urban landscape and city fabric, and to regional landscape systems. Includes lectures by leading practitioners. Assignments consider planning and design strategies across multiple scales and time frames."
        ],
        [
            "inst",
            [
                "A. Berger "
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.124[J] Introduction to Education: Looking Forward and Looking Back on Education"
        ],
        [
            "prerec",
            "Same subject as CMS.586[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject CMS.586[J]. Limited to 25."
        ],
        [
            "inst",
            [
                "E. Klopfer"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.125[J] Introduction to Education: Understanding and Evaluating Education"
        ],
        [
            "prerec",
            "Same subject as CMS.587[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject CMS.587[J]. Limited to 25."
        ],
        [
            "inst",
            [
                "E. Klopfer"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.127[J] Design and Development of Games for Learning"
        ],
        [
            "prerec",
            "Same subject as CMS.590[J]\nSubject meets with 11.252[J], CMS.863[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject CMS.590[J]."
        ],
        [
            "inst",
            [
                "E. Klopfer"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.129[J] Educational Theory and Practice I"
        ],
        [
            "prerec",
            "Same subject as CMS.591[J]"
        ],
        [
            "terms",
            [
                "Prereq: None. <i>Coreq: <a href=\"/search/?P=CMS.586\" title=\"CMS.586[J]\" class=\"bubblelink code\" onclick=\"return showCourse(this, 'CMS.586');\">CMS.586[J]</a></i> "
            ]
        ],
        [
            "desc",
            "See description under subject CMS.591[J]. Limited to 15; preference to juniors and seniors."
        ],
        [
            "inst",
            [
                "G. Schwanbeck"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.130[J] Educational Theory and Practice II"
        ],
        [
            "prerec",
            "Same subject as CMS.592[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=CMS.591\" title=\"CMS.591[J]\" class=\"bubblelink code\" onclick=\"return showCourse(this, 'CMS.591');\">CMS.591[J]</a> "
            ]
        ],
        [
            "desc",
            "See description under subject CMS.592[J]."
        ],
        [
            "inst",
            [
                "G. Schwanbeck"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.131[J] Educational Theory and Practice III"
        ],
        [
            "prerec",
            "Same subject as CMS.593[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=CMS.592\" title=\"CMS.592[J]\" class=\"bubblelink code\" onclick=\"return showCourse(this, 'CMS.592');\">CMS.592[J]</a> "
            ]
        ],
        [
            "desc",
            "See description under subject CMS.593[J]."
        ],
        [
            "inst",
            [
                "G. Schwanbeck"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.133[J] Dilemmas in Biomedical Ethics: Playing God or Doing Good?"
        ],
        [
            "prerec",
            "Same subject as 21A.302[J], WGS.271[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "An introduction to the cross-cultural study of biomedical ethics. Examines moral foundations of the science and practice of western biomedicine through case studies of abortion, contraception, cloning, organ transplantation and other issues. Evaluates challenges that new medical technologies pose to the practice and availability of medical services around the globe, and to cross-cultural ideas of kinship and personhood. Discusses critiques of the biomedical tradition from anthropological, feminist, legal, religious, and cross-cultural theorists."
        ],
        [
            "inst",
            [
                "E. C. James"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.134[J] Infections and Inequalities: Interdisciplinary Perspectives on Global Health"
        ],
        [
            "prerec",
            "Same subject as HST.431[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines case studies in infectious disease outbreaks to demonstrate how human health is a product of multiple determinants, such as biology, sociocultural and historical factors, politics, economic processes, and the environment. Analyzes how structural inequalities render certain populations vulnerable to illness and explores the moral and ethical dimensions of public health and clinical interventions to promote health. Limited to 25."
        ],
        [
            "inst",
            [
                "E. James",
                "A. Chakraborty"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.135 Violence, Human Rights, and Justice"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "An examination of the problem of mass violence and oppression in the contemporary world, and of the concept of human rights as a defense against such abuse. Explores questions of cultural relativism, race, gender and ethnicity. Examines case studies from war crimes tribunals, truth commissions, anti-terrorist policies and other judicial attempts to redress state-sponsored wrongs. Considers whether the human rights framework effectively promotes the rule of law in modern societies. Students debate moral positions and address ideas of moral relativism."
        ],
        [
            "inst",
            [
                "E. C. James"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.136 Global Mental Health"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Provides skills to critically analyze issues of mental health in historical and cross-cultural contexts. Studies mental illness as a complex biopsychosocial experience embedded in particular political and economic frameworks. Examines the relationships among culture, gender, embodiment, and emotional distress; power inequalities and ideas of the \"normal\" and \"abnormal;\" and how such conceptions influence care-giving practices, whether in traditional or biomedical contexts. Evaluates how the disciplines of psychology, psychoanalysis, and psychiatry have developed in the West, and considers their influence on mental health interventions in global settings. Limited to 25."
        ],
        [
            "inst",
            [
                "E. James"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.137 Financing Economic Development and Housing"
        ],
        [
            "prerec",
            "Subject meets with 11.437"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Studies financing tools and program models to support and promote local economic development and housing. Overview of public and private capital markets and financing sources helps illustrate market imperfections that constrain economic and housing development and increase race and class disparaties. Explores federal housing and economic development programs as well as state and local public finance tools. Covers policies and program models. Investigates public finance practice to better understand how these finance programs affect other municipal operations. Students taking graduate version complete additional assignments. Limited to 25."
        ],
        [
            "inst",
            [
                "J. Levine"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.138 Crowd Sourced City: Civic Tech Prototyping"
        ],
        [
            "prerec",
            "Subject meets with 11.458"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Investigates the use of social medial and digital technologies for planning and advocacy by working with actual planning and advocacy organizations to develop, implement, and evaluate prototype digital tools. Students use the development of their digital tools as a way to investigate new media technologies that can be used for planning. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "S. Williams",
                "C. D'Ignazio"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.139 The City in Film"
        ],
        [
            "prerec",
            "Subject meets with 11.239"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Surveys important developments in urbanism from 1900 to the present, using film as a lens to explore and interpret aspects of the urban experience in the US and abroad. Topics include industrialization, demographics, diversity, the environment, and the relationship between the community and the individual. Films vary from year to year but always include a balance of classics from the history of film, an occasional experimental/avant-garde film, and a number of more recent, mainstream movies. Students taking undergraduate version complete writing assignments that focus on observation, analysis, and the essay, and give an oral presentation. Limited to 18."
        ],
        [
            "inst",
            [
                "E. Glenn"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.140 Urbanization and Development"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Examines developmental dynamics of rapidly urbanizing locales, with a special focus on the developing world. Case studies from India, China, Mexico, Brazil, and South Africa form the basis for discussion of social, spatial, political and economic changes in cities spurred by the decline of industry, the rise of services, and the proliferation of urban mega projects. Emphasizes the challenges of growing urban inequality, environmental risk, citizen displacement, insufficient housing, and the lack of effective institutions for metropolitan governance."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.142 Geography of the Global Economy"
        ],
        [
            "prerec",
            "Subject meets with 11.442"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Analyzes implications of economic globalization for communities, regions, international businesses and economic development organizations. Uses spatial analysis techniques to model the role of energy resources in shaping international political economy. Investigates key drivers of human, physical, and social capital flows and their roles in modern human settlement systems. Surveys contemporary models of industrialization and places them in geographic context. Connects forces of change with their implications for the distribution of wealth and human well-being. Looks backward to understand pre-Covid conditions and then returns to the present to understand how a global pandemic changes the world. Class relies on current literature and explorations of sectors. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "A. Glasmeier"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.143 Research Methods in Global Health and Development"
        ],
        [
            "prerec",
            "Subject meets with 11.243"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Provides training for students to critically analyze the relationship between \"health\" and \"development.\" Draws upon the theory and methods of medical anthropology, social medicine, public health, and development to track how culture, history, and political economy influence health and disease in global communities. Students work in teams to formulate research questions, and collect and analyze qualitative data in clinical and community settings in the greater Boston area, in order to design effective development interventions aimed at reducing health disparities in the US and abroad. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "E. C. James"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.144 Project Appraisal in Developing Countries"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "U (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Covers techniques of financial analysis of investment expenditures, as well as the economic and distributive appraisal of development projects. Critical analysis of these tools in the political economy of international development is discussed. Topics include appraisal's role in the project cycle, planning under conditions of uncertainty, constraints in data quality and the limits of rational analysis, and the coordination of an interdisciplinary appraisal team. Enrollment limited; preference to majors."
        ],
        [
            "inst",
            [
                "Y. Hong"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.145 International Housing Economics and Finance"
        ],
        [
            "prerec",
            "Prereq: 14.01"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Presents a theory of comparative differences in international housing outcomes. Introduces institutional differences in the ways housing expenditures are financed, and the economic determinants of housing outcomes, such as construction costs, land values, housing quality, and ownership rates. Analyzes the flow of funds to and from the different national housing finance sectors. Develops an understanding of the greater financial and macroeconomic implications of the mortgage credit sector, and how policies affect the ways housing asset fluctuations impact national economies. Considers the perspective of investors in international real estate markets and the risks and rewards involved. Draws on lessons from an international comparative approach, and applies them to economic and finance policies at the local, state/provincial, and federal levels within a country of choice. Meets with 11.355 when offered concurrently. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "A. Saiz"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.147 Budgeting and Finance for the Public Sector"
        ],
        [
            "prerec",
            "Subject meets with 11.487"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Examines globally relevant challenges of adequately and effectively attending to public sector responsibilities for basic services with limited resources. Particular attention to the contexts of fiscal crises and rapid population growth, as well as shrinkage, through an introduction to methods and processes of budgeting, accounting, and financial mobilization. Case studies and practice exercises explore revenue strategies, demonstrate fiscal analytical competencies, and familiarize students with pioneering examples of promising budget and accounting processes and innovative funding mobilization via taxation, capital markets, and other mechanisms (e.g., land-value capture). Students taking graduate version explore the subject in greater depth."
        ],
        [
            "inst",
            [
                "G. Carolini"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.148 Environmental Justice: Law and Policy"
        ],
        [
            "prerec",
            "Subject meets with 11.368"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Introduces frameworks for analyzing and addressing inequalities in the distribution of environmental benefits and burdens, particularly by race and by class. Explores the foundations and principles of the environmental justice movement from the perspectives of social science, public policy, and law. Introduces basic principles of US constitutional and environmental law, with a focus on equal protection and civil rights. Applies environmental justice principles to contemporary issues in urban policy and planning, including effects of and responses to climate change and global heating. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "J. Steil"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.149 Decarbonizing Urban Mobility"
        ],
        [
            "prerec",
            "Subject meets with 11.449"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Focuses on measuring and reducing emissions from passenger transportation. After examining travel, energy, and climate conditions, students review existing approaches to transport decarbonization. Evaluates new mobility technologies through their potential to contribute to (or delay) a zero emission mobility system. Students consider the policy tools required to achieve approaches to achieve change. Frames past and future emission reductions using an approach based on the Kaya Identity, decomposing past (and potential future) emissions into their component pieces. Seeks to enable students to be intelligent evaluators of approaches to transportation decarbonization and equip them with the tools to develop and evaluate policy measures relevant to their local professional challenges. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "J. Zhao",
                "A. Salzberg"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.150[J] Metropolis: A Comparative History of New York City"
        ],
        [
            "prerec",
            "Same subject as 21H.220[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21H.220[J]."
        ],
        [
            "inst",
            [
                "C. Wilder"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.151[J] Youth Political Participation"
        ],
        [
            "prerec",
            "Same subject as STS.080[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject STS.080[J]. Limited to 40."
        ],
        [
            "inst",
            [
                "J. S. Light"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.152[J] The Ghetto: From Venice to Harlem"
        ],
        [
            "prerec",
            "Same subject as 21H.385[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21H.385[J]."
        ],
        [
            "inst",
            [
                "C. Wilder"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.153[J] Shanghai and China's Modernization"
        ],
        [
            "prerec",
            "Same subject as 21H.351[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21H.351[J]."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.154 Big Data, Visualization, and Society"
        ],
        [
            "prerec",
            "Subject meets with 11.454"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Data visualizations communicate the insights found in data to non-technical audiences. Students develop technical skills to work with big data to expose societal issues and communicate the insights. Focuses on different topics each year. After framing that topic, the first half of the subject focuses on learning to analyze the data with Python. The second half of the subject focuses on learning web-based data visualization tools (JavaScript and D3). Students learn data storytelling concepts and produce web-based data visualizations for their final projects. Throughout, students learn ethical data practices. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "S. Williams"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.C35[J] Interactive Data Visualization and Society"
        ],
        [
            "prerec",
            "Same subject as 6.C35[J]\nSubject meets with 6.C85[J], 11.C85[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 6.C35[J]. Enrollment limited."
        ],
        [
            "inst",
            [
                "C. D'Ignazio",
                "A. Satyanarayan",
                "S. Williams"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.155[J] Data and Society"
        ],
        [
            "prerec",
            "Same subject as IDS.057[J], STS.005[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject STS.005[J]."
        ],
        [
            "inst",
            [
                "E. Medina",
                "S. Williams"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.156 Healthy Cities: Assessing Health Impacts of Policies and Plans"
        ],
        [
            "prerec",
            "Subject meets with 11.356"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines the built, psychosocial, economic, and natural environment factors that affect health behaviors and outcomes, including population-level patterns of disease distribution and health disparities. Introduces tools designed to integrate public health considerations into policy-making and planning. Provides extensive practical, budgeting, and programming training in the application of health impact assessment tools meant to integrate Health in All Policies, including Health Impact Assessment (HIA) methodology, which brings a health lens to policy, budgeting, and planning debates. Emphasizes health equity and healthy cities, and explores the relationship between health equity and broader goals for social and racial justice. Students taking graduate version complete additional assignments. Limited to 30."
        ],
        [
            "inst",
            [
                "M. Arcaya"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.157[J] China's Growth: Political Economy, Business, and Urbanization"
        ],
        [
            "prerec",
            "Same subject as 15.2391[J]\nSubject meets with 11.257[J], 15.239[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines different aspects of the growth of China, which has the second largest economy in the world. Studies the main drivers of Chinese economic growth and the forces behind the largest urbanization in human history. Discusses how to understand China's booming real estate market, and how Chinese firms operate to attain their success, whether through hard-working entrepreneurship or political connections with the government. Explores whether the top-down urban and industrial policy interventions improve efficiency or cause misallocation problems, and whether the Chinese political system in an enabler of Chinese growth or a potential impediment to the country's future growth prospects. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "Y. Huang",
                "S. Zheng",
                "Z. Tan"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.158 Behavioral Science, AI, and Urban Mobility"
        ],
        [
            "prerec",
            "Subject meets with 11.478"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Integrates behavioral science, artificial intelligence, and transportation technology to shape travel behavior, design mobility systems and business, and reform transportation policies. Introduces methods to sense travel behavior with new technology and measurements; nudge behavior through perception and preference shaping; design mobility systems and ventures that integrate autonomous vehicles, shared mobility, and public transit; and regulate travel with behavior-sensitive transport policies. Challenges students to pilot behavioral experiments and design creative mobility systems, business and policies. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "J. Zhao"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.159 Entrepreneurial Negotiation"
        ],
        [
            "prerec",
            "Subject meets with 11.259"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Combines online weekly face-to-face negotiation exercises and in-person lectures designed to empower budding entrepreneurs with negotiation techniques to protect and increase the value of their ideas, deal with ego and build trust in relationships, and navigate entrepreneurial bargaining under constraints of economic uncertainty and complex technical considerations. Students must complete scheduled weekly assignments, including feedback memos to counterpart negotiators, and meet on campus with the instructor to discuss and reflect on their experiences with the course. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "L. Susskind"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.162 Politics of Energy and the Environment"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Focuses on the politics of making local, state, national and international decisions on energy and the environment. Topics include implementing energy efficiency measures, siting nuclear and alternative energy plants, promoting oil and gas development offshore and in wilderness, adapting to climate change, handling toxic waste, protecting endangered species, and conserving water. Case studies include Cape Wind, disputes over oil and gas exploration in the Arctic, the response to Hurricane Katrina, and efforts to craft and comply with the greenhouse gas emissions limits."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.164[J] Human Rights at Home and Abroad"
        ],
        [
            "prerec",
            "Same subject as 17.391[J]\nSubject meets with 11.497"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Provides a rigorous and critical introduction to the history, foundation, structure, and operation of the human rights movement. Focuses on key ideas, actors, methods and sources, and critically evaluates the field. Addresses current debates in human rights, including the relationship with security, democracy, development and globalization, urbanization, equality (in housing and other economic and social rights; women's rights; ethnic, religious and racial discrimination; and policing/conflict), post-conflict rebuilding and transitional justice, and technology in human rights activism. No prior coursework needed, but work experience, or community service that demonstrates familiarity with global affairs or engagement with ethics and social justice issues, preferred. Students taking graduate version are expected to write a research paper."
        ],
        [
            "inst",
            [
                "B. Rajagopal"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.165 Urban Energy Systems and Policy"
        ],
        [
            "prerec",
            "Subject meets with 1.286[J], 11.477[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=14.01\" title=\"14.01\" class=\"bubblelink code\" onclick=\"return showCourse(this, '14.01');\">14.01</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Examines efforts in developing and advanced nations and regions. Examines key issues in the current and future development of urban energy systems, such as technology, use, behavior, regulation, climate change, and lack of access or energy poverty. Case studies on a diverse sampling of cities explore how prospective technologies and policies can be implemented. Includes intensive group research projects, discussion, and debate. Students taking the graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "D. Hsu"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.166 Law, Social Movements, and Public Policy: Comparative and International Experience"
        ],
        [
            "prerec",
            "Subject meets with 11.496"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Studies the interaction between law, courts, and social movements in shaping domestic and global public policy. Examines how groups mobilize to use law to affect change and why they succeed and fail. Case studies explore the interplay between law, social movements, and public policy in current issues, such as gender, race, labor, trade, climate change/environment, and LGBTQ rights. Introduces theories of public policy, social movements, law and society, and transnational studies. Students taking graduate version complete additional assignments. Limited to 15."
        ],
        [
            "inst",
            [
                "B. Rajagopal"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.167[J] Global Energy: Politics, Markets, and Policy"
        ],
        [
            "prerec",
            "Same subject as 14.47[J], 15.2191[J], 17.399[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 15.2191[J]. Preference to juniors, seniors, and Energy Minors."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.169 Global Climate Policy and Sustainability"
        ],
        [
            "prerec",
            "Subject meets with 11.269"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines climate politics both nationally and globally. Addresses economic growth, environmental preservation, and social equity through the lens of sustainability. Uses various country and regional cases to analyze how sociopolitical, economic and environmental values shape climate policy. Students develop recommendations for making climate policy more effective and sustainable. Students taking the graduate version complete additional assignments. Limited to 25."
        ],
        [
            "inst",
            [
                "J. Knox-Hayes"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.170 Cities and Climate Change: Mitigation and Adaptation"
        ],
        [
            "prerec",
            "Subject meets with 11.270"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines climate adaptation and mitigation responses at the city level. Discusses factors of greatest concern in adapting cities to climate change, including infrastructure; energy, food, and water systems; health; housing; and environmental justice. Various city and regional cases are used to analyze how cities are mobilizing to face climate change and integrate core considerations into urban planning. Working on independent case studies, students analyze how cities make urban planning decisions with respect to climate adaptation. In the process, students practice analytical skills to better understand how urban policies are made, and how they can be improved. Students develop recommendations for making climate adaptation more effective and sustainable at the city level. Assignment requirements differ for students completing the graduate version. Limited to 25."
        ],
        [
            "inst",
            [
                "J. Knox-Hayes"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.171 Indigenous Environmental Planning"
        ],
        [
            "prerec",
            "Subject meets with 11.271"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines how Indigenous peoples' relationships to their homelands and local environments has been adversely affected by Western planning. Explores how these relationships have changed over time as American Indians, Alaska Natives, and other groups indigenous to North America and Hawai'i have adapted to new conditions, including exclusion from markets of exchange, overhunting/overfishing, dispossession, petrochemical development, conservation, mainstream environmentalism, and climate change. Seeks to understand current environmental challenges and their roots and discover potential solutions to address these challenges. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "J. Knox-Hayes",
                "L. Susskind"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.173[J] Infrastructure Design for Climate Change"
        ],
        [
            "prerec",
            "Same subject as 1.103[J]\nSubject meets with 1.303[J], 11.273[J]"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "See description under subject 1.103[J]. Enrollment limited; preference to juniors and seniors."
        ],
        [
            "inst",
            [
                "H. Einstein"
            ]
        ]
    ],
    [
        "head",
        "Laboratories"
    ],
    [
        "block",
        [
            "title",
            "11.188 Introduction to Spatial Analysis and GIS Laboratory"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "An introduction to Geographic Information Systems (GIS), a tool for visualizing and analyzing spatial data. Explores how GIS can make maps, guide decisions, answer questions, and advocate for change. Class builds toward a project in which students critically apply GIS techniques to an area of interest. Students build data discovery, cartography, and spatial analysis skills while learning to reflect on their positionality within the research design process. Because maps and data are never neutral, the class incorporates discussions of power, ethics, and data throughout as part of a reflective practice. Instruction and practice in oral and written communication provided."
        ],
        [
            "inst",
            [
                "S. Williams",
                "C. D'Ignazio",
                "E. Huntley"
            ]
        ]
    ],
    [
        "head",
        "Tutorials, Fieldwork, and Internships"
    ],
    [
        "block",
        [
            "title",
            "11.UAR[J] Climate and Sustainability Undergraduate Advanced Research (New)"
        ],
        [
            "prerec",
            "Same subject as 1.UAR[J], 3.UAR[J], 5.UAR[J], 12.UAR[J], 15.UAR[J], 22.UAR[J]"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "See description under subject 1.UAR[J]. Application required; consult MCSC website for more information."
        ],
        [
            "inst",
            [
                "D. Plata",
                "E. Olivetti"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.UR Undergraduate Research"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Undergraduate research opportunities in Urban Studies and Planning. For further information, consult the Departmental Coordinators."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.URG Undergraduate Research"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Undergraduate research opportunities in Urban Studies and Planning. For further information, consult the Departmental Coordinators."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.THT[J] Thesis Research Design Seminar"
        ],
        [
            "prerec",
            "Same subject as 4.THT[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Designed for students writing a thesis in Urban Studies and Planning or Architecture. Develop research topics, review relevant research and scholarship, frame research questions and arguments, choose an appropriate methodology for analysis, and draft introductory and methodology sections."
        ],
        [
            "inst",
            [
                "C. Abbanat"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.THU Undergraduate Thesis"
        ],
        [
            "prerec",
            "Prereq: 11.THT[J]"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Program of research leading to the writing of an SB thesis. To be arranged by the student under approved supervision."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.189-11.190 Urban Fieldwork"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Practical application of city and regional planning techniques to towns, cities, and regions, including problems of replanning, redevelopment, and renewal of existing communities. Includes internships, under staff supervision, in municipal and state agencies and departments."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.191-11.192 Independent Study"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring)"
            ]
        ],
        [
            "desc",
            "For undergraduates wishing to pursue further study in specialized areas of urban studies or city and regional planning not covered in regular subjects."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.193-11.194 Supervised Readings"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Reading and discussion of topics in urban studies and planning."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.S03 Special Subject: Transportation Shaping Sustainable Urbanization: Connections with Behavior, Urban Economics and Planning"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall; partial term)"
            ]
        ],
        [
            "desc",
            "Explores changes in the built environment expected from transportation investments, and how they can be used to promote sustainable and equitable cities. Reflects on how notable characteristics of cities can be explained by their historical and current transportation features. Introduces theoretical basis and empirical evidence to analyze the urban transformation autonomous vehicles will bring and how shared mobility services affect travel behavior, and its implications from an urban planning perspective. Lectures interspersed with guest speakers and an optional field trip. Subject can count toward the 6-unit discovery-focused credit limit for first-year students. Licensed for Fall 2023 by the Committee on Curricula. Limited to 18."
        ],
        [
            "inst",
            [
                "F. Duarte",
                "A. Borges Costa"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.S04 Special Subject: Topics in Affordable Housing"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Weekly seminar-style discussions on topics in affordable housing, including federal funding programs, homelessness prevention and shelters, local land use and zoning for affordability, innovative housing models/designs, fair housing laws, the history of public housing in the US, and international comparisons. Subject can count toward the 6-unit discovery-focused credit limit for first year students."
        ],
        [
            "inst",
            [
                " Ezra Haber Glenn"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.S187 Special Subject: Urban Studies and Planning"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall; second half of term)"
            ]
        ],
        [
            "desc",
            "For undergraduates wishing to pursue further study or fieldwork in specialized areas of urban studies or city and regional planning not covered in regular subjects of instruction."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.S188 Special Subject: Urban Studies and Planning"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, IAP)"
            ]
        ],
        [
            "desc",
            "For undergraduates wishing to pursue further study or fieldwork in specialized areas of urban studies or city and regional planning not covered in regular subjects of instruction."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.S189 Special Subject: Urban Studies and Planning"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "For undergraduates wishing to pursue further study or fieldwork in specialized areas of urban studies or city and regional planning not covered in regular subjects of instruction."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.S195 Special Subject: Urban Studies and Planning"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "For undergraduates wishing to pursue further study or fieldwork in specialized areas of urban studies or city and regional planning not covered in regular subjects of instruction."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.S196-11.S199 Special Subject: Urban Studies and Planning"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "For undergraduates wishing to pursue further study or fieldwork in specialized areas of urban studies or city and regional planning not covered in regular subjects of instruction. 11.S198 is graded P/D/F."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "head",
        "Master's Core Subjects"
    ],
    [
        "block",
        [
            "title",
            "11.200 Gateway: Urban Studies and Planning 1"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Fall)"
            ]
        ],
        [
            "desc",
            "Introduces the theory and practice of planning and urban studies through exploration of the history of the field, case studies, and criticisms of traditional practice."
        ],
        [
            "inst",
            [
                "Faculty"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.201 Gateway: Urban Studies and Planning 2"
        ],
        [
            "prerec",
            "Prereq: 11.200"
        ],
        [
            "terms",
            [
                "G (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Builds on 11.200 by exploring in more detail contemporary planning tools and techniques, as well as case studies of planning and urban studies practice."
        ],
        [
            "inst",
            [
                "Faculty"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.202 Planning Economics"
        ],
        [
            "prerec",
            "Prereq: 11.203"
        ],
        [
            "terms",
            [
                "G (Fall; second half of term)"
            ]
        ],
        [
            "desc",
            "Students use economic theory tools acquired in 11.203 to understand the mutual processes of individual action and structural constraint and investigate crises in search of opportunities for mitigation and reparation. Investigates a variety of structural crises from throughout the realms of planning, such as: capitalism, climate change, and (in)action; white supremacy, segregation, and gentrification; colonialism, informality, and infrastructure; autocentricity and other legacies of the built environment."
        ],
        [
            "inst",
            [
                "D. Bunten"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.203 Microeconomics"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Fall; first half of term)"
            ]
        ],
        [
            "desc",
            "Students develop a suite of tools from economic theory to understand the mutual processes of individual action and structural constraint. Students apply these tools to human interaction and social decision-making. Builds an understanding of producer theory from the collaborative possibilities and physical constraints that unfold as production is scaled up. Presents consumer theory as the process of individuals doing the best for themselves, their families, and their communities -- subject to the sociostructural constraints under which they operate. Considers alternative frameworks of social welfare, with a specific focus on marginalization and crisis, as well as common policy interventions and their implications under different constructions of welfare."
        ],
        [
            "inst",
            [
                "D. Bunten"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.204[J] People and the Planet: Environmental Histories and Engineering"
        ],
        [
            "prerec",
            "Same subject as IDS.524[J]\nSubject meets with 11.004[J], STS.033[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Explores historical and cultural aspects of complex environmental problems and engineering approaches to sustainable solutions. Introduces quantitative analyses and methodological tools to understand environmental issues that have human and natural components. Demonstrates concepts through a series of historical and cultural analyses of environmental challenges and their engineering responses. Builds writing, quantitative modeling, and analytical skills in assessing environmental systems problems and developing engineering solutions. Through environmental data gathering and analysis, students engage with the challenges and possibilities of engineering in complex, interacting systems, and investigate plausible, symbiotic, systems-oriented solutions. Students taking graduate version complete additional analysis of reading assignments and a more in-depth and longer final paper."
        ],
        [
            "inst",
            [
                "A. Slocum",
                "R. Scheffler",
                "J. Trancik"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.205 Introduction to Spatial Analysis and GIS"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Fall, Spring; first half of term)"
            ]
        ],
        [
            "desc",
            "An introduction to Geographic Information Systems (GIS): a tool for visualizing and analyzing data representing locations and their attributes. GIS is invaluable for planners, scholars, and professionals who shape cities and a political instrument with which activists advocate for change. Class includes exercises to make maps, query databases, and analyze spatial data. Because maps and data are never neutral, the class incorporates discussions of power, ethics, and data throughout as part of a reflective practice. Limited enrollment; preference to first-year MCP students."
        ],
        [
            "inst",
            [
                "S. Williams",
                "C. D'Ignazio",
                "E. Huntley"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.206 Poverty and Economic Security"
        ],
        [
            "prerec",
            "Subject meets with 11.006"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Explores the evolution of poverty and economic security in the US within a global context. Examines the impacts of recent economic restructuring and globalization. Reviews current debates about the fate of the middle class, sources of increasing inequality, and approaches to advancing economic opportunity and security. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "A. Glasmeier"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.220 Quantitative Reasoning and Statistical Methods for Planning I"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Spring)"
            ]
        ],
        [
            "desc",
            "Develops logical, empirically based arguments using statistical techniques and analytic methods. Covers elementary statistics, probability, and other types of quantitative reasoning useful for description, estimation, comparison, and explanation. Emphasizes the use and limitations of analytical techniques in planning practice. Restricted to MCP students."
        ],
        [
            "inst",
            [
                "J. Steil"
            ]
        ]
    ],
    [
        "head",
        "Department-wide Subjects"
    ],
    [
        "block",
        [
            "title",
            "11.222 Introduction to Critical Qualitative Methods"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Spring)"
            ]
        ],
        [
            "desc",
            "Introduces qualitative methods as an approach to critical inquiry in urban planning research and practice. Emphasizes the importance of historical context, place-specificity, and the experiences and views of individuals as ways of knowing relationships of power and privilege between people, in place, and over time. Explores a range of critical qualitative methods including those used in archival, interview, observational, visual, and case study analysis."
        ],
        [
            "inst",
            [
                "K. Crockett"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.228[J] Collectives: New Forms of Sharing"
        ],
        [
            "prerec",
            "Same subject as 4.229[J]"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "See description under subject 4.229[J]. Limited to 15."
        ],
        [
            "inst",
            [
                "Consult R. Segal"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.233 Research Design for Policy Analysis and Planning"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall)"
            ]
        ],
        [
            "desc",
            "Develops skills in research design for policy analysis and planning. Emphasizes the logic of the research process and its constituent elements. Topics include philosophy of science, question formulation, hypothesis generation and theory construction, data collection techniques (e.g. experimental, survey, interview), ethical issues in research, and research proposal preparation. Limited to doctoral students in Course 11."
        ],
        [
            "inst",
            [
                "A. Glasmeier"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.234 Making Sense: Qualitative Methods for Designers and Planners"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Spring)"
            ]
        ],
        [
            "desc",
            "Surveys uses of qualitative methods and social theory in urban design and planning research and practice. Topics include observing environments, physical traces, and environmental behavior; asking questions; focused interviews; standardized questionnaires; use of written archival materials; use of visual materials, including photographs, new media, and maps; case studies; and comparative methods. Emphasizes use of each of these skills to collect and make sense of qualitative data in community and institutional settings."
        ],
        [
            "inst",
            [
                "E. C. James"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.236 Participatory Action Research (PAR)"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Fall)"
            ]
        ],
        [
            "desc",
            "Introduces students to participatory action research (PAR), an approach to research and inquiry that enables communities to examine and address consequential societal problems. Explores theoretical and practical questions at the heart of partnerships between applied social scientists and community partners. Focus includes the history of PAR and action research; debates regarding PAR as a form of applied social science; and practical, political, and ethical questions in the practice of PAR. Guides students through an iterative process for developing their own personal theories of practice. Covers co-designing and co-conducting research with community partners at various stages of the research process .Examines actual cases in which PAR-like methods have been used with greater or lesser success; and interaction with community members, organizations, and individuals who have been involved in PAR collaborations. "
        ],
        [
            "inst",
            [
                "M. Arcaya"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.238[J] Ethics of Intervention"
        ],
        [
            "prerec",
            "Same subject as 21A.409[J]"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "An historical and cross-cultural study of the logics and practices of intervention: the ways that individuals, institutions, and governments identify conditions of need or states of emergency within and across borders that require a response. Examines when a response is viewed as obligatory, when is it deemed unnecessary, and by whom; when the intercession is considered fulfilled; and the rationales or assumptions that are employed in assessing interventions. Theories of the state, globalization, and humanitarianism; power, policy, and institutions; gender, race, and ethnicity; and law, ethics, and morality are examined."
        ],
        [
            "inst",
            [
                "E. C. James"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.239 The City in Film"
        ],
        [
            "prerec",
            "Subject meets with 11.139"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Surveys important developments in urbanism from 1900 to the present, using film as a lens to explore and interpret aspects of the urban experience in the US and abroad. Topics include industrialization, demographics, diversity, the environment, and the relationship between the community and the individual. Films vary from year to year but always include a balance of classics from the history of film, an occasional experimental/avant-garde film, and a number of more recent, mainstream movies. Students taking undergraduate version complete writing assignments that focus on observation, analysis, and the essay, and give an oral presentation."
        ],
        [
            "inst",
            [
                "E. Glenn"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.243 Research Methods in Global Health and Development"
        ],
        [
            "prerec",
            "Subject meets with 11.143"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Provides training for students to critically analyze the relationship between \"health\" and \"development.\" Draws upon the theory and methods of medical anthropology, social medicine, public health, and development to track how culture, history, and political economy influence health and disease in global communities. Students work in teams to formulate research questions, and collect and analyze qualitative data in clinical and community settings in the greater Boston area, in order to design effective development interventions aimed at reducing health disparities in the US and abroad. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "E. C. James"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.244[J] Race, History, and the Built Environment"
        ],
        [
            "prerec",
            "Same subject as STS.424[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines how the development of the built environment produces and reproduces conceptions of race - sociobiological theories of human difference. Using historical and cross-cultural cases, tracks the social and political lives of material objects, infrastructures, technologies, and architectures using projects of settler colonialism, nation-building, community development and planning, and in post-conflict and post-disaster settings. Analyzes social theories of race, place, space, and materiality; power, identity, and embodiment; and memory, death, and haunting. Explores how conceptions of belonging, citizenship, and exclusion are represented and designed spatially through analysis of examples, such as the appropriation of land for infrastructure programs, the erasure and commemoration of heritage in public spaces, and the use of the built environment to impose colonial ideologies. Limited to 14 students."
        ],
        [
            "inst",
            [
                "Erica James"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.245[J] DesignX Entrepreneurship"
        ],
        [
            "prerec",
            "Same subject as 4.245[J]"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Students in teams accepted to the MITdesignX accelerator begin work on their ventures in this intense two-week bootcamp. Participants identify the needs and problems that demonstrate the demand for their innovative technology, policy, products, and/or services. They research and investigate various markets and stakeholders pertinent to their ventures, and begin to test their ideas and thesis in real-world interviews and interactions. Subject presented in workshop format, giving teams the chance to jump-start their ventures together with a cohort of people working on ideas that span the realm of design, planning real estate, and the human environment. Registration limited to students accepted to the MITdesignX accelerator in the fall."
        ],
        [
            "inst",
            [
                "S. Gronfeldt",
                "D. Frenchman",
                "G. Rosenzweig"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.246[J] DesignX Accelerator"
        ],
        [
            "prerec",
            "Same subject as 4.246[J]"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Students continue to work in their venture teams to advance innovative ideas, products, and services oriented to design, planning, and the human environment. Presented in a workshop format with supplementary lectures. Teams are matched with external mentors for additional support in business and product development. At the end of the term, teams pitch their ventures to an audience from across the school and MIT, investors, industry, and cities. Registration limited to students accepted to the MITdesignX accelerator in the fall."
        ],
        [
            "inst",
            [
                "S. Gronfeldt",
                "D. Frenchman",
                "G. Rosenzweig"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.250 Transportation Research Design"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Seminar dissects ten transportation studies from head to toe to illustrate how research ideas are initiated, framed, analyzed, evidenced, written, presented, criticized, revised, extended, and published, quoted and applied. Students learn by mimicking and learn by doing, and design and execute their own transportation research. Limited to 20."
        ],
        [
            "inst",
            [
                "J. Zhao"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.251 Frontier of Transportation Research"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Surveys the frontier of transportation research offered by 12 MIT faculty presenting their latest findings, ideas, and innovations. Students write weekly memos to reflect on these talks, make connections to their own research, and give short presentations."
        ],
        [
            "inst",
            [
                "Jinhua Zhao"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.252[J] Design and Development of Games for Learning"
        ],
        [
            "prerec",
            "Same subject as CMS.863[J]\nSubject meets with 11.127[J], CMS.590[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject CMS.863[J]."
        ],
        [
            "inst",
            [
                "E. Klopfer"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.255 Negotiation and Dispute Resolution in the Public Sector"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Spring)"
            ]
        ],
        [
            "desc",
            "Investigates social conflict and distributional disputes in the public sector. While theoretical aspects of conflict and consensus building are considered, focus is on the practice of negotiation and dispute resolution. Comparisons between unassisted and assisted negotiation are reviewed along with the techniques of facilitation and mediation."
        ],
        [
            "inst",
            [
                "L. Susskind"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.256[J] Encounters and Ruptures: Writing About the Modern City"
        ],
        [
            "prerec",
            "Same subject as 4.256[J]"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Through extensive reading and writing, students explore the promise and perils of the variegated city, focusing on topics that demand urgent attention: migration, climate change, inequality, racial injustice, and public space. Class strives to create artful narratives by examining how various forms — essay, memoir, longform journalism, poetry, fiction, film, and photography — illuminate our understanding of cities. Special emphasis on the writer as the reader's advocate and on the indispensability of the writer-editor relationship, with the goal of writing with greater creativity and sophistication for specialized and general interest audiences. Limited to 12 students."
        ],
        [
            "inst",
            [
                "G. Cadogan"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.257[J] China's Growth: Political Economy, Business, and Urbanization"
        ],
        [
            "prerec",
            "Same subject as 15.239[J]\nSubject meets with 11.157[J], 15.2391[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines different aspects of the growth of China, which has the second largest economy in the world. Studies the main drivers of Chinese economic growth and the forces behind the largest urbanization in human history. Discusses how to understand China's booming real estate market, and how Chinese firms operate to attain their success, whether through hard-working entrepreneurship or political connections with the government. Explores whether the top-down urban and industrial policy interventions improve efficiency or cause misallocation problems, and whether the Chinese political system in an enabler of Chinese growth or a potential impediment to the country's future growth prospects. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "Y. Huang",
                "S. Zheng",
                "Z. Tan"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.258 Sustainable Urbanization Research Seminar (New)"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Fall)"
            ]
        ],
        [
            "desc",
            "Reviews the seminal as well as latest research on the driving forces of urbanization, real estate markets, urban sustainability in both developed and developing economies. Examines the tensions as well as synergies between urbanization and sustainability, and designs and evaluates policies and business strategies that can enhance the synergies while reduce the tensions. Covers various research topics under the umbrella of urbanization under three modules (sustainable urbanization; sustainable real estate; urbanization in emerging economies) where students study the initiation of an idea to its publication, including but not limited to, analyzing, framing, writing and critiquing as parts of the process. Sessions are organized as a semi-structured dialogue."
        ],
        [
            "inst",
            [
                "Siqi Zheng"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.259 Entrepreneurial Negotiation"
        ],
        [
            "prerec",
            "Subject meets with 11.159"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Combines online weekly face-to-face negotiation exercises and in-person lectures designed to empower budding entrepreneurs with negotiation techniques to protect and increase the value of their ideas, deal with ego and build trust in relationships, and navigate entrepreneurial bargaining under constraints of economic uncertainty and complex technical considerations. Students must complete scheduled weekly assignments, including feedback memos to counterpart negotiators, and meet on campus with the instructor to discuss and reflect on their experiences with the course. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "L. Susskind"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.260 Sustainable Development and Institutions"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Fall)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Explores the theory and application of the principles of sustainable development as they relate to organizational change management, decision-making processes, goal setting methodology and solution development. Leverages the MIT campus as a living laboratory to gain unique insight into the change management and solution development process. Limited to 18."
        ],
        [
            "inst",
            [
                "J. Newman"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.263[J] Urban Last-Mile Logistics"
        ],
        [
            "prerec",
            "Same subject as 1.263[J], SCM.293[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=SCM.254\" title=\"SCM.254\" class=\"bubblelink code\" onclick=\"return showCourse(this, 'SCM.254');\">SCM.254</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "See description under subject SCM.293[J]."
        ],
        [
            "inst",
            [
                "M.  Winkenbach"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.267[J] Global Energy: Politics, Markets, and Policy"
        ],
        [
            "prerec",
            "Same subject as 15.219[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 15.219[J]."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.268 Laws of the Land: Land Use and Environmental Law and Policy (New)"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Fall)"
            ]
        ],
        [
            "desc",
            "Environmental justice and climate change are pressing contemporary concerns.  Crucial dimensions of the exposure of households to environmental harms and benefits are determined by land use and environmental laws.  Land use and environmental laws are also central to reducing carbon emissions and building environmentally sustainable and resilient communities.  Introduces students to the legal and social science dimension of these two crucial areas of law that is well-covered in the current curriculum. Enrollment limited to 30."
        ],
        [
            "inst",
            [
                "J. Steil"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.269 Global Climate Policy and Sustainability"
        ],
        [
            "prerec",
            "Subject meets with 11.169"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines climate politics both nationally and globally. Addresses economic growth, environmental preservation, and social equity through the lens of sustainability. Uses various country and regional cases to analyze how sociopolitical, economic and environmental values shape climate policy. Students develop recommendations for making climate policy more effective and sustainable. Students taking graduate version complete additional assignments. Limited to 25."
        ],
        [
            "inst",
            [
                "J. Knox-Hayes"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.270 Cities and Climate Change: Mitigation and Adaptation"
        ],
        [
            "prerec",
            "Subject meets with 11.170"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines climate adaptation and mitigation responses at the city level. Discusses factors of greatest concern in adapting cities to climate change, including infrastructure; energy, food, and water systems; health; housing; and environmental justice. Various city and regional cases are used to analyze how cities are mobilizing to face climate change and integrate core considerations into urban planning. Working on independent case studies, students analyze how cities make urban planning decisions with respect to climate adaptation. In the process, students practice analytical skills to better understand how urban policies are made, and how they can be improved. Students develop recommendations for making climate adaptation more effective and sustainable at the city level. Assignment requirements differ for students completing the graduate version. Limited to 25."
        ],
        [
            "inst",
            [
                "J. Knox-Hayes"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.271 Indigenous Environmental Planning"
        ],
        [
            "prerec",
            "Subject meets with 11.171"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines how Indigenous peoples' relationships to their homelands and local environments has been adversely affected by Western planning. Explores how these relationships have changed over time as American Indians, Alaska Natives, and other groups indigenous to North America and Hawai'i have adapted to new conditions, including exclusion from markets of exchange, overhunting/overfishing, dispossession, petrochemical development, conservation, mainstream environmentalism, and climate change. Seeks to understand current environmental challenges and their roots and discover potential solutions to address these challenges. Students taking graduate version complete additional assignments. Limited to 25."
        ],
        [
            "inst",
            [
                "J. Knox-Hayes",
                "L. Susskind"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.273[J] Infrastructure Design for Climate Change"
        ],
        [
            "prerec",
            "Same subject as 1.303[J]\nSubject meets with 1.103[J], 11.173[J]"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "See description under subject 1.303[J]."
        ],
        [
            "inst",
            [
                "H. Einstein"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.274 Cybersecurity Clinic"
        ],
        [
            "prerec",
            "Subject meets with 11.074"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Provides an opportunity for MIT students to become certified in methods of assessing the vulnerability of public agencies (particularly agencies that manage critical urban infrastructure) to the risk of cyberattack. Certification involves completing an 8-hour, self-paced, online set of four modules during the first four weeks of the semester followed by a competency exam. Students who successfully complete the exam become certified. The certified students work in teams with client agencies in various cities around the United States. Through preparatory interactions with the agencies, and short on-site visits, teams prepare vulnerability assessments that client agencies can use to secure the technical assistance and financial support they need to manage the risks of cyberattack they are facing. Students taking graduate version complete additional assignments. Limited to 15."
        ],
        [
            "inst",
            [
                "L. Susskind"
            ]
        ]
    ],
    [
        "head",
        "Program Group Subjects"
    ],
    [
        "block",
        [
            "title",
            "11.301[J] Introduction to Urban Design and Development"
        ],
        [
            "prerec",
            "Same subject as 4.252[J]"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Examines the physical and social structure of cities and ways they can be changed. Includes significant thinkers in urban form, 20th-century American city design, urban design and society, global urban design, and design of neighborhoods and streets. Core lectures are supplemented by student papers examining the relationship of contemporary projects to history and theory, and factors of high quality global urban design and development. Guest speakers present cases involving current projects or research illustrating scope and methods of urban design theory and practice. Intended for those seeking an introduction to fundamental knowledge of theory and praxis in city design and development."
        ],
        [
            "inst",
            [
                "B. Ryan"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.302[J] Urban Design Politics"
        ],
        [
            "prerec",
            "Same subject as 4.253[J]"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Examines ways that urban design contributes to distribution of political power and resources in cities. Investigates the nature of relations between built form and political purposes through close study of public and private sector design commissions and planning processes that have been clearly motivated by political pressures, as well as more tacit examples. Lectures and discussions focus on cases from both developed and developing countries."
        ],
        [
            "inst",
            [
                "L. Vale"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.303[J] Real Estate Development Studio"
        ],
        [
            "prerec",
            "Same subject as 4.254[J]"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Focuses on the synthesis of urban, mixed-use real estate projects, including the integration of physical design and programming with finance and marketing. Interdisciplinary student teams analyze how to maximize value across multiple dimensions in the process of preparing professional development proposals for sites in US cities and internationally. Reviews emerging real estate products and innovative developments to provide a foundation for studio work. Two major projects are interspersed with lectures and field trips. Integrates skills and knowledge in the MSRED program; also open to other students interested in real estate development by permission of the instructors."
        ],
        [
            "inst",
            [
                "K. Shen"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.304[J] Site and Environmental Systems Planning"
        ],
        [
            "prerec",
            "Same subject as 4.255[J]"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Introduces a range of practical approaches involved in evaluating and planning sites within the context of natural and cultural systems. Develops the knowledge and skills to analyze and plan a site for development through exercises and an urban design project. Topics include land inventory, urban form, spatial organization of uses, parcelization, design of roadways, grading, utility systems, off-site impacts, and landscape strategies."
        ],
        [
            "inst",
            [
                "E. Ben-Joseph",
                "M. A. Ocampo"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.305 Doing Good by Doing Well: Planning and Development Case Studies that Promote both the Public Good and Real Estate Value"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Fall)"
            ]
        ],
        [
            "desc",
            "Seminar studies how the messy and complex forces of politics, planning and the real estate market have collectively shaped Boston's urban fabric and skyline in the last two decades. Using some of the city's most important real estate development proposals as case studies, students dissect and analyze Boston's negotiated development review and permitting process to understand what it takes beyond a great development concept and a sound financial pro forma to earn community and political support. Throughout the term, students identify strategies for success and pitfalls for failure within this intricate approval process, as well as how these lessons can be generalized and applied to other cities and real estate markets."
        ],
        [
            "inst",
            [
                "K. Shen"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.307[J] China Urban Design Studio"
        ],
        [
            "prerec",
            "Same subject as 4.173[J]"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Design studio that includes architects, urban designers, and city planners working in teams on a contemporary development project of importance in China, particularly in transitional, deindustrializing cities. Students analyze conditions, explore alternatives, and synthesize architecture, city design, and implementation plans. Lectures and brief study tours expose students to history and contemporary issues of urbanism in China. Offered every other spring at MIT in parallel with urban design studio at Tsinghua University, Beijing, involving students and faculty from both schools. Field visit to China will occur in January prior to studio. Limited to 10."
        ],
        [
            "inst",
            [
                "B. Ryan"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.308[J] Ecological Urbanism Seminar"
        ],
        [
            "prerec",
            "Same subject as 4.213[J]"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Weds the theory and practice of city design and planning as a means of adaptation with the insights of ecology and other environmental disciplines. Presents ecological urbanism as critical to the future of the city and its design, as it provides a framework for addressing challenges that threaten humanity — such as climate change, rising sea level, and environmental and social justice — while fulfilling human needs for health, safety, welfare, meaning, and delight. Applies a historical and theoretical perspective to the solution of real-world challenges.  Enrollment limited."
        ],
        [
            "inst",
            [
                "A. Spirn"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.309[J] Sensing Place: Photography as Inquiry"
        ],
        [
            "prerec",
            "Same subject as 4.215[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Explores photography as a disciplined way of seeing, and as a medium of inquiry and of expressing ideas. Readings, observations, and photographs form the basis of discussions on landscape, light, significant detail, place, poetics, narrative, and how photography can inform research, design and planning, among other issues. Recommended for students who want to employ visual methods in their theses.  Enrollment limited."
        ],
        [
            "inst",
            [
                "A. Spirn"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.312 Engaging Community: Models and Methods for Strengthening Democracy"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Spring)"
            ]
        ],
        [
            "desc",
            "Examines the demographic complexity of cities and their fundamental design challenges for planners and other professions responsible for engaging the public. Working with clients, participants learn design principles for creating public engagement practices necessary for building inclusive civic infrastructure in cities. Participants also have the opportunity to review and practice strategies, techniques, and methods for engaging communities in demographically complex settings."
        ],
        [
            "inst",
            [
                "C. McDowell"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.313 Advanced Research Workshop in Landscape and Urbanism"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Fall)"
            ]
        ],
        [
            "desc",
            "In-depth research workshop on pressing socio-economic and environmental design issue of our time, includes discussion and practices with real-world stakeholders experimenting with new development typologies and technologies. The goal is to generate well-grounded, design-based solutions and landscape infrastructural responses to the physical design problem being addressed. Specific focus and practicum status is adjusted on a year-to-year basis."
        ],
        [
            "inst",
            [
                "A. Berger"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.315[J] Disaster Resilient Design"
        ],
        [
            "prerec",
            "Same subject as 4.217[J]\nSubject meets with 4.218"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 4.217[J]. Limited to 15."
        ],
        [
            "inst",
            [
                "Consult M. Mazereeuw"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.318 Senseable Cities"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Studies how ubiquitous and real-time information technology can help us to understand and improve cities and regions. Explores the impact of integrating real-time information technology into the built environment. Introduces theoretical foundations of ubiquitous computing. Provides technical tools for tactile development of small-scale projects. Limited to 24."
        ],
        [
            "inst",
            [
                "C. Ratti"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.320 Digital City Design Workshop"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Spring)"
            ]
        ],
        [
            "desc",
            "Students develop proposals, at the city and neighborhood scales, that integrate urban design, planning, and digital technology. Aims to create more efficient, responsive, and livable urban places and systems that combine physical form with digital media, sensing, communications, and data analysis. Students conduct field research, build project briefs, and deliver designs or prototypes, while supported by lectures, case studies, and involvement from experts and representatives of subject cities. Limited to 12."
        ],
        [
            "inst",
            [
                "C. Ratti"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.321 Data Science and Real Estate"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Spring)"
            ]
        ],
        [
            "desc",
            "Introduces the principles of data science and how data science is impacting cities and real estate, with a combination of fundamental lectures, guest speakers, and use cases. Explores how data science has been adopted by the real estate industry — from developers to city planners. Presents practical skills in data science and provides the opportunity for students to produce their own work and practice basic coding skills applied to real estate."
        ],
        [
            "inst",
            [
                "F. Duarte"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.323 International Real Estate Transactions"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Spring; second half of term)"
            ]
        ],
        [
            "desc",
            "Focuses on analyzing a variety of unique international real estate investment and development transactions. Blends real estate investing and development decision-making with discussion-based learning from a multidisciplinary standpoint. Seeks to facilitate a richer understanding of domestic (US) real estate transaction concepts by contextualizing them in the general analytical framework underpinning international real estate investment decision-making."
        ],
        [
            "inst",
            [
                "M. Srivastava"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.324 Modeling Pedestrian Activity in Cities"
        ],
        [
            "prerec",
            "Subject meets with 11.024"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Investigates the interaction between pedestrian activity, urban form, and land-use patterns in relatively dense urban environments. Informed by recent literature on pedestrian mobility, behavior, and biases, subject takes a practical approach, using software tools and analysis methods to operationalize and model pedestrian activity. Uses simplified yet powerful and scalable network analysis methods that focus uniquely on pedestrians, rather than engaging in comprehensive travel demand modeling across all modes. Emphasizes not only modeling or predicting pedestrian activity in given built settings, but also analyzing and understanding how changes in the built environment — land use changes, density changes, and connectivity changes — can affect pedestrian activity. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "A. Sevtsuk "
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.325 Technological Change & Innovation for Real Estate and Cities"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Fall; second half of term)"
            ]
        ],
        [
            "desc",
            "Seeks to examine the technological change and innovation that is disrupting the foundation of how we create the built environment. Through a series of educational workshops, students scout, catalog, and track technologies by looking at new real estate uses, products, processes, and organizational strategies at MIT labs and around the globe. Participants contribute to an interactive web tool, \"The Tech Tracker,\" which provides technology intelligence to students and real estate professionals to enhance their understanding of technological progress."
        ],
        [
            "inst",
            [
                "F. Duarte",
                "J. Scott"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.328[J] Urban Design Skills: Observing, Interpreting, and Representing the City"
        ],
        [
            "prerec",
            "Same subject as 4.240[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Introduces methods for observing, interpreting, and representing the urban environment. Students draw on their senses and develop their ability to deduce, question, and test conclusions about how the built environment is designed, used, and valued. The interrelationship of built form, circulation networks, open space, and natural systems are a key focus. Supplements existing classes that cover theory and history of city design and urban planning and prepares students without design backgrounds with the fundamentals of physical planning. Intended as a foundation for 11.329[J]."
        ],
        [
            "inst",
            [
                "E. Ben-Joseph",
                "M. Ocampo "
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.329[J] Advanced Urban Design Skills: Observing, Interpreting, and Representing the City"
        ],
        [
            "prerec",
            "Same subject as 4.248[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=11.328\" title=\"11.328[J]\" class=\"bubblelink code\" onclick=\"return showCourse(this, '11.328');\">11.328[J]</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Through a studio-based course in planning and urban design, builds on the foundation acquired in 11.328[J] to engage in creative exploration of how design contributes to resilient, just, and vibrant urban places. Through the planning and design of two projects, students creatively explore spatial ideas and utilize various digital techniques to communicate their design concepts, giving form to strategic thinking. Develops approaches and techniques to evaluate the plural structure of the built environment and offer propositions that address policies and regulations as well as the values, behaviors, and wishes of the different users."
        ],
        [
            "inst",
            [
                "E. Ben-Joseph",
                "M. Ocampo"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.330[J] The Making of Cities"
        ],
        [
            "prerec",
            "Same subject as 4.241[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=11.001\" title=\"11.001[J]\" class=\"bubblelink code\" onclick=\"return showCourse(this, '11.001');\">11.001[J]</a>, <a href=\"/search/?P=11.301\" title=\"11.301[J]\" class=\"bubblelink code\" onclick=\"return showCourse(this, '11.301');\">11.301[J]</a>, or permission of instructor "
            ]
        ],
        [
            "desc",
            "See description under subject 4.241[J]."
        ],
        [
            "inst",
            [
                "L. Jacobi",
                "R. Segal"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.332[J] Urban Design Studio"
        ],
        [
            "prerec",
            "Same subject as 4.163[J]"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "See description under subject 4.163[J]."
        ],
        [
            "inst",
            [
                "Consult R. Segal"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.333[J] Urban Design Seminar: Perspectives on Contemporary Practice"
        ],
        [
            "prerec",
            "Same subject as 4.244[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines innovations in urban design practice occurring through the work of leading practitioners in the fields of architecture, landscape architecture, and urban planning. Features lectures by major national and global practitioners in urban design. Projects and topics vary based on term and speakers but may cover architectural urbanism, landscape and ecology, arts and culture, urban design regulation and planning agencies, and citywide and regional design. Focuses on analysis and synthesis of themes discussed in presentations and discussions."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.334[J] Advanced Seminar in Landscape and Urbanism"
        ],
        [
            "prerec",
            "Same subject as 4.264[J]"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Explores theories, practices, and emerging trends in the fields of landscape architecture and urbanism, such as systemic design, landscape urbanism, engineered nature, drosscapes, urban biodiversity, urban mobility, megaregions, and urban agriculture. Lectures, readings, and guest speakers present a wide array of multi-disciplinary topics, including current works from P-REX lab. Students conduct independent and group research that is future-oriented."
        ],
        [
            "inst",
            [
                "A. Berger"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.337[J] Urban Design Ideals and Action"
        ],
        [
            "prerec",
            "Same subject as 4.247[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines the relationship between urban design ideals, urban design action, and the built environment through readings, discussions, presentations, and papers. Analyzes the diverse design ideals that influence cities and settlements, and investigates how urban designers use them to shape urban form. Provides a critical understanding of the diverse formal methods used to intervene creatively in both developed and developing contexts, especially pluralistic and informal built environments."
        ],
        [
            "inst",
            [
                "B. Ryan"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.338 Urban Design Studio"
        ],
        [
            "prerec",
            "Prereq: 11.328[J] or permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Fall)"
            ]
        ],
        [
            "desc",
            "Examines the rehabilitation and re-imagination of a city, region, or territory. Analyzes human settlement at multiple scales: regional, citywide, neighborhood, and individual dwellings. Aims to shape innovative design solutions, enhance social amenity, and improve economic equity through strategic and creative geographical, urban design and architectural thinking. Intended for students with backgrounds in architecture, community development, urban design, and physical planning. Limited to 12 via application and lottery."
        ],
        [
            "inst",
            [
                "B. Ryan"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.339 Downtown"
        ],
        [
            "prerec",
            "Subject meets with 11.026[J], 21H.321[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Seminar on downtown in US cities from the late 19th century to the late 20th. Emphasis on downtown as an idea, place, and cluster of interests, on the changing character of downtown, and on recent efforts to rebuild it. Topics considered include subways, skyscrapers, highways, urban renewal, and retail centers. Focus on readings, discussions, and individual research projects. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "R. M. Fogelson"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.344[J] Innovative Project Delivery in the Public and Private Sectors"
        ],
        [
            "prerec",
            "Same subject as 1.472[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Develops a strong strategic understanding of how best to deliver various types of projects in the built environment. Examines the compatibility of various project delivery methods, consisting of organizations, contracts, and award methods, with certain types of projects and owners. Six methods examined: traditional general contracting; construction management; multiple primes; design-build; turnkey; and build-operate-transfer. Includes lectures, case studies, guest speakers, and a team project to analyze a case example."
        ],
        [
            "inst",
            [
                "C. M. Gordon"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.345[J] Entrepreneurship in the Built Environment"
        ],
        [
            "prerec",
            "Same subject as 1.462[J]"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Introduction to entrepreneurship and how it shapes the world we live in. Through experiential learning in a workshop setting, students start to develop entrepreneurial mindset and skills. Through a series of workshops, students are introduced to the concept of Venture Design to create new venture proposals for the built environment as a method to understand the role of the entrepreneur in the fields of design, planning, real estate, and other related industries."
        ],
        [
            "inst",
            [
                "S. Gronfeldt",
                "G. Rosenzweig"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.350 Sustainable Real Estate: Economics & Business"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Spring)"
            ]
        ],
        [
            "desc",
            "Offers insight into tension and synergy between sustainability and the real estate industry. Considers why sustainability matters for real estate, how real estate can contribute to sustainability and remain profitable, and what investment and market opportunities exist for sustainable real estate products and how they vary across asset classes. Lectures combine economic and business insights and tools to understand the challenges and opportunities of sustainable real estate. Provides a framework to understand issues in sustainability in real estate and examine economic mechanisms, technological advances, business models, and investment and financing strategies available to promote sustainability. Discusses buildings as basic physical assets; cities as the context where buildings interact with the built environment, policies, and urban systems; and portfolios as sustainable real estate investment vehicles in capital markets. Enrollment for MSRED, MCP, and MBA students is prioritized."
        ],
        [
            "inst",
            [
                "Zheng",
                "Siqi; Tan",
                "Zhengzhen"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.351 Real Estate Ventures I: Negotiating Development-Phase Agreements"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Fall)"
            ]
        ],
        [
            "desc",
            "Focuses on key business and legal issues within the principal agreements used to control, entitle, capitalize, and construct a mixed-use real estate development. Through the lens of the real estate developer and its counter-parties, students identify, discuss, and negotiate the most important business issues in right of entry, purchase and sale, development, and joint-venture agreements, as well as a construction contract and construction loan agreement. Students work closely with attorneys who specialize in the construction of such agreements and with students from area law schools and Columbia University and New York University. Enrollment limited to approximately 25; preference to MSRED students. No listeners."
        ],
        [
            "inst",
            [
                "W. T. McGrath"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.352 Real Estate Ventures II: Negotiating Leases, Financings, and Restructurings"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Spring)"
            ]
        ],
        [
            "desc",
            "Focuses on key business and legal issues within the principal agreements used to lease, finance, and restructure a real estate venture. Through the lens of the real estate developer and its counter-parties, students identify, discuss and negotiate the most important business issues in office and retail leases, and permanent loan, mezzanine loan, inter-creditor, standstill/forbearance, and loan modification (workout) agreements. Students work closely with attorneys who specialize in the construction of such agreements and with students from area law schools and New York University and Columbia University. Single-asset real estate bankruptcy and the federal income tax consequences of debt restructuring are also addressed. Limited to 25; preference to MSRED students; no Listeners."
        ],
        [
            "inst",
            [
                "W. T. McGrath"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.353[J] Securitization of Mortgages and Other Assets"
        ],
        [
            "prerec",
            "Same subject as 15.429[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=11.431\" title=\"11.431[J]\" class=\"bubblelink code\" onclick=\"return showCourse(this, '11.431');\">11.431[J]</a>, <a href=\"/search/?P=15.401\" title=\"15.401\" class=\"bubblelink code\" onclick=\"return showCourse(this, '15.401');\">15.401</a>, or permission of instructor "
            ]
        ],
        [
            "desc",
            "Investigates the economics and finance of securitization. Considers the basic mechanics of structuring deals for various asset-backed securities. Investigates the pricing of pooled assets, using Monte Carlo and other option pricing techniques, as well as various trading strategies used in these markets. Limited to 55."
        ],
        [
            "inst",
            [
                "W. Torous"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.355 International Housing Economics and Finance"
        ],
        [
            "prerec",
            "Prereq: 11.202, 11.203, 14.01, or permission of instructor"
        ],
        [
            "terms",
            [
                "G (Spring)"
            ]
        ],
        [
            "desc",
            "Presents a theory of comparative differences in international housing outcomes. Introduces institutional differences in ways housing expenditures are financed, and economic determinants of housing outcomes (construction costs, land values, housing quality, ownership rates). Analyzes flow of funds to and from the different national housing finance sectors. Develops an understanding of the greater financial and macroeconomic implications of mortgage credit sector, and how policies affect ways housing asset fluctuations impact national economies. Considers perspective of investors in international real estate markets and risks and rewards involved. Draws on lessons from international comparative approach, applies them to economic and finance policies at the local, state/provincial, and federal levels within country of choice. Meets with 11.145 when offered concurrently. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "A. Saiz"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.356 Healthy Cities: Assessing Health Impacts of Policies and Plans"
        ],
        [
            "prerec",
            "Subject meets with 11.156"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines the built, psychosocial, economic, and natural environment factors that affect health behaviors and outcomes, including population-level patterns of disease distribution and health disparities. Introduces tools designed to integrate public health considerations into policy-making and planning. Provides extensive practical, budgeting, and programming training in the application of health impact assessment tools meant to integrate Health in All Policies, including Health Impact Assessment (HIA) methodology, which brings a health lens to policy, budgeting, and planning debates. Emphasizes health equity and healthy cities, and explores the relationship between health equity and broader goals for social and racial justice. Students taking graduate version complete additional assignments. Limited to 30."
        ],
        [
            "inst",
            [
                "M. Arcaya"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.360 Community Growth and Land Use Planning"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall)"
            ]
        ],
        [
            "desc",
            "Seminar, workshops, and fieldwork on strategies to use municipal land use regulations to shape urban growth and equity. Practicum workshop builds skills in civic engagement, policy-relevant research, zoning regulations, and physical design and planning. The workshop begins with implementation of qualitative and quantitative research into the existing built environment, social, economic, and political context. It continues with the planning, design, and implementation of community engagement strategies to shape goals and vision for the projects. The practicum then explores land use scenarios, design and innovative zoning and regulatory techniques, to improve equity in the areas of housing, environment, economic development, mobility, and the public realm. Projects arranged with small teams serving municipal clients experiencing pressures of urban growth and change in Massachusetts. Preference to MCP second year students."
        ],
        [
            "inst",
            [
                "J. Levine "
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.365 Sustainable Urbanization Practicum"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Working with a city development client (city government/real estate developer/NGO) in a fast-urbanizing region, practicum provides students an opportunity to synthesize policy, planning or urban science solutions towards sustainable urbanization, within the constraints of a client-based project. Priority is given to MCP students."
        ],
        [
            "inst",
            [
                "S. Zheng"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.367 Land Use Law and Politics: Race, Place, and Law"
        ],
        [
            "prerec",
            "Subject meets with 11.067"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Explores conceptions of spatial justice and introduces students to basic principles of US law and legal analysis, focused on land use, equal protection, civil rights, fair housing, and local government law, in order to examine who should control how land is used. Examines the rights of owners of land and the types of regulatory and market-based tools that are available to control land use. Explores basic principles of civil rights and anti-discrimination law and focuses on particular civil rights problems associated with the land use regulatory system, such as exclusionary zoning, residential segregation, the fair distribution of undesirable land uses, and gentrification. Introduces basic skills of statutory drafting and interpretation. Assignments differ for those taking the graduate version."
        ],
        [
            "inst",
            [
                "J. Steil"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.368 Environmental Justice: Law and Policy"
        ],
        [
            "prerec",
            "Subject meets with 11.148"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Introduces frameworks for analyzing and addressing inequalities in the distribution of environmental benefits and burdens, particularly by race and by class. Explores the foundations and principles of the environmental justice movement from the perspectives of social science, public policy, and law. Introduces basic principles of US constitutional and environmental law, with a focus on equal protection and civil rights. Applies environmental justice principles to contemporary issues in urban policy and planning, including effects of and responses to climate change and global heating. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "J. Steil"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.371[J] Sustainable Energy"
        ],
        [
            "prerec",
            "Same subject as 1.818[J], 2.65[J], 10.391[J], 22.811[J]\nSubject meets with 2.650[J], 10.291[J], 22.081[J]"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "See description under subject 22.811[J]."
        ],
        [
            "inst",
            [
                "M. W. Golay"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.373[J] Science, Politics, and Environmental Policy"
        ],
        [
            "prerec",
            "Same subject as 12.885[J]\nSubject meets with 12.385"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "See description under subject 12.885[J]."
        ],
        [
            "inst",
            [
                "S. Solomon",
                "J. Knox-Hayes"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.381 Infrastructure Systems in Theory and Practice"
        ],
        [
            "prerec",
            "Prereq: (14.01 and (11.202 or 11.203)) or permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Spring)"
            ]
        ],
        [
            "desc",
            "Examines theories of infrastructure from science and technology studies, history, economics, and anthropology in order to understand the prospects for change for many new and existing infrastructure systems. Examines how these theories are then implemented within systems in the modern city, including but not limited to, energy, water, transportation, and telecommunications infrastructure. Seminar is conducted with intensive group research projects, in-class discussions and debates."
        ],
        [
            "inst",
            [
                "D. Hsu"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.382 Water Diplomacy: The Science, Policy, and Politics of Managing Shared Resources"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Spring)"
            ]
        ],
        [
            "desc",
            "Examines the history and dynamics of international environmental treaty-making, or what is called environmental diplomacy. Emphasizes climate change and other atmospheric, marine resource, global waste management and sustainability-related treaties and the problems of implementing them. Reviews the legal, economic, and political dynamics of managing shared resources, involving civil society on a global basis, and enforcing transboundary agreements. Focuses especially on principles from international relations, international law, environmental management, and negotiation theory as they relate to common-pool resource management."
        ],
        [
            "inst",
            [
                "L. Susskind"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.383[J] People and Profits: Shaping the Future of Work"
        ],
        [
            "prerec",
            "Same subject as 15.662[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 15.662[J]."
        ],
        [
            "inst",
            [
                "A. Stansbury"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.387 Environmental Finance and Political Economy"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Examines the sociopolitical, cultural and economic dimensions of the financialization of environmental goods and services. Provides an introduction to key financial terms, practices, and institutions; analyzes the logics and origins of environmental finance, as well as the operation and implications of particular systems such as carbon-trading, REDD and ecosystem service pricing and swapping. Limited to 15."
        ],
        [
            "inst",
            [
                "J. Knox-Hayes"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.388[J] Dimensions of Geoengineering"
        ],
        [
            "prerec",
            "Same subject as 1.850[J], 5.000[J], 10.600[J], 12.884[J], 15.036[J], 16.645[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 5.000[J]. Limited to 100."
        ],
        [
            "inst",
            [
                "J. Deutch",
                "M. Zuber"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.401 Introduction to Housing, Community, and Economic Development"
        ],
        [
            "prerec",
            "Subject meets with 11.041"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Provides a critical introduction to the shape and determinants of political, social, and economic inequality in America, with a focus on racial and economic justice. Explores the role of the city in visions of justice. Analyzes the historical, political, and institutional contexts of housing and community development policy in the US, including federalism, municipal fragmentation, and decentralized public financing. Introduces major dimensions in US housing policy, such as housing finance, public housing policy, and state and local housing affordability mechanisms. Reviews major themes in community economic development, including drivers of economic inequality, small business policy, employment policy, and cooperative economics. Expectations and evaluation criteria differ for students taking graduate version."
        ],
        [
            "inst",
            [
                "J. Steil"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.402 Urban Politics: Race and Political Change"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Fall)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Examines the place of US cities in political theory and practice. Particular attention given to contemporary issues of racial polarization, demographic change, poverty, sprawl, and globalization. Specific cities are a focus for discussion."
        ],
        [
            "inst",
            [
                "J. P. Thompson"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.403 Urban China Research Seminar"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Examines the behavioral foundations and key policy issues of urban development, real estate markets, and sustainability in China. Discusses urban agglomeration economies, place-based investment, and urban vibrancy; economic geography of innovation and entrepreneurship; real estate dynamics and housing policies; land use and transportation; and urban quality of life and green cities, focusing on China but with some international comparisons."
        ],
        [
            "inst",
            [
                "S. Zheng"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.404 Housing Policy and Planning in the US and Abroad"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Explores the policy tools and planning techniques used to formulate and implement housing strategies at local, state and federal levels. Topics include America's housing finance system and the causes of instability in mortgage markets; economic and social inequity in access to affordable housing; approaches to meeting community housing needs through local and state planning programs; programs for addressing homelessness; and emerging ideas about sustainable development and green building related to housing development and renovation. Introduces comparative policy approaches from other countries."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.405 Political Economy & Society"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Focuses on the connection (or not) between mind (theory) and matter (lived experience). Examines basic tenets of classical and recent political economic theories and their explication in ideas of market economies, centrally planned economies, social market economies, and co-creative economies. Assesses theories according to their relation to the lived experiences of people in communities and workplaces."
        ],
        [
            "inst",
            [
                "J. P. Thompson"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.407 Tools and Techniques for Inclusive Economic Development"
        ],
        [
            "prerec",
            "Subject meets with 11.107"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Introduces tools and techniques in economic development planning. Extensive use of data collection, analysis, and display techniques. Students build interpretive intuition skills through user experience design activities and develop a series of memos summarizing the results of their data analysis. These are aggregated into a final report, and include the tools developed over the semester. Students taking graduate version will complete modified assignments focused on developing computer applications."
        ],
        [
            "inst",
            [
                "A. Glasmeier"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.409 The Institutions of Modern Capitalism: States and Markets"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Fall)"
            ]
        ],
        [
            "desc",
            "Investigates the relationship between states and markets in the evolution of modern capitalism. Critically assesses the rise of what Karl Polanyi and Albert Hirschman have referred to as \"market society:\" a powerful conceptual framework that views the development of modern capitalism not as an outcome of deterministic economic and technological forces, but rather as the result of contingent social and political processes. Exposes students to a range of conceptual tools and analytic frameworks through which to understand the politics of economic governance and to consider the extent to which societal actors can challenge its limits and imagine alternative possibilities. Sub-themes vary from year to year and have focused on racial capitalism, markets and morality, urban futures, and the global financial crisis. Limited to 25."
        ],
        [
            "inst",
            [
                "J. Jackson"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.411 The Political Economy of Planning"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Fall)"
            ]
        ],
        [
            "desc",
            "Introduces students to key planning ideas and practices that shape the political economy of planning: the way that planning interventions generate distributional effects that create winners and losers across different spatial and temporal scales. Highlights ways in which planning interventions seek to order society and shape spaces, as well as the ways these efforts have been contested and resisted. Takes a global and comparative perspective, surveying planning ideas and experiences across diverse contexts. Develops analytic tools to understand the broad field of planning theory and the asymmetries of power that these imply in planning practice. Planning is a complex and multifaceted set of endeavors, and as such the class is interdisciplinary, drawing from planning theory and history as well as sociology, political science, geography, history, and the design disciplines."
        ],
        [
            "inst",
            [
                "J. Jackson"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.413 The Economic Approach to Cities and Environmental Sustainability"
        ],
        [
            "prerec",
            "Subject meets with 11.113"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=11.220\" title=\"11.220\" class=\"bubblelink code\" onclick=\"return showCourse(this, '11.220');\">11.220</a>, <a href=\"/search/?P=14.300\" title=\"14.300\" class=\"bubblelink code\" onclick=\"return showCourse(this, '14.300');\">14.300</a>, or permission of instructor "
            ]
        ],
        [
            "desc",
            "Provides a systematic framework of the interplay (both tension and synergy) between urbanization and environmental sustainability from a global perspective. Enhances analytical reasoning and quantitative skills to assist evidence-based empirical study and policy design evaluation. Explores the causes and consequences of urban environmental quality dynamics, and provides econometric tools to quantify such relationships. Examines state-of-the-art research in this field by introducing empirical studies from both developing and developed countries (highlighting fast urbanization). Themes include urban production, households, transportation and form, as well as political economy and climate resilience. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "S. Zheng"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.422[J] Law, Technology, and Public Policy"
        ],
        [
            "prerec",
            "Same subject as 15.655[J], IDS.435[J]\nSubject meets with 11.122[J], IDS.066[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject IDS.435[J]."
        ],
        [
            "inst",
            [
                "N. Ashford",
                "C. Caldart"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.427[J] Labor Markets and Employment Policy"
        ],
        [
            "prerec",
            "Same subject as 15.677[J]"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "See description under subject 15.677[J]. Preference to graduate and PhD students."
        ],
        [
            "inst",
            [
                "A. Stansbury"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.429[J] Real Estate Markets: Macroeconomics"
        ],
        [
            "prerec",
            "Same subject as 15.022[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=11.431\" title=\"11.431[J]\" class=\"bubblelink code\" onclick=\"return showCourse(this, '11.431');\">11.431[J]</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Applies the latest economic thinking and research to the task of analyzing aggregate real estate market time series, assessing risk, and developing forecasts. Presents the premise that because of capital durability and construction lags, real estate markets exhibit some degree of mean reversion and as such are at least partially predictable. Examines the extent and causes of market volatility across different markets and types of property. Long-term aggregate trends impacting the real estate sector, from demographics to technology, discussed. Limited to 30."
        ],
        [
            "inst",
            [
                "W. Wheaton"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.430[J] Leadership in Real Estate"
        ],
        [
            "prerec",
            "Same subject as 15.941[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Designed to help students deepen their understanding of leadership and increase self-awareness. They reflect on their authentic leadership styles and create goals and a learning plan to develop their capabilities. They also participate in activities to strengthen their \"leadership presence\" - the ability to authentically connect with people's hearts and minds. Students converse with classmates and industry leaders to learn from their insights, experiences, and advice. Limited to 15."
        ],
        [
            "inst",
            [
                "G. Schuck"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.431[J] Real Estate Finance and Investment"
        ],
        [
            "prerec",
            "Same subject as 15.426[J]"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Concepts and techniques for analyzing financial decisions in commercial property development and investment. Topics include property income streams, discounted cash flow, equity valuation, leverage and income tax considerations, development projects, and joint ventures. An introduction to real estate capital markets as a source of financing is also provided. Limited to graduate students."
        ],
        [
            "inst",
            [
                "W. Torous"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.433[J] Real Estate Economics"
        ],
        [
            "prerec",
            "Same subject as 15.021[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=14.01\" title=\"14.01\" class=\"bubblelink code\" onclick=\"return showCourse(this, '14.01');\">14.01</a>, <a href=\"/search/?P=15.010\" title=\"15.010\" class=\"bubblelink code\" onclick=\"return showCourse(this, '15.010');\">15.010</a>, or <a href=\"/search/?P=15.011\" title=\"15.011\" class=\"bubblelink code\" onclick=\"return showCourse(this, '15.011');\">15.011</a> "
            ]
        ],
        [
            "desc",
            "Develops an understanding of the fundamental economic factors that shape the market for real property, as well as the influence of capital markets in asset pricing. Analyzes of housing as well as commercial real estate. Covers demographic analysis, regional growth, construction cycles, urban land markets, and location theory as well as recent technology impacts. Exercises and modeling techniques for measuring and predicting property demand, supply, vacancy, rents, and prices."
        ],
        [
            "inst",
            [
                "A. Saiz"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.435 Mixed-Income Housing Development"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Spring; first half of term)"
            ]
        ],
        [
            "desc",
            "Provides an overview of affordable and mixed-income housing development for students who wish to understand the fundamental issues and requirements of urban scale housing development, and the process of planning, financing and developing such housing. Students gain practical experience assembling a mixed-income housing development proposal."
        ],
        [
            "inst",
            [
                "L. Reid",
                "W. Monson"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.437 Financing Economic Development and Housing"
        ],
        [
            "prerec",
            "Subject meets with 11.137"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Studies financing tools and program models to support and promote local economic development and housing. Overview of public and private capital markets and financing sources helps illustrate market imperfections that constrain economic and housing development and increase race and class disparaties. Explores federal housing and economic development programs as well as state and local public finance tools. Covers policies and program models. Investigates public finance practice to better understand how these finance programs affect other municipal operations. Students taking graduate version complete additional assignments. Limited to 25."
        ],
        [
            "inst",
            [
                "J. Levine"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.438 Economic Development Planning"
        ],
        [
            "prerec",
            "Prereq: 11.203, 11.220, and permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Spring)"
            ]
        ],
        [
            "desc",
            "Focuses on the policy tools and planning techniques used to formulate and implement local economic development strategies. Includes an overview of economic development theory, discussion of major policy areas and practices employed to influence local economic development, a review of analytic tools to assess local economies and how to formulate strategy. Coursework includes formulation of a local economic development strategy for a client. Limited to 15."
        ],
        [
            "inst",
            [
                "K. Seidman"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.439 Revitalizing Urban Main Streets"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Fall)"
            ]
        ],
        [
            "desc",
            "Workshop explores the integration of economic development and physical planning interventions to revitalize urban commercial districts. Covers: an overview of the causes of urban business district decline, revitalization challenges, and the strategies to address them; the planning tools used to understand and assess urban Main Streets from both physical design and economic development perspectives; and the policies, interventions, and investments used to foster urban commercial revitalization. Students apply the theories, tools and interventions discussed in class to preparing a formal neighborhood commercial revitalization plan for a client business district. Limited to 15."
        ],
        [
            "inst",
            [
                "J. Levine "
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.440 Housing and Social Stratification in the United States"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Spring)"
            ]
        ],
        [
            "desc",
            "Investigates how housing — markets, policies, and individual and collective actions — stratifies society. Students develop structural frameworks to understand the processes of stratification. Grounding work and research in history, students identify the ways that housing markets and housing market interventions reflect, reinforce, and (occasionally) combat social inequities. Through extensive writing and rewriting, students frame their work in terms of overlapping crises, including gentrification, flight, shortage, and homelessness."
        ],
        [
            "inst",
            [
                "D. M. Bunten"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.441 Planning, Economic Development, and Municipal Public Finance"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Spring)"
            ]
        ],
        [
            "desc",
            "Explores the relationship between municipal planning initiatives and local public finance. Introduces a variety of tools, including annual fiscal year budgeting, development of capital improvement plans, user fees, and local property taxation. Municipal powers to levy taxes on items such as meals, hotel rooms, and sales and their effects on land use decisions are analyzed. Tools for economic development, such as tax increment finance, explored in the context of the potential benefits and drawbacks of such tools for a local economy. Also explores how planners can encourage more inclusive budgeting decisions through tools such as participatory budgeting. Students complete a final project on a municipal finance tool and its relationship to local planning goals."
        ],
        [
            "inst",
            [
                "J. Levine "
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.442 Geography of the Global Economy"
        ],
        [
            "prerec",
            "Subject meets with 11.142"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Analyzes implications of economic globalization for communities, regions, international businesses and economic development organizations. Uses spatial analysis techniques to model the role of energy resources in shaping international political economy. Investigates key drivers of human, physical, and social capital flows and their roles in modern human settlement systems. Surveys contemporary models of industrialization and places them in geographic context. Connects forces of change with their implications for the distribution of wealth and human well-being. Looks backward to understand pre-Covid conditions and then returns to the present to understand how a global pandemic changes the world. Class relies on current literature and explorations of sectors. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "A. Glasmeier"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.449 Decarbonizing Urban Mobility"
        ],
        [
            "prerec",
            "Subject meets with 11.149"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Focuses on measuring and reducing emissions from passenger transportation. After examining travel, energy, and climate conditions, students review existing approaches to transport decarbonization. Evaluates new mobility technologies through their potential to contribute to (or delay) a zero emission mobility system. Students consider the policy tools required to achieve approaches to achieve change. Frames past and future emission reductions using an approach based on the Kaya Identity, decomposing past (and potential future) emissions into their component pieces. Seeks to enable students to be intelligent evaluators of approaches to transportation decarbonization and equip them with the tools to develop and evaluate policy measures relevant to their local professional challenges. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "J. Zhao",
                "A. Salzberg"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.450 Real Estate Development Building Systems"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Fall; first half of term)"
            ]
        ],
        [
            "desc",
            "Provides students with a concise overview of the range of building systems that are encountered in professional commercial real estate development practice in the USA. Focuses on the relationship between real estate product types, building systems, and the factors that real estate development professionals must consider when evaluating these products and systems for a specific development project. Surveys commercial building technology including Foundation, Structural, MEP/FP, Envelope, and Interiors systems and analyzes the factors that lead development professionals to select specific systems for specific product types. One or more field trips to active construction sites may be scheduled during non-class hours based on student availability."
        ],
        [
            "inst",
            [
                "Y. Tsipis"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.452 Planning against Evictions and Displacement"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: G (Spring)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Combines state-of-the-art research on evictions and displacement globally (in the context of the global crisis of evictions, land grabbing, and gentrification) with the study of policy and practical responses to displacement, assisted by selected case studies. First half covers explanations about the mechanisms and drivers of displacement, while the second half introduces and evaluates policy and legal responses developed by many actors. Analyzes the use of UN and national standards on displacement as well as the use of tools such as the Eviction Impact Assessment Tool. Limited to 15 graduate students."
        ],
        [
            "inst",
            [
                "B. Rajagopal"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.454 Big Data, Visualization, and Society"
        ],
        [
            "prerec",
            "Subject meets with 11.154"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Data visualizations communicate the insights found in data to non-technical audiences. Students develop technical skills to work with big data to expose societal issues and communicate the insights. Focuses on different topics each year. After framing that topic, the first half of the subject focuses on learning to analyze the data with Python. The second half of the subject focuses on learning web-based data visualization tools (JavaScript and D3). Students learn data storytelling concepts and produce web-based data visualizations for their final projects. Throughout, students learn ethical data practices. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "S. Williams"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.C85[J] Interactive Data Visualization and Society"
        ],
        [
            "prerec",
            "Same subject as 6.C85[J]\nSubject meets with 6.C35[J], 11.C35[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 6.C85[J]."
        ],
        [
            "inst",
            [
                "C. D'Ignazio",
                "A. Satyanarayan",
                "S. Williams"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.457 More than Data: Smart Cities, Big Data, Civic Technology and Policy"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Discussions of future directions in the 'smart cities' debate. Begins by framing the current smart city with past trends such as the efficient city movement of the 1930s and the Modernist city of the 1950s and 60s. Examines current trends in big data, civic apps, Code for America, the open data movement, DIY data collections devices, and their policy impacts."
        ],
        [
            "inst",
            [
                "S. Williams"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.458 Crowd Sourced City: Civic Tech Prototyping"
        ],
        [
            "prerec",
            "Subject meets with 11.138"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Investigates the use of social medial and digital technologies for planning and advocacy by working with actual planning and advocacy organizations to develop, implement, and evaluate prototype digital tools. Students use the development of their digital tools as a way to investigate new media technologies that can be used for planning. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "S. Williams",
                "C. D'Ignazio"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.461[J] Technocracy"
        ],
        [
            "prerec",
            "Same subject as STS.463[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject STS.463[J]."
        ],
        [
            "inst",
            [
                "J. S. Light"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.466[J] Technology, Globalization, and Sustainable Development"
        ],
        [
            "prerec",
            "Same subject as 1.813[J], 15.657[J], IDS.437[J]"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "See description under subject IDS.437[J]."
        ],
        [
            "inst",
            [
                "N. Ashford"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.469 Urban Sociology in Theory and Practice"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Spring)"
            ]
        ],
        [
            "desc",
            "Introduction to core writings in urban sociology. Explores the nature and changing character of the city and the urban experience, providing context for the development of urban studies research and planning skills. Topics include the changing nature of community, neighborhood effects, social capital and networks, social stratification, feminist theory and critical race theory, and the interaction of social structure and political power. Subject will take place in the Massachusetts Correctional Institution at Norfolk with half of the class from MIT and half of the class from MCI-Norfolk. Limited to 25."
        ],
        [
            "inst",
            [
                "J. Steil"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.472[J] D-Lab: Development"
        ],
        [
            "prerec",
            "Same subject as EC.781[J]\nSubject meets with 11.025[J], EC.701[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject EC.781[J]. Enrollment limited by lottery; must attend first class session."
        ],
        [
            "inst",
            [
                "S. L. Hsu",
                "A. B. Smith",
                "B. Sanyal"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.474 D-Lab: Water, Sanitation and Hygiene"
        ],
        [
            "prerec",
            "Subject meets with EC.715"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Focuses on disseminating Water, Sanitation, and Hygiene (WASH) innovations in low-income countries and underserved communities worldwide. Structured around project-based learning, lectures, discussions, and student-led tutorials. Emphasizes core WASH principles, appropriate and sustainable technologies at household and community scales, urban challenges worldwide, culture-specific solutions, lessons from start-ups, collaborative partnerships, and social marketing. Mentored term project entails finding and implementing a viable solution focused on education/training; a technology, policy or plan; a marketing approach; and/or behavior change. Guest lecturers present case studies, emphasizing those developed and disseminated by MIT faculty, practitioners, students, and alumni. Field trips scheduled during class time, with optional field trips on weekends. Students taking graduate version complete additional assignments. Limited to 20."
        ],
        [
            "inst",
            [
                "S. E. Murcott",
                "S. L. Hsu"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.477[J] Urban Energy Systems and Policy"
        ],
        [
            "prerec",
            "Same subject as 1.286[J]\nSubject meets with 11.165"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=11.203\" title=\"11.203\" class=\"bubblelink code\" onclick=\"return showCourse(this, '11.203');\">11.203</a>, <a href=\"/search/?P=14.01\" title=\"14.01\" class=\"bubblelink code\" onclick=\"return showCourse(this, '14.01');\">14.01</a>, or permission of instructor "
            ]
        ],
        [
            "desc",
            "Examines efforts in developing and advanced nations and regions. Examines key issues in the current and future development of urban energy systems, such as technology, use, behavior, regulation, climate change, and lack of access or energy poverty. Case studies on a diverse sampling of cities explore how prospective technologies and policies can be implemented. Includes intensive group research projects, discussion, and debate."
        ],
        [
            "inst",
            [
                "D. Hsu"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.478 Behavioral Science, AI, and Urban Mobility"
        ],
        [
            "prerec",
            "Subject meets with 11.158"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Integrates behavioral science, artificial intelligence, and transportation technology to shape travel behavior, design mobility systems and business, and reform transportation policies. Introduces methods to sense travel behavior with new technology and measurements; nudge behavior through perception and preference shaping; design mobility systems and ventures that integrate autonomous vehicles, shared mobility, and public transit; and regulate travel with behavior-sensitive transport policies. Challenges students to pilot behavioral experiments and design creative mobility systems, business and policies. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "J. Zhao"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.480 Urbanization and Development"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Examines developmental dynamics of rapidly urbanizing locales, with a special focus on the developing world. Case studies from India, China, Mexico, Brazil, and South Africa form the basis for discussion of social, spatial, political and economic changes in cities spurred by the decline of industry, the rise of services, and the proliferation of urban mega projects. Emphasizes the challenges of growing urban inequality, environmental risk, citizen displacement, insufficient housing, and the lack of effective institutions for metropolitan governance. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.484 Project Appraisal in Developing Countries"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Covers techniques of financial analysis of investment expenditures, as well as the economic and distributive appraisal of development projects. Critical analysis of these tools in the political economy of international development is discussed. Topics include appraisal's role in the project cycle, planning under conditions of uncertainty, constraints in data quality and the limits of rational analysis, and the coordination of an interdisciplinary appraisal team. Students taking graduate version complete additional assignments. Enrollment limited; preference to majors."
        ],
        [
            "inst",
            [
                "Y. Hong"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.485 Southern Urbanisms"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: G (Fall)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Guides students in examining implicit and explicit values of diversity offered in \"Southern\" knowledge bases, theories, and practices of urban production. With a focus on Sub-Saharan Africa, considers why the South-centered location of the estimated global urban population boom obligates us to examine how cities work as they do, and why Western-informed urban theory and planning scholarship may be ill-suited to provide guidance on urban development there. Examines the \"rise of the rest\" and its implications for the making and remaking of expertise and norms in planning practice. Students engage with seminal texts from leading authors of Southern urbanism and critical themes, including the rise of Southern theory, African urbanism, Chinese international cooperation, Brazilian urban diplomacy, and the globally-driven commodification of urban real estate."
        ],
        [
            "inst",
            [
                "G. Carolini "
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.486 Peace and Conflict Geographies"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Spring)"
            ]
        ],
        [
            "desc",
            "Explores the spatialization of conflict and peace from perspectives within the humanities and social sciences. Examines claims on territory, resources, and homeland; traces the legacies of violence in landscapes both personal and public; considers the use of planning and architecture to build peace; and attends to experiences of displacement and dispossession. Discusses how conflict and peace geographies provide insight into various scales of power and repair that shape how individuals live together."
        ],
        [
            "inst",
            [
                "D. Wendel"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.487 Budgeting and Finance for the Public Sector"
        ],
        [
            "prerec",
            "Subject meets with 11.147"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines globally relevant challenges of adequately and effectively attending to public sector responsibilities for basic services with limited resources. Particular attention to the contexts of fiscal crises and rapid population growth, as well as shrinkage, through an introduction to methods and processes of budgeting, accounting, and financial mobilization. Case studies and practice exercises explore revenue strategies, demonstrate fiscal analytical competencies, and familiarize students with pioneering examples of promising budget and accounting processes and innovative funding mobilization via taxation, capital markets, and other mechanisms (e.g., land-value capture). Students taking graduate version explore the subject in greater depth."
        ],
        [
            "inst",
            [
                "G. Carolini"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.490 Law and Development"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Examines the role of law in development and introduces economic and legal theories. Topics include formality/informality of property, contracts and bargaining in the shadow of the law, institutions for transparency and accountability, legitimation of law, sequencing of legal reform, and international economic law aspects. Studies the roles of property rights in economic development, the judiciary and the bureaucracy in development, and law in aid policy. Includes selected country case studies. Limited to 15."
        ],
        [
            "inst",
            [
                "B. Rajagopal"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.493 Property and Land Use Law for Planners"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Fall)"
            ]
        ],
        [
            "desc",
            "Examines legal and institutional arrangements for the establishment, transfer, and control over property and land under American and selected comparative systems, including India and South Africa. Focuses on key issues of property and land use law regarding planning and economic development. Emphasizes just and efficient resource use; institutional, entitlement and social relational approaches to property; distributional and other social aspects; and the relationship between property, culture, and democracy."
        ],
        [
            "inst",
            [
                "B. Rajagopal"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.494 Cities of Contested Memory"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Spring)"
            ]
        ],
        [
            "desc",
            "Explores relationships between built environments and memory to consider the spaces and spatial practices in which the future of the past is imagined, negotiated, and contested. Focuses on three areas of critical importance to understanding the nature of memory in cities today: the threats that rapid urban development pose to the remembrance of urban pasts; the politics of representation evident in debates over authorized and marginalized historical narratives; and the art and ethics of sensitively addressing the afterlives of violence and tragedy. Emphasizes group discussions and projects as means to explore collective and counter memories, the communities that are formed therein, and the economic, social, and political forces that lift up certain memories over others to shape the legacy of the past. Limited to 15."
        ],
        [
            "inst",
            [
                "D. Wendel"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.495 Governance and Law in Developing Countries"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Examines the multiple dimensions of governance in international development with a focus on the role of legal norms and institutions in the balance between state and the market. Analyzes changes in the distribution of political and legal authority as a result of economic globalization. Topics include the regulation of firms; forms of state and non-state monitoring; varieties of capitalism, global governance and development; and good governance, including transparency and accountability mechanisms, the role of the judiciary and legal culture, and tools for measuring governance performance."
        ],
        [
            "inst",
            [
                "B. Rajagopal"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.496 Law, Social Movements, and Public Policy: Comparative and International Experience"
        ],
        [
            "prerec",
            "Subject meets with 11.166"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Studies the interaction between law, courts, and social movements in shaping domestic and global public policy. Examines how groups mobilize to use law to affect change and why they succeed and fail. Case studies explore the interplay between law, social movements, and public policy in current issues, such as gender, race, labor, trade, climate change/environment, and LGBTQ rights. Introduces theories of public policy, social movements, law and society, and transnational studies. Students taking graduate version complete additional assignments. Limited to 15."
        ],
        [
            "inst",
            [
                "B. Rajagopal"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.497 Human Rights at Home and Abroad"
        ],
        [
            "prerec",
            "Subject meets with 11.164[J], 17.391[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Provides a rigorous and critical introduction to the history, foundation, structure, and operation of the human rights movement. Focuses on key ideas, actors, methods and sources, and critically evaluates the field. Addresses current debates in human rights, including the relationship with security, democracy, development and globalization, urbanization, equality (in housing and other economic and social rights; women's rights; ethnic, religious and racial discrimination; and policing/conflict), post-conflict rebuilding and transitional justice, and technology in human rights activism. Students taking graduate version expected to write a research paper."
        ],
        [
            "inst",
            [
                "B. Rajagopal"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.499 Master of Science in Real Estate Development Thesis Preparation"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Spring; first half of term)"
            ]
        ],
        [
            "desc",
            "Designed to give students the tools and information needed to successfully complete a master's level thesis. Seminar topics include, but are not limited to: research data sets, different types and styles of theses, the writing and editing process, library services, and the use of humans as experimental subjects in research. CRE faculty share their areas of interest to assist in choosing an advisor. Seminar assignments guide students toward developing a thesis topic and realistic work plan to adequately achieve their research and writing goals. Objective is for each student to have sufficient knowledge to author a fully developed thesis topic and formal proposal by the end of the term. Limited to MS in Real Estate Development candidates."
        ],
        [
            "inst",
            [
                "A. Saiz"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.520 Workshop on Geographic Information Systems (GIS)"
        ],
        [
            "prerec",
            "Prereq: 11.205 or permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall, Spring; second half of term)"
            ]
        ],
        [
            "desc",
            "Includes spatial analysis exercises using real-world data sets, building toward an independent project in which students critically apply GIS techniques to an area of interest. Students build data discovery, cartography, and spatial analysis skills while learning to reflect on power and positionality within the research design process. Tailored to GIS applications within planning and design and emphasizes the role of reflective practice in GIS. Enrollment limited; preference to MCP students."
        ],
        [
            "inst",
            [
                "S. Williams",
                "C. D'Ignazio",
                "E. Huntley"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.521 Spatial Database Management and Advanced Geographic Information Systems"
        ],
        [
            "prerec",
            "Prereq: 11.205 and Coreq: 11.220; or permission of instructor"
        ],
        [
            "terms",
            [
                "G (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Extends the computing and geographic information systems (GIS) skills developed in 11.520 to include spatial data management in client/server environments and advanced GIS techniques. First half covers the content of 11.523, introducing database management concepts, SQL (Structured Query Language), and enterprise-class database management software. Second half explores advanced features and the customization features of GIS software that perform analyses for decision support that go beyond basic thematic mapping. Includes the half-term GIS project of 11.524 that studies a real-world planning issue."
        ],
        [
            "inst",
            [
                "J. Ferreira"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.522 Research Seminar on Urban Information Systems"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Advanced research seminar enhances computer and analytic skills developed in other subjects in this sequence. Students present a structured discussion of journal articles representative of their current research interests involving urban information systems and complete a short research project. Suggested research projects include topics related to ongoing UIS Group research."
        ],
        [
            "inst",
            [
                "J. Ferreira"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.523 Fundamentals of Spatial Database Management"
        ],
        [
            "prerec",
            "Prereq: 11.205 or permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall; first half of term)"
            ]
        ],
        [
            "desc",
            "Develops technical skills necessary to design, build, and interact with spatial databases using the Structured Query Language (SQL) and its spatial extensions. Provides instruction in writing highly contextual metadata (data biographies). Prepares students to perform database maintenance, modeling, and digitizing tasks, and to critically evaluate and document data sources. Databases are implemented in PostgreSQL and PostGIS; students interface with these using QGIS."
        ],
        [
            "inst",
            [
                "E. Huntley "
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.524 Advanced Geographic Information System Project"
        ],
        [
            "prerec",
            "Prereq: (11.205 and 11.220) or permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall; second half of term)"
            ]
        ],
        [
            "desc",
            "Provides instruction in statistical approaches for analyzing interrelation, clustering, and interdependence, which are often key to understanding urban environments. Covers local and global spatial autocorrelation, interpolation, and kernel density methods; cluster detection; and spatial regression models. Develops technical skills necessary to ask spatial questions using inferential statistics implemented in the R statistical computing language. Prior coursework or experience in geographic information systems (GIS) at the introductory level required; prior coursework or experience in R is preferred."
        ],
        [
            "inst",
            [
                "E. Huntley"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.526[J] Comparative Land Use and Transportation Planning"
        ],
        [
            "prerec",
            "Same subject as 1.251[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Focuses on the integration of land use and transportation planning, drawing from cases in both industrialized and developing countries. Highlights how land use and transportation influence the social organization of cities, assigning privileges to certain groups and segregating or negating access to the city to other groups. Covers topics such as accessibility; the use of data, algorithms, and bias; travel demand and travel behavior; governance; transit-oriented development; autonomous vehicles; transportation and real estate; and social, environmental, and health implications of land use and transportation. Develops students' skills to assess relevant policies, interventions, and impacts."
        ],
        [
            "inst",
            [
                "F. Duarte"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.529[J] Mobility Ventures: Driving Innovation in Transportation Systems"
        ],
        [
            "prerec",
            "Same subject as 15.379[J]\nSubject meets with 11.029[J], 15.3791[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Explores technological, behavioral, policy, and systems-wide frameworks for innovation in transportation systems, complemented with case studies across the mobility spectrum, from autonomous vehicles to urban air mobility to last-mile sidewalk robots. Students interact with a series of guest lecturers from CEOs and other business and government executives who are actively reshaping the future of mobility. Interdisciplinary teams of students collaborate to deliver business plans for proposed mobility-focused startups with an emphasis on primary market research. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "J. Zhao",
                "J. Moavenzadeh",
                "J. Larios Berlin"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.540 Urban Transportation Planning and Policy"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Fall)"
            ]
        ],
        [
            "desc",
            "Examines transportation policymaking and planning; its relationship to social and environmental justice; and the influences of politics, governance structures, and human and institutional behavior. Explores the pathway to infrastructure, how attitudes are influenced, and how change happens. Examines the tensions and potential synergies among traditional transportation policy values of individual mobility, system efficiency, and \"sustainability.\" Explores the roles of the government; analysis of current trends; transport sector decarbonization; land use, placemaking, and sustainable mobility networks; the role of \"mobility as a service;\" and the implications of disruptive technology on personal mobility. Assesses traditional planning methods with a critical eye, and through that process considers how to approach transportation planning in a way that responds to contemporary needs and values, with an emphasis on transport justice."
        ],
        [
            "inst",
            [
                "J. Aloisi"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.543[J] Transportation Policy, the Environment, and Livable Communities"
        ],
        [
            "prerec",
            "Same subject as 1.253[J]"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Examines the economic and political conflict between transportation and the environment. Investigates the role of government regulation, green business and transportation policy as a facilitator of economic development and environmental sustainability. Analyzes a variety of international policy problems, including government-business relations, the role of interest groups, non-governmental organizations, and the public and media in the regulation of the automobile; sustainable development; global warming; politics of risk and siting of transport facilities; environmental justice; equity; as well as transportation and public health in the urban metropolis. Provides students with an opportunity to apply transportation and planning methods to develop policy alternatives in the context of environmental politics. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "J. Coughlin"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.544[J] Transportation: Foundations and Methods"
        ],
        [
            "prerec",
            "Same subject as 1.200[J], IDS.675[J]\nSubject meets with 1.041[J], IDS.075[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=1.000\" title=\"1.000\" class=\"bubblelink code\" onclick=\"return showCourse(this, '1.000');\">1.000</a>, (<a href=\"/search/?P=1.00\" title=\"1.00\" class=\"bubblelink code\" onclick=\"return showCourse(this, '1.00');\">1.00</a> and <a href=\"/search/?P=1.010\" title=\"1.010\" class=\"bubblelink code\" onclick=\"return showCourse(this, '1.010');\">1.010</a>), or permission of instructor "
            ]
        ],
        [
            "desc",
            "See description under subject 1.200[J]."
        ],
        [
            "inst",
            [
                "C. Wu"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.547[J] Global Aging & the Built Environment"
        ],
        [
            "prerec",
            "Same subject as SCM.287[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Combines classroom lectures/discussion, readings, site visits, and field study to provide students with experience in various research techniques including stakeholder analysis, interviewing, photography and image analysis, focus groups, etc. Students examine the impacts of global demographic transition, when there are more older than younger people in a population, and explore emerging challenges in the built environment (e.g., age-friendly community planning, public transportation access, acceptance of driverless cars, social wellbeing and connectivity, housing and community design, design and use of public and private spaces, and the public health implications of climate change and aging)."
        ],
        [
            "inst",
            [
                "J. F. Coughlin"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.592 Renewable Energy Facility Siting Clinic (New)"
        ],
        [
            "prerec",
            "Subject meets with 11.092"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Presents methods for resolving facility siting disputes, particularly those involving renewable energy. After completing four modules and a competency exam for MITx certification, students work in teams to help client communities in various cities around the United States. Through direct interactions with the proponents and opponents of facilities subject to local opposition, students complete a stakeholder assessment and offer joint fact-finding and collaborative problem-solving assistance. The political, legal, financial, and regulatory aspects of facility siting, particularly for renewable energy, are reviewed along with key infrastructure planning principles. Students taking the graduate version complete additional assignments. Limited to 15."
        ],
        [
            "inst",
            [
                "L. Susskind"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.601 Theory and Practice of Environmental Planning"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Fall)"
            ]
        ],
        [
            "desc",
            "Required introductory subject for graduate students pursuing the Environmental Planning Certificate. Strongly suggested for MCP students pursuing EPP as their specialization. Also open to other graduate students interested in environmental justice, environmental ethics, environmental dispute resolution, and techniques of environmental problem-solving. Taught comparatively, with numerous references to examples from around the world. Four major areas of focus: national environmental policymaking, environmental ethics, environmental forecasting and analysis techniques, and strategies for collaborative decision-making. "
        ],
        [
            "inst",
            [
                "L. Susskind"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.630[J] Environmental Law, Policy, and Economics: Pollution Prevention and Control"
        ],
        [
            "prerec",
            "Same subject as 1.811[J], 15.663[J], IDS.540[J]\nSubject meets with 1.801[J], 11.021[J], 17.393[J], IDS.060[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Analyzes federal and state regulation of air and water pollution, hazardous waste, greenhouse gas emissions, and production/use of toxic chemicals. Analyzes pollution/climate change as economic problems and failure of markets. Explores the role of science and economics in legal decisions. Emphasizes use of legal mechanisms and alternative approaches (i.e., economic incentives, voluntary approaches) to control pollution and encourage chemical accident and pollution prevention. Focuses on major federal legislation, underlying administrative system, and common law in analyzing environmental policy, economic consequences, and role of the courts. Discusses classical pollutants and toxic industrial chemicals, greenhouse gas emissions, community right-to-know, and environmental justice. Develops basic legal skills: how to read/understand cases, regulations, and statutes. Students taking graduate version explore the subject in greater depth."
        ],
        [
            "inst",
            [
                "N. Ashford",
                "C. Caldart"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.631[J] Regulation of Chemicals, Radiation, and Biotechnology"
        ],
        [
            "prerec",
            "Same subject as 1.812[J], IDS.541[J]\nSubject meets with 1.802[J], 10.805[J], 11.022[J], IDS.061[J], IDS.436[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=IDS.540\" title=\"IDS.540[J]\" class=\"bubblelink code\" onclick=\"return showCourse(this, 'IDS.540');\">IDS.540[J]</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Focuses on policy design and evaluation in the regulation of hazardous substances and processes. Includes risk assessment, industrial chemicals, pesticides, food contaminants, pharmaceuticals, radiation and radioactive wastes, product safety, workplace hazards, indoor air pollution, biotechnology, victims' compensation, and administrative law. Health and economic consequences of regulation, as well as its potential to spur technological change, are discussed for each regulator regime. Students taking the graduate version are expected to explore the subject in greater depth."
        ],
        [
            "inst",
            [
                "N. Ashford",
                "C.Caldart"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.651[J] USA Lab: Bridging the American Divides"
        ],
        [
            "prerec",
            "Same subject as 15.679[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 15.679[J]."
        ],
        [
            "inst",
            [
                "L. Hafrey",
                "C. McDowell"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.652[J] Research Seminar on Technology and the Work of the Future"
        ],
        [
            "prerec",
            "Same subject as STS.465[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject STS.465[J]. Limited to 15."
        ],
        [
            "inst",
            [
                "D. Mindell",
                "E. B. Reynolds"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.701 International Development Planning: Foundations"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Fall)"
            ]
        ],
        [
            "desc",
            "Offers a survey of the histories and theories of international development, and the main debates about the role of key actors and institutions in development. Includes a focus on the impact of colonialism, the main theoretical approaches that have influenced the study and practice of development, as well as the role of actors such as states, markets, and civil society in development. Focuses on the interactions between interventions and institutions on local, national, and global/transnational scales. Offers an opportunity to develop a focus on selected current topics in development planning, such as migration, displacement, participatory planning, urban-rural linkages, corruption, legal institutions, and post-conflict development. Restricted to first-year MCP and SPURS students."
        ],
        [
            "inst",
            [
                "B. Rajagopal"
            ]
        ]
    ],
    [
        "head",
        "Tutorials, Research, and Fieldwork Subjects"
    ],
    [
        "block",
        [
            "title",
            "11.800 Reading, Writing and Research"
        ],
        [
            "prerec",
            "Prereq: 11.233; Coreq: 11.801"
        ],
        [
            "terms",
            [
                "G (Spring)"
            ]
        ],
        [
            "desc",
            "Required subject intended solely for 1st-year DUSP PhD students. Develops capacity of doctoral students to become independent scholars by helping them to prepare their first-year papers and plan for their dissertation work. Focuses on the process by which theory, research questions, literature reviews, and new data are synthesized into new and original contributions to the literature. Seminar is conducted with intensive discussions, draft writing, peer review, revisions, and editing. Guest speakers from faculty and advanced students discuss strategies and potential pitfalls with doctoral-level research."
        ],
        [
            "inst",
            [
                "M. Arcaya"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.801 Doctoral Research Paper"
        ],
        [
            "prerec",
            "Prereq: None. Coreq: 11.800; permission of instructor"
        ],
        [
            "terms",
            [
                "G (Spring)"
            ]
        ],
        [
            "desc",
            "Students develop a first-year research paper in consultation with their advisor."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.901 Independent Study: Urban Studies and Planning"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall, IAP, Spring)"
            ]
        ],
        [
            "desc",
            "Opportunity for independent study under regular supervision by a faculty member."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.902 Independent Study: Urban Studies and Planning"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall, IAP, Spring)"
            ]
        ],
        [
            "desc",
            "Opportunity for independent study under regular supervision by a faculty member."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.903 Supervised Readings in Urban Studies"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall, IAP, Spring)"
            ]
        ],
        [
            "desc",
            "Reading and discussion of topics in urban studies and planning."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.904 Supervised Readings in Urban Studies"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Reading and discussion of topics in urban studies and planning."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.905 Research Seminar in Urban Studies and Planning"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall, IAP, Spring)"
            ]
        ],
        [
            "desc",
            "Special research issues in urban planning."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.906 Research Seminar in Urban Studies and Planning"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Fall, IAP, Spring)"
            ]
        ],
        [
            "desc",
            "Special research issues in urban planning."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.907 Urban Fieldwork"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall, IAP, Spring)"
            ]
        ],
        [
            "desc",
            "Practical application of planning techniques to towns, cities, and regions, including problems of replanning, redevelopment, and renewal of existing communities. Includes internships, under staff supervision, in municipal and state agencies and departments."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.908 Urban Fieldwork"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Fall, IAP, Spring)"
            ]
        ],
        [
            "desc",
            "Practical application of planning techniques to towns, cities, and regions, including problems of replanning, redevelopment, and renewal of existing communities. Includes internships, under staff supervision, in municipal and state agencies and departments."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.909 Graduate Tutorial"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Fall)"
            ]
        ],
        [
            "desc",
            "Planned programs of instruction for a minimum of three students on a planning topic not covered in regular subjects of instruction. Registration subject to prior arrangement with appropriate faculty member."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.910 Doctoral Tutorial"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Fall)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Required subject exclusively for first-year DUSP PhD candidates, but with multiple colloquium sessions open to the full department community. Introduces students to a range of department faculty (and others) by offering opportunities to discuss applications of planning theory and planning history. Assists in clarifying the departments intellectual diversity. Encourages development of a personal intellectual voice and capacity to synthesize and respond to the arguments made by others."
        ],
        [
            "inst",
            [
                "L. Vale",
                "J. Zhao"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.912[J] Advanced Urbanism Colloquium"
        ],
        [
            "prerec",
            "Same subject as 4.275[J]"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "See description under subject 4.275[J]. Preference to doctoral students in the Advanced Urbanism concentration."
        ],
        [
            "inst",
            [
                "Consult S. Williams"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.919 PhD Workshop (New)"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "The workshop features doctoral student progress on dissertation formulation and findings across all years, panels of particular interest to doctoral students as identified by their representatives on the PhD Committee, and an intellectual space for the sharing of ideas and initiatives within the doctoral community and across the department, including faculty.  Limited to all doctoral students in residence."
        ],
        [
            "inst",
            [
                "G. Carolini"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.920 Planning in Practice"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Familiarizes students with the practice of planning, by requiring actual experience in professional internship placements. Enables students to both apply what they are learning in their classes in an actual professional setting and to reflect, using a variety of platforms, on the learning -- personal and professional -- growing out of their internship experience. Through readings, practical experience and reflection, empirical observation, and contact with practitioners, students gain deeper general understanding of the practice of the profession."
        ],
        [
            "inst",
            [
                "M. J. Daly"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.930 Advanced Seminar on Planning Theory"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Spring)"
            ]
        ],
        [
            "desc",
            "Introduces students to key debates in the field of planning theory, drawing on historical development of the field of urban/regional/national planning from 1900 to 2020 in both the US and in newly industrializing countries. Class objectives are for students to develop their own theory of action as they become sensitized to issues of racial and gender discrimination in city building, and understand how planning styles are influenced by a range of issues, including the challenge of ethical practice."
        ],
        [
            "inst",
            [
                "B. Sanyal"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.960 Independent Study: Real Estate"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Opportunity for independent study under regular supervision by a faculty member."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.961 Independent Study: Real Estate"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Opportunity for independent study under regular supervision by a faculty member."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.962 Fieldwork: Real Estate"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Practical application of real estate techniques in the field."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.963 Independent Study: Real Estate"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Opportunity for independent study under regular supervision by a faculty member."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.964 Independent Study: Real Estate"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Opportunity for independent study under regular supervision by a faculty member."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.985 Summer Field Work"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Summer)"
            ]
        ],
        [
            "desc",
            "Practical application of planning techniques over the summer with prior arrangement."
        ],
        [
            "inst",
            [
                "S. Wellford"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.S938 Special Subject: Urban Studies and Planning"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Spring)"
            ]
        ],
        [
            "desc",
            "For graduate students wishing to pursue further study in advanced areas of urban studies and planning not covered in regular subjects of instruction."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.S939 Special Subject: Urban Studies and Planning"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Spring)"
            ]
        ],
        [
            "desc",
            "For graduate students wishing to pursue further study in advanced areas of urban studies and city and regional planning not covered in regular subjects of instruction."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.S940-11.S944 Special Subject: Urban Studies and Planning"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "For graduate students wishing to pursue further study in advanced areas of urban studies and city and regional planning not covered in regular subjects of instruction."
        ],
        [
            "inst",
            [
                "M. Kothari"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.S948 Special Subject: Urban Studies and Planning"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall)"
            ]
        ],
        [
            "desc",
            "For graduate students wishing to pursue further study in advanced areas of urban studies and city and regional planning not covered in regular subjects of instruction."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.S945-11.S949 Special Subject: Urban Studies and Planning"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall)"
            ]
        ],
        [
            "desc",
            "For graduate students wishing to pursue further study in advanced areas of urban studies and city and regional planning not covered in regular subjects of instruction."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.S950-11.S957 Special Seminar: Urban Studies and Planning"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall, IAP)"
            ]
        ],
        [
            "desc",
            "For graduate students wishing to pursue further study in advanced areas of urban studies and city and regional planning not covered in regular subjects of instruction"
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.S958 Special Seminar: Urban Studies and Planning"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall)"
            ]
        ],
        [
            "desc",
            "For graduate students wishing to pursue further study in advanced areas of urban studies and city and regional planning not covered in regular subjects of instruction."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.S959 Special Seminar: Urban Studies and Planning"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall)"
            ]
        ],
        [
            "desc",
            "For graduate students wishing to pursue further study in advanced areas of urban studies and city and regional planning not covered in regular subjects of instruction."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.S965 Special Subject: Real Estate"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall; second half of term)"
            ]
        ],
        [
            "desc",
            "Small group study of advanced subjects under staff supervision. For graduate students wishing to pursue further study in advanced areas of real estate not covered in regular subjects of instruction."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.S966 Special Subject: Real Estate"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall, IAP, Spring, Summer; second half of term)"
            ]
        ],
        [
            "desc",
            "Small group study of advanced subjects under staff supervision. For graduate students wishing to pursue further study in advanced areas of real estate not covered in regular subjects of instruction."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.S967 Special Subject: Real Estate"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Spring; first half of term)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Small group study of advanced subjects under staff supervision. For graduate students wishing to pursue further study in advanced areas of real estate not covered in regular subjects of instruction."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.S968 Special Seminar: Real Estate"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Small group study of advanced subjects under staff supervision. For graduate students wishing to pursue further study in advanced areas of real estate not covered in regular subjects of instruction."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.S969 Special Seminar: Real Estate"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall)"
            ]
        ],
        [
            "desc",
            "Small group study of advanced subjects under staff supervision. For graduate students wishing to pursue further study in advanced areas of real estate not covered in regular subjects of instruction."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.S970 Special Seminar: Real Estate"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Spring; second half of term)"
            ]
        ],
        [
            "desc",
            "Small group study of advanced subjects under staff supervision. For graduate students wishing to pursue further study in advanced areas of real estate not covered in regular subjects of instruction."
        ],
        [
            "inst",
            [
                "Consult Catalog Faculty"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "11.THG Graduate Thesis"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Program of research and writing of thesis; to be arranged by the student with supervising committee."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ]
]