[
    "Earth, Atmospheric, and Planetary Sciences (Course 12)",
    [
        "head",
        "Undergraduate Subjects"
    ],
    [
        "block",
        [
            "title",
            "12.00 Frontiers and Careers in Earth, Planets, Climate, and Life"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Provides a broad overview of topics, technologies, and career paths at the forefront of Earth, Atmospheric and Planetary Sciences. Introduces the complex interplay between physics, mathematics, chemistry, biology, and computational methods used to study processes associated with a changing Earth and climate, distant planets, and life. Sessions guided by faculty members discussing current research problems, and by EAPS alumni describing how their careers have evolved. Subject can count toward the 6-unit discovery-focused credit limit for first year students."
        ],
        [
            "inst",
            [
                "T. Herring"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.000 Solving Complex Problems"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Provides an opportunity for entering freshmen to gain firsthand experience in integrating the work of small teams to develop effective solutions to complex problems in Earth system science and engineering. Each year's class explores a different problem in detail through the study of complementary case histories and the development of creative solution strategies. Includes exercises in website development, written and oral communication, and team building. Subject required for students in the Terrascope freshman program, but participation in Terrascope is not required of all 12.000 students. Students who pass 12.000 are eligible to participate in the Terrascope field trip the following spring. Limited to freshmen."
        ],
        [
            "inst",
            [
                "D. McGee",
                "A. Epstein"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.001 Introduction to Geology"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Major minerals and rock types, rock-forming processes, and time scales. Temperatures, pressures, compositions, structure of the Earth, and measurement techniques. Geologic structures and relationships observable in the field. Sediment movement and landform development by moving water, wind, and ice. Crustal processes and planetary evolution in terms of global plate tectonics with an emphasis on ductile and brittle processes. Includes laboratory exercises on minerals, rocks, mapping, plate tectonics, rheology, glaciers. Two one-day field trips (optional)."
        ],
        [
            "inst",
            [
                "T. Bosak",
                "O. Jagoutz"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.002 Introduction to Geophysics and Planetary Science"
        ],
        [
            "prerec",
            "Prereq: Calculus II (GIR) and Physics II (GIR)"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Study of the structure, composition, and physical processes governing the terrestrial planets, including their formation and basic orbital properties. Topics include plate tectonics, earthquakes, seismic waves, rheology, impact cratering, gravity and magnetic fields, heat flux, thermal structure, mantle convection, deep interiors, planetary magnetism, and core dynamics. Suitable for majors and non-majors seeking general background in geophysics and planetary structure."
        ],
        [
            "inst",
            [
                "C. Cattania",
                "G. Stucky de Quay"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.003 Introduction to Atmosphere, Ocean, and Climate Dynamics"
        ],
        [
            "prerec",
            "Prereq: Calculus II (GIR) and Physics I (GIR)"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Introduces the dynamical processes that govern the atmosphere, oceans, and climate. Topics include Earth's radiation budget, convection and clouds, the circulation of the atmosphere and ocean, and climate change. Illustrates underlying mechanisms through laboratory demonstrations with a rotating table, and through analysis of atmospheric and oceanic data."
        ],
        [
            "inst",
            [
                "T. Cronin"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.004 Introduction to Biogeochemistry (New)"
        ],
        [
            "prerec",
            "Prereq: Chemistry (GIR)"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Fall)"
            ]
        ],
        [
            "desc",
            "Introduction to the central roles of chemistry and biology on Earth that underlie modern climate, climate history, and global elemental cycles. Topics include the interactions of chemistry and biology in atmospheric, aquatic, and terrestrial systems. Fundamental principles of redox, equilibria, and acid/base reactions are explored via their links in the Earth system and with respect to climate feedbacks and ecosystem dynamics, providing perspectives for the future of our planet."
        ],
        [
            "inst",
            [
                "A. R. Babbin"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.006[J] Nonlinear Dynamics: Chaos"
        ],
        [
            "prerec",
            "Same subject as 2.050[J], 18.353[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=8.02|8.021|8.022\" onclick=\"return showCourse(this, '8.02|8.021|8.022');\">Physics II (GIR)</a> and (<a href=\"/search/?P=18.03\" title=\"18.03\" class=\"bubblelink code\" onclick=\"return showCourse(this, '18.03');\">18.03</a> or <a href=\"/search/?P=18.032\" title=\"18.032\" class=\"bubblelink code\" onclick=\"return showCourse(this, '18.032');\">18.032</a>) "
            ]
        ],
        [
            "desc",
            "Introduction to nonlinear dynamics and chaos in dissipative systems. Forced and parametric oscillators. Phase space. Periodic, quasiperiodic, and aperiodic flows. Sensitivity to initial conditions and strange attractors. Lorenz attractor. Period doubling, intermittency, and quasiperiodicity. Scaling and universality. Analysis of experimental data: Fourier transforms, Poincare sections, fractal dimension, and Lyapunov exponents. Applications to mechanical systems, fluid dynamics, physics, geophysics, and chemistry. See 12.207[J]/18.354[J] for Nonlinear Dynamics: Continuum Systems."
        ],
        [
            "inst",
            [
                "D. Rothman"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.007 Geobiology: History of Life on Earth"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Surveys the interactive Earth system: biology in geologic, environmental and climate change throughout Earth's history. Introduces the concept of \"life as a geological agent\" and examines the interaction between biology and the Earth system during the roughly 4 billion years since life first appeared. Topics include the origin of the solar system and the early Earth atmosphere; the origin and evolution of life and its influence on climate up through and including the modern age and the problem of global warming; the global carbon cycle; and astrobiology."
        ],
        [
            "inst",
            [
                "T. Bosak",
                "G. Fournier"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.009[J] Nonlinear Dynamics: The Natural Environment"
        ],
        [
            "prerec",
            "Same subject as 18.352[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=18.02|18.02A|18.022|18.024\" onclick=\"return showCourse(this, '18.02|18.02A|18.022|18.024');\">Calculus II (GIR)</a> and <a href=\"/search/?P=8.01|8.01L|8.011|8.012\" onclick=\"return showCourse(this, '8.01|8.01L|8.011|8.012');\">Physics I (GIR)</a>; <i>Coreq: <a href=\"/search/?P=18.03\" title=\"18.03\" class=\"bubblelink code\" onclick=\"return showCourse(this, '18.03');\">18.03</a></i> "
            ]
        ],
        [
            "desc",
            "Analyzes cooperative processes that shape the natural environment, now and in the geologic past. Emphasizes the development of theoretical models that relate the physical and biological worlds, the comparison of theory to observational data, and associated mathematical methods. Topics include carbon cycle dynamics; ecosystem structure, stability and complexity; mass extinctions; biosphere-geosphere coevolution; and climate change. Employs techniques such as stability analysis; scaling; null model construction; time series and network analysis."
        ],
        [
            "inst",
            [
                "D. H. Rothman"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.010 Computational Methods of Scientific Programming"
        ],
        [
            "prerec",
            "Prereq: Calculus II (GIR) and Physics I (GIR)"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Introductory subject exposes students to modern programming methods and techniques used in practice by physical scientists today. Emphasis on code design, algorithm development/verification, and comparative advantages/disadvantages of different languages (including Python, Julia and C/C++) and tools (including Jupyter, machine-learning from data or models, cloud and high-performance computing workflows). Students are introduced to and work with common programming tools, types of problems, and techniques for solving a variety of data analytic and equation modeling scenarios from real research: examination visualization techniques; basic numerical analysis; methods of dissemination and verification; practices for reproducible work, version control, documentation, and sharing/publication. No prior programming experience is required."
        ],
        [
            "inst",
            [
                "T. Herring",
                "C. Hill"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.011[J] Archaeological Science"
        ],
        [
            "prerec",
            "Same subject as 3.985[J], 5.24[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=3.091|5.111|5.112\" onclick=\"return showCourse(this, '3.091|5.111|5.112');\">Chemistry (GIR)</a> or <a href=\"/search/?P=8.01|8.01L|8.011|8.012\" onclick=\"return showCourse(this, '8.01|8.01L|8.011|8.012');\">Physics I (GIR)</a> "
            ]
        ],
        [
            "desc",
            "See description under subject 3.985[J]."
        ],
        [
            "inst",
            [
                "D. Hosler",
                "H. N. Lechtman"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.012 MatLab, Statistics, Regression, Signal Processing"
        ],
        [
            "prerec",
            "Subject meets with 12.444"
        ],
        [
            "terms",
            [
                "Prereq: None. <i>Coreq: <a href=\"/search/?P=18.06\" title=\"18.06\" class=\"bubblelink code\" onclick=\"return showCourse(this, '18.06');\">18.06</a></i> "
            ]
        ],
        [
            "desc",
            "Introduces the basic tools needed for data analysis and interpretation in the Geosciences, as well as other sciences. Composed of four modules, targeted at introducing students to the basic concepts and applications in each module. MatLab: Principles and practice in its uses, script and function modules, basic approaches to solving problems. Statistics: Correlation, means, dispersion, precision, accuracy, distributions, central limit theorem, skewness, probability, Chi-Square, Gaussian and other common distributions used in hypothesis testing. Regression: Random and grid search methods, basic least squares and algorithms applicable to regression, inversion and parameter estimation. Signal Processing: Analog and digital signals, Z-transform, Fourier series, fast Fourier transforms, spectral analysis leakage and bias, digital filtering. Students taking the graduate version complete different assignments."
        ],
        [
            "inst",
            [
                "F. D. Morgan",
                "T. A. Herring",
                "S. Ravela"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.021 Earth Science, Energy, and the Environment"
        ],
        [
            "prerec",
            "Prereq: Calculus I (GIR), Chemistry (GIR), and Physics I (GIR)"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Fall)"
            ]
        ],
        [
            "desc",
            "Provides understanding of the Earth System most relevant to production of our planet's natural energy resources, including the physics, chemistry, and biology of conventional and alternative energy sources. Includes a broad overview of traditional and alternative energy sources: hydrocarbons (conventional and unconventional), nuclear, geothermal, hydroelectric, and wind and tides, along with their potentials and limitations. Develops detailed knowledge of the formation, concentration, and production of fossil and nuclear fuels, as well as the waste products associated with their consumption. An examination of conventional and alternative energy sources includes the environmental issues associated with the exploitation of these resources, both regional and global."
        ],
        [
            "inst",
            [
                "B. H. Hager"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.031[J] Fundamentals of Ecology"
        ],
        [
            "prerec",
            "Same subject as 1.018[J], 7.30[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 1.018[J]."
        ],
        [
            "inst",
            [
                "M. Follows",
                "D. Des Marais"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.080 Experiential Learning in EAPS"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring, Summer)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "For Course 12 students participating in off-campus professional experiences related to their course of study. Before registering for this subject, students must have an offer from a company or organization, must identify an EAPS supervisor, and must receive prior approval from their advisor. Upon completion of the experience, student must submit a letter from the company or organization describing what the student accomplished, along with a substantive final report from the student approved by the EAPS supervisor. Consult departmental academic office."
        ],
        [
            "inst",
            [
                "EAPS Faculty"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.086 Modeling Environmental Complexity"
        ],
        [
            "prerec",
            "Subject meets with 12.586"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=18.03\" title=\"18.03\" class=\"bubblelink code\" onclick=\"return showCourse(this, '18.03');\">18.03</a> "
            ]
        ],
        [
            "desc",
            "Introduction to mathematical and physical models of environmental processes. Emphasis on the development of macroscopic continuum or statistical descriptions of complex microscopic dynamics. Problems of interest include: random walks and statistical geometry of landscapes; percolation theory and transport in disordered media; fractals, scaling, and universality; ecological dynamics and the structure of ecosystems, food webs, and other natural networks; kinetics of biogeochemical cycles. Appropriate for advanced undergraduates. Beginning graduate students are encouraged to register for 12.586. Students taking the graduate version complete different assignments."
        ],
        [
            "inst",
            [
                "D. H. Rothman"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.090 Current Topics in Earth, Atmospheric, and Planetary Sciences"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Laboratory or field work in earth, atmospheric, and planetary sciences. Consult with department Education Office."
        ],
        [
            "inst",
            [
                "EAPS Faculty"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.091 Current Topics in Earth, Atmospheric, and Planetary Sciences"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: U (IAP)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Laboratory or field work in earth, atmospheric, and planetary sciences. Consult with department Education Office."
        ],
        [
            "inst",
            [
                "EAPS Faculty"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.092 Current Topics in Geology and Geochemistry"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Laboratory or field work in geology and geochemistry. Consult with department Education Office."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.093 Current Topics in Geology and Geochemistry"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "U (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Laboratory or field work in geology and geochemistry. To be arranged with department faculty. Consult with department Education Office."
        ],
        [
            "inst",
            [
                "EAPS Faculty"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.094 Current Topics in Geophysics"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Laboratory or field work in geophysics. Consult with department Education Office."
        ],
        [
            "inst",
            [
                "EAPS Faculty"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.095 Current Topics in Geophysics"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "U (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Laboratory, data analysis, system modeling or field work in geophysics. To be arranged with department faculty. Consult with department Education Office."
        ],
        [
            "inst",
            [
                "EAPS Faculty"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.096 Current Topics in Atmospheric Science and Oceanography"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Laboratory or field work in atmospheric science and oceanography. To be arranged with department faculty. Consult with department Education Office."
        ],
        [
            "inst",
            [
                "EAPS Faculty"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.097 Current Topics in Atmospheric Science and Oceanography"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "U (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Laboratory or field work in atmospheric science and oceanography. To be arranged with department faculty. Consult with department Education Office."
        ],
        [
            "inst",
            [
                "EAPS Faculty"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.098 Current Topics in Planetary Science"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Laboratory or field work in planetary science. To be arranged with department faculty. Consult with department Education Office."
        ],
        [
            "inst",
            [
                "EAPS Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.099 Current Topics in Planetary Science"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Laboratory or field work in planetary science. To be arranged with department faculty. Consult with department Education Office."
        ],
        [
            "inst",
            [
                "EAPS Faculty"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.C25[J] Real World Computation with Julia (New)"
        ],
        [
            "prerec",
            "Same subject as 1.C25[J], 6.C25[J], 16.C25[J], 18.C25[J], 22.C25[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=6.100A\" title=\"6.100A\" class=\"bubblelink code\" onclick=\"return showCourse(this, '6.100A');\">6.100A</a>, <a href=\"/search/?P=18.03\" title=\"18.03\" class=\"bubblelink code\" onclick=\"return showCourse(this, '18.03');\">18.03</a>, and <a href=\"/search/?P=18.06\" title=\"18.06\" class=\"bubblelink code\" onclick=\"return showCourse(this, '18.06');\">18.06</a> "
            ]
        ],
        [
            "desc",
            "See description under subject 18.C25[J]."
        ],
        [
            "inst",
            [
                "A. Edelman",
                "R. Ferrari",
                "B. Forget",
                "C. Leiseron,Y. Marzouk",
                "J. Williams"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.104 Geochemistry of Natural Waters"
        ],
        [
            "prerec",
            "Subject meets with 12.494"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=18.02|18.02A|18.022|18.024\" onclick=\"return showCourse(this, '18.02|18.02A|18.022|18.024');\">Calculus II (GIR)</a> "
            ]
        ],
        [
            "desc",
            "Equips students with the fundamental skills to identify major controls on the chemistry of waters on the Earth.  Students examine key concepts, theories and practical tools (e.g., pH, Eh, alkalinity, surface charge, speciation, and carbonate equilibrium) and apply them as tools to understand and make predictions for the biogeochemical cycles of the Earth systems.  Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "S. Ono"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.108 Structure of Earth Materials"
        ],
        [
            "prerec",
            "Prereq: Chemistry (GIR)"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: U (Fall)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Provides a comprehensive introduction to crystalline structure, crystal chemistry, and bonding in rock-forming minerals. Introduces the theory relating crystal structure and crystal symmetry to physical properties such as refractive index, elastic modulus, and seismic velocity. Surveys the distribution of silicate, oxide, and metallic minerals in the interiors and on the surfaces of planets, and discusses the processes that led to their formation."
        ],
        [
            "inst",
            [
                "T. L. Grove"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.109 Petrology"
        ],
        [
            "prerec",
            "Prereq: 12.108"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: U (Spring)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Surveys the distribution, chemical composition, and mineral associations in rocks of the Earth's crust and upper mantle, and establishes its relation to tectonic environment. Emphasis is on the use of chemistry and physics to interpret rock forming processes. Topics include dynamics of crust and mantle melting as preserved in the chemical composition of igneous rocks and minerals, the long-term record of global climate change as preserved in the minerals of sedimentary rocks, and the time-temperature-depth record preserved in minerals of metamorphosed crustal rocks."
        ],
        [
            "inst",
            [
                "T. L. Grove"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.11 Nature's Sandbox: A Record of Great Moments in Earth History"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (IAP)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Designed for students curious about Earth Systems. Covers how sediments and the sedimentary rock record preserve information about events in Earth History and ancient climates and oceans. Serves as an introduction to the subjects 12.110A Sedimentary Environments and 12.110B Sedimentology in the Field."
        ],
        [
            "inst",
            [
                "K. Bergmann"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.110A Sedimentary Environments"
        ],
        [
            "prerec",
            "Subject meets with 12.465A"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=12.001\" title=\"12.001\" class=\"bubblelink code\" onclick=\"return showCourse(this, '12.001');\">12.001</a> or <a href=\"/search/?P=12.11\" title=\"12.11\" class=\"bubblelink code\" onclick=\"return showCourse(this, '12.11');\">12.11</a> "
            ]
        ],
        [
            "desc",
            "Covers the basic concepts of sedimentation from the properties of individual grains to large-scale basin analysis. Lectures cover sediment textures and composition, fluid flow and sediment transport, and formation of sedimentary structures. Depositional models, for both modern and ancient environments are a major component and are studied in detail with an eye toward interpretation of depositional processes and reconstructing paleoenvironments from the rock record. Satisfies 6 units of Institute Laboratory credit. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "K. Bergmann"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.110B Sedimentology in the Field"
        ],
        [
            "prerec",
            "Subject meets with 12.465B"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=12.110A\" title=\"12.110A\" class=\"bubblelink code\" onclick=\"return showCourse(this, '12.110A');\">12.110A</a> "
            ]
        ],
        [
            "desc",
            "Examines the fundamentals of sedimentary deposits and geological reasoning through first hand fieldwork. Students practice methods of modern geological field study off-campus during a required trip over spring break making field observations, measuring stratigraphic sections and making a sedimentological map. Relevant topics introduced are map and figure making in ArcGIS and Adobe Illustrator and sedimentary petrology. Culminates in an oral and written report built around data gathered in the field. Field sites and intervals of geologic time studied rotate annually and include Precambrian, Phanerozoic and Modern depositional environments. Satisfies 6 units of Institute Laboratory credit. May be taken multiple times for credit. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "K. Bergmann"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.113 Structural Geology"
        ],
        [
            "prerec",
            "Prereq: 12.001"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: U (Fall)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Introduces mechanics of rock deformation. Discusses recognition, interpretation, and mechanics of faults, folds, structural features of igneous and metamorphic rocks, and superposed deformations. Introduces regional structural geology and tectonics. Laboratory includes techniques of structural analysis, recognition and interpretation of structures on geologic maps, and construction of interpretive cross sections."
        ],
        [
            "inst",
            [
                "M. Pec"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.115 Field Geology"
        ],
        [
            "prerec",
            "Prereq: 12.113"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: U (IAP)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Introduction to the methods of modern geological field study off-campus during an intensive two-week experience. Exercises include geological and geomorphological mapping on topographic and photographic base maps of a wide variety of bedrock and surficial rocks. Where feasible, geochemical and geophysical field measurements are corrrelated with geology. Location is usually in the western US. Contact department regarding travel fee and resources for funding opportunities. Meets with 12.482 when offered concurrently. Satisfies 9 units of Institute Laboratory credit."
        ],
        [
            "inst",
            [
                "O. Jagoutz"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.116 Analysis of Geologic Data"
        ],
        [
            "prerec",
            "Prereq: 12.115"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: U (Spring)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Includes in-depth laboratory analysis of samples, interpretation of geological data, and where possible, geophysical and geochemical data. Includes the preparation of reports based on the field studies conducted in 12.115 during January; report generally exceeds 30 pages in length and includes one major revision and rewrite. Instruction in writing techniques provided. Contact department regarding travel fee and resources for funding opportunities. Satisfies 3 units of Institute Laboratory credit."
        ],
        [
            "inst",
            [
                "O. Jagoutz"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.117A Field Geobiology I"
        ],
        [
            "prerec",
            "Subject meets with 12.487A"
        ],
        [
            "terms",
            [
                "Prereq: None. <i>Coreq: <a href=\"/search/?P=12.001\" title=\"12.001\" class=\"bubblelink code\" onclick=\"return showCourse(this, '12.001');\">12.001</a> or <a href=\"/search/?P=12.007\" title=\"12.007\" class=\"bubblelink code\" onclick=\"return showCourse(this, '12.007');\">12.007</a></i> "
            ]
        ],
        [
            "desc",
            "Examines basic biological processes that operate in sediments. Lectures cover biological, physical and chemical processes that influence the formation and stabilization of sediments, including biomineralization, weathering, erosion, the formation of sedimentary structures and interactions with sediments, flow, and the cycles of nutrients. Lab covers analytical methods used to examine microbial processes, bioinformatic methods used to analyze microbial communities, and techniques used to analyze sediment grain sizes and chemistry. Readings and discussions provide preparation for the 12.117B field trip to a modern sedimentary environment. Enables students to interpret processes in modern sedimentary environments, reconstruct similar processes in the rock record, collect appropriate samples in the field, and analyze microbiological data. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "T. Bosak"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.117B Field Geobiology II"
        ],
        [
            "prerec",
            "Subject meets with 12.487B"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=12.117A\" title=\"12.117A\" class=\"bubblelink code\" onclick=\"return showCourse(this, '12.117A');\">12.117A</a> "
            ]
        ],
        [
            "desc",
            "Teaches fundamentals of field observations and reasoning in geobiology/sedimentology during a required trip to a modern sedimentary environment over spring break, followed by laboratory analyses of collected samples. Students make observations, develop hypotheses, collect samples required to test their hypotheses and interact with lecturers and students investigating the sedimentology of the site. Upon return to MIT, students work on field samples to characterize the sediments, use the preliminary data to develop an understanding of the field site, and write research reports. Students taking graduate version write proposals that present a research question based on the field observations and subsequent analyses. Meets with 12.110B and 12.465B when those subjects examine modern sedimentary environments."
        ],
        [
            "inst",
            [
                "T. Bosak"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.119 Harnessing Power from Environmental Microbes and Chemical Gradients"
        ],
        [
            "prerec",
            "Prereq: Biology (GIR), Chemistry (GIR), or 12.007"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Spring)"
            ]
        ],
        [
            "desc",
            "Provides practical instruction on how to make living batteries. Lectures cover the basics of marine and freshwater chemistry and biogeochemistry (pH, redox potential, organic loading, free energy for growth, chemical profiles, sampling and measurement methods). Students explore sediment biogeochemistry by analyzing mineral types and grain sizes, setting up microbial enrichment cultures, and sampling and characterizing microbes and environmental chemistry by microscopy, chemical assays of pore fluids, and bioinformatics tools. Subsequent lab activities teach students to develop and use electrochemical tools to build microbial batteries that can power light sources and instruments. Discussion and reading cover real-world applications of microbial fuel cells."
        ],
        [
            "inst",
            [
                "T. Bosak",
                "E. Boyle",
                "S. Ono"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.12 Nature's Sandbox: The History of Ancient Environments, Climate, and Life"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Spring; second half of term)"
            ]
        ],
        [
            "desc",
            "Series of field adventures to survey Earth's history and landscape through a combination of online and in-person instruction, with virtual field trips to Svalbard, Norway, the Death Valley area and Northern Minnesota. In these key sites, students explore the interactions between Earth's surface environments and life, and critical transitions in each. Includes weekly in-class paper discussions and experiential exercises. Three optional one-day field trips provide opportunity to explore the amazing sedimentary record preserved close to MIT. Subject can count toward the 6-unit discovery-focused credit limit for first year students."
        ],
        [
            "inst",
            [
                "K. Bergmann"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.141 Electron Microprobe Analysis"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (IAP)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Introduction to the theory of x-ray microanalysis through the electron microprobe including ZAF matrix corrections. Techniques to be discussed are wavelength and energy dispersive spectrometry, scanning backscattered electron, secondary electron, cathodoluminescence, and x-ray imaging. Lab sessions involve use of the electron microprobe."
        ],
        [
            "inst",
            [
                "N. Chatterjee"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.158 Molecular Biogeochemistry"
        ],
        [
            "prerec",
            "Subject meets with 12.458"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Covers all aspects of molecular biosignatures, such as their pathways of lipid biosynthesis, the distribution patterns of lipid biosynthetic pathways with regard to phylogeny and physiology, isotopic contents, occurrence in modern organisms and environments, diagenetic pathways, analytical techniques and the occurrence of molecular fossils through the geological record. Students analyze in depth the recent literature on chemical fossils. Lectures provide background on the subject matter. Basic knowledge of organic chemistry required. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "R. Summons"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.163 Geomorphology"
        ],
        [
            "prerec",
            "Subject meets with 12.463"
        ],
        [
            "terms",
            [
                "Prereq: (<a href=\"/search/?P=18.01|18.01A|18.014\" onclick=\"return showCourse(this, '18.01|18.01A|18.014');\">Calculus I (GIR)</a>, <a href=\"/search/?P=8.01|8.01L|8.011|8.012\" onclick=\"return showCourse(this, '8.01|8.01L|8.011|8.012');\">Physics I (GIR)</a>, and <a href=\"/search/?P=12.001\" title=\"12.001\" class=\"bubblelink code\" onclick=\"return showCourse(this, '12.001');\">12.001</a>) or permission of instructor "
            ]
        ],
        [
            "desc",
            "Quantitative examination of processes that shape Earth's surface. Introduction to fluvial, hillslope, and glacial mechanics. Essentials of weathering, soil formation, runoff, erosion, slope stability, sediment transport, and river morphology. Landscape evolution in response to climatic and tectonic forcing. Application of terrestrial theory to planetary surfaces. Additional instruction in geographic information systems (GIS) and remote sensing analysis, field measurement techniques, and numerical modeling of surface processes. Students taking the graduate version complete different assignments."
        ],
        [
            "inst",
            [
                "T. Perron"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.170 Essentials of Geology"
        ],
        [
            "prerec",
            "Subject meets with 12.470"
        ],
        [
            "terms",
            [
                "Prereq: (<a href=\"/search/?P=18.02|18.02A|18.022|18.024\" onclick=\"return showCourse(this, '18.02|18.02A|18.022|18.024');\">Calculus II (GIR)</a> and <a href=\"/search/?P=8.02|8.021|8.022\" onclick=\"return showCourse(this, '8.02|8.021|8.022');\">Physics II (GIR)</a>) or permission of instructor "
            ]
        ],
        [
            "desc",
            "Studies the geology of planetary interiors and surfaces, including plate tectonics, as a unifying theory of terrestrial geology, surface processes, and the Earth's interior. Covers igneous, metamorphic, and sedimentary processes associated with tectonic settings and the typical rock suites created; mineral and rock identification; and causes of compositional differences on many scales (mineral grains, rocks, regions of the Earth, different planets). Also addresses conditions required for melting and melting processes; rock structure and field techniques; and Earth history. Treatment of these topics includes discussions of the geochemical, petrologic, geochronological, experimental, or field techniques used to investigate them; the limitations of current geological techniques and geological controversies; and major geological expeditions, experiments, and studies from the past, along with their premises and results. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "EAPS Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.177 Astrobiology, Origins and Early Evolution of Life"
        ],
        [
            "prerec",
            "Subject meets with 12.477"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=7.012|7.013|7.014|7.015|7.016\" onclick=\"return showCourse(this, '7.012|7.013|7.014|7.015|7.016');\">Biology (GIR)</a>, <a href=\"/search/?P=3.091|5.111|5.112\" onclick=\"return showCourse(this, '3.091|5.111|5.112');\">Chemistry (GIR)</a>, or permission of instructor "
            ]
        ],
        [
            "desc",
            "Provides an understanding of major areas of research into the problem of the origin of life on the early Earth from an astrobiological perspective. Topics include the timing, setting and conditions for the origin of life on the Hadean Earth; roles of planetary and extra-planetary processes; defining life; prebiotic chemistry; origins of nucleic acids and peptides; evolution of cellularity, replication, metabolism, and translation; establishment of the genetic code; biogenesis vs. ecogenesis; the nature of the last common ancestor of life; conceptualizing the \"tree of life;\" and the early evolution of the ancestors of bacteria, archaeal, and eukaryal lineages. Students taking graduate version complete an extra project."
        ],
        [
            "inst",
            [
                "G. Fournier"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.178 The Phylogenomic Planetary Record"
        ],
        [
            "prerec",
            "Subject meets with 12.478"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Introduces the tools of sequence-based phylogenetic analysis and molecular evolution in the context of studying events in Earth's deep past that have been preserved by genomes. Topics include basic concepts of cladistics, phylogeny and sequence evolution, construction of phylogenetic trees of genes and microbial lineages, molecular clocks, dating, and ancestral sequence reconstruction. Special attention to the evolutionary history of microbial metabolisms and their relationship to global biogeochemical cycles across Earth's history. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "G. Fournier"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.201 Essentials of Global Geophysics"
        ],
        [
            "prerec",
            "Subject meets with 12.501"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=8.02|8.021|8.022\" onclick=\"return showCourse(this, '8.02|8.021|8.022');\">Physics II (GIR)</a> and <a href=\"/search/?P=18.03\" title=\"18.03\" class=\"bubblelink code\" onclick=\"return showCourse(this, '18.03');\">18.03</a> "
            ]
        ],
        [
            "desc",
            "Overview of basic topics in solid-earth geophysics, such as the Earth's rotation, gravity and magnetic field, seismology, and thermal structure. Formulation of physical principles presented in three one-hour lectures per week. Current applications discussed in an additional one-hour tutorial each week. Students taking graduate version complete different assignments."
        ],
        [
            "inst",
            [
                "R. van der Hilst"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.202 Flow, Deformation, and Fracture in Earth and Other Terrestrial Bodies"
        ],
        [
            "prerec",
            "Subject meets with 12.502"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=18.02|18.02A|18.022|18.024\" onclick=\"return showCourse(this, '18.02|18.02A|18.022|18.024');\">Calculus II (GIR)</a> and <a href=\"/search/?P=8.01|8.01L|8.011|8.012\" onclick=\"return showCourse(this, '8.01|8.01L|8.011|8.012');\">Physics I (GIR)</a> "
            ]
        ],
        [
            "desc",
            "Covers fundamentals of deformation and fracture of solids and the flow of viscous fluids. Explores spatial scales from molecular to planetary, and time scales from fractions of a second to millions of years, to understand how and why natural materials on Earth and other terrestrial bodies respond to applied forces. Fundamental concepts include the principles of continuum mechanics, tensor representation of physical properties, forces, tractions, stresses, strain theory, elasticity, contact problems, fracture and friction, and viscous flow and rheological models (plasticity, viscosity, viscoelasticity, elasto-plasticity). Students gather, analyze and interpret data using existing theoretical models. Includes a significant laboratory component that provides practical experience with experimental measurements and tests students' acquired theoretical knowledge. Students taking graduate version complete different assignments."
        ],
        [
            "inst",
            [
                "B. Minchew",
                "M. Pec"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.203 Mechanics of Earth"
        ],
        [
            "prerec",
            "Subject meets with 12.503"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=18.02|18.02A|18.022|18.024\" onclick=\"return showCourse(this, '18.02|18.02A|18.022|18.024');\">Calculus II (GIR)</a> and <a href=\"/search/?P=8.01|8.01L|8.011|8.012\" onclick=\"return showCourse(this, '8.01|8.01L|8.011|8.012');\">Physics I (GIR)</a> "
            ]
        ],
        [
            "desc",
            "Covers topics in the deformation and fracture of solids and the flow of viscous fluids. Explores spatial scales from molecular to planetary, and time scales from fractions of a second to millions of years, to understand how and why natural materials on Earth and other terrestrial bodies respond to applied forces. Introduces anelasticity, granular mechanics, poroelasticity, rate-and-state friction, transport properties of Earth materials (Darcy's law, Fick's law), brittle-ductile transitions, creep of polycrystalline materials, stored energy and dissipation, and convection. Prepares students to gather, analyze and interpret data using existing theoretical models. Through a significant laboratory component, students obtain practical experience with experimental measurements and test their acquired theoretical knowledge. Students taking graduate version complete different assignments."
        ],
        [
            "inst",
            [
                "B. Minchew",
                "M. Pec"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.207[J] Nonlinear Dynamics: Continuum Systems"
        ],
        [
            "prerec",
            "Same subject as 1.062[J], 18.354[J]\nSubject meets with 18.3541"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=8.02|8.021|8.022\" onclick=\"return showCourse(this, '8.02|8.021|8.022');\">Physics II (GIR)</a> and (<a href=\"/search/?P=18.03\" title=\"18.03\" class=\"bubblelink code\" onclick=\"return showCourse(this, '18.03');\">18.03</a> or <a href=\"/search/?P=18.032\" title=\"18.032\" class=\"bubblelink code\" onclick=\"return showCourse(this, '18.032');\">18.032</a>) "
            ]
        ],
        [
            "desc",
            "See description under subject 18.354[J]."
        ],
        [
            "inst",
            [
                "B. Primkulov"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.211 Field Geophysics (New)"
        ],
        [
            "prerec",
            "Subject meets with 12.511"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=12.214\" title=\"12.214\" class=\"bubblelink code\" onclick=\"return showCourse(this, '12.214');\">12.214</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Covers practical methods of modern geophysics, including the global positioning system (GPS), gravity, and magnetics. Field work is conducted in western US and includes intensive 10-day field exercise. Focuses on measurement techniques and their interpretation. Introduces the science of gravity, magnetics, and the GPS. Measures crustal structure, fault motions, tectonic deformations, and the local gravity and magnetic fields. Students perform high-precision measurements and participate in data analysis. Emphasizes principles of geophysical data collection and the relevance of these data for tectonic faulting, crustal structure, and the dynamics of the earthquake cycle. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "W. Frank",
                "B. Minchew",
                "B. H. Hager",
                "T. A. Herring"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.213 Alternate Energy Sources"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (IAP)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Explores a number of alternative energy sources such as geothermal energy (heat from the Earth's interior), wind, natural gas, and solar energy. Includes a field trip to visit sites where alternative energy is being harvested or generated. Content and focus of subject varies from year to year."
        ],
        [
            "inst",
            [
                "F. D. Morgan"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.214 Essentials of Field Geophysics"
        ],
        [
            "prerec",
            "Subject meets with 12.507"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=8.02|8.021|8.022\" onclick=\"return showCourse(this, '8.02|8.021|8.022');\">Physics II (GIR)</a>, <a href=\"/search/?P=6.100A\" title=\"6.100A\" class=\"bubblelink code\" onclick=\"return showCourse(this, '6.100A');\">6.100A</a>, and <a href=\"/search/?P=18.03\" title=\"18.03\" class=\"bubblelink code\" onclick=\"return showCourse(this, '18.03');\">18.03</a> "
            ]
        ],
        [
            "desc",
            "Introduces students to the practical field application of various geophysical methods to studying Earth's near-surface and prepares students to undertake fieldwork that uses these methods. Methods covered include but are not limited to measuring seismic waves, gravity, precise positions (commonly referred to as GPS but formally known as GNSS), and topography using drones. Lab time involves local fieldwork to gain experience with the methods being taught. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "B. Minchew",
                "W. Frank"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.300[J] Global Change Science"
        ],
        [
            "prerec",
            "Same subject as 1.071[J]\nSubject meets with 1.771"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=18.03\" title=\"18.03\" class=\"bubblelink code\" onclick=\"return showCourse(this, '18.03');\">18.03</a> "
            ]
        ],
        [
            "desc",
            "See description under subject 1.071[J]."
        ],
        [
            "inst",
            [
                "E. Eltahir"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.301 Climate Science"
        ],
        [
            "prerec",
            "Subject meets with 12.842"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=3.091|5.111|5.112\" onclick=\"return showCourse(this, '3.091|5.111|5.112');\">Chemistry (GIR)</a>, <a href=\"/search/?P=18.03\" title=\"18.03\" class=\"bubblelink code\" onclick=\"return showCourse(this, '18.03');\">18.03</a>, or permission of instructor "
            ]
        ],
        [
            "desc",
            "Introduction to climate studies, including beginnings of the solar system, time scales, and climate in human history; methods for detecting climate change, including proxies, ice cores, instrumental records, and time series analysis; physical and chemical processes in climate, including primordial atmosphere, ozone chemistry, carbon and oxygen cycles, and heat and water budgets; internal feedback mechanisms, including ice, aerosols, water vapor, clouds, and ocean circulation; climate forcing, including orbital variations, volcanism, plate tectonics, and solar variability; climate models and mechanisms of variability, including energy balance, coupled models, and global ocean and atmosphere models; and outstanding problems. Students taking the graduate version complete different assignments."
        ],
        [
            "inst",
            [
                "A. Fiore",
                "E. Boyle"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.306 Atmospheric Physics and Chemistry"
        ],
        [
            "prerec",
            "Subject meets with 10.571[J], 12.806[J]"
        ],
        [
            "terms",
            [
                "Prereq: (<a href=\"/search/?P=18.075\" title=\"18.075\" class=\"bubblelink code\" onclick=\"return showCourse(this, '18.075');\">18.075</a> and (<a href=\"/search/?P=5.60\" title=\"5.60\" class=\"bubblelink code\" onclick=\"return showCourse(this, '5.60');\">5.60</a> or 5.61)) or permission of instructor "
            ]
        ],
        [
            "desc",
            "Introduction to the physics and chemistry of the atmosphere including experience with computer codes. Aerosols and theories of their formation, evolution, and removal. Gas and aerosol transport from urban to continental scales. Coupled models of radiation, transport, and chemistry. Solution of inverse problems to deduce emissions and removal rates. Emissions control technology and costs. Applications to air pollution and climate. Students taking the graduate version complete different assignments."
        ],
        [
            "inst",
            [
                "R. G. Prinn"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.307 Weather and Climate Laboratory"
        ],
        [
            "prerec",
            "Prereq: Calculus II (GIR) and Physics I (GIR)"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Engages students in projects involving rotating tank laboratory experiments, analysis of data on the sphere, and report writing and presentation. Project themes explore fundamentals of climate science and make contact points with major contemporary environmental challenges facing mankind. Examples include heat and moisture transport in the atmosphere; weather and weather extremes; aerosols, dust, and atmospheric pollution; ocean circulation and transport and plastics in the ocean. Develops skills for how to deal with noisy, imperfect data. Provides instruction and practice in written and oral communication."
        ],
        [
            "inst",
            [
                "L. Illari",
                "J. Marshall"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.310 An Introduction to Weather Forecasting"
        ],
        [
            "prerec",
            "Prereq: Calculus I (GIR) and Physics I (GIR)"
        ],
        [
            "terms",
            [
                "U (IAP)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Basic principles of synoptic meteorology and weather forecasting. Analysis of hourly weather data and numerical weather prediction models. Regular preparation of weather forecasts."
        ],
        [
            "inst",
            [
                "L. Illari"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.315 Atmospheric Radiation and Convection"
        ],
        [
            "prerec",
            "Subject meets with 12.815"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=12.390\" title=\"12.390\" class=\"bubblelink code\" onclick=\"return showCourse(this, '12.390');\">12.390</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Introduction to the physics of atmospheric radiation, remote sensing, and convection, including use of computer codes. Radiative transfer equation including emission and scattering, spectroscopy, Mie theory, and numerical solutions. Physics of dry and moist convection, including moist thermodynamics. Radiative-convective equilibrium. Solution of inverse problems in remote sensing of atmospheric temperature and composition. Students taking graduate version complete different assignments."
        ],
        [
            "inst",
            [
                "T. Cronin"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.318 Introduction to Atmospheric Data and Large-scale Dynamics"
        ],
        [
            "prerec",
            "Subject meets with 12.818"
        ],
        [
            "terms",
            [
                "Prereq: None. <i>Coreq: <a href=\"/search/?P=12.390\" title=\"12.390\" class=\"bubblelink code\" onclick=\"return showCourse(this, '12.390');\">12.390</a></i> "
            ]
        ],
        [
            "desc",
            "Provides a general introduction to meteorological data and analysis techniques, and their use in the MIT Synoptic Laboratory to study the phenomenology and dynamics of large-scale atmospheric flow. Illustrates balance concepts as applied to the dynamics of frontal and synoptic scales, using real-time upper-air and surface station data and gridded analyzed fields. Uses advanced meteorological software packages to access, manipulate, and graphically display the data. Students taking graduate version complete different assignments."
        ],
        [
            "inst",
            [
                "L. Illari"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.320A[J] Introduction to Hydrology and Water Resources"
        ],
        [
            "prerec",
            "Same subject as 1.070A[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=1.060A\" title=\"1.060A\" class=\"bubblelink code\" onclick=\"return showCourse(this, '1.060A');\">1.060A</a>; <i>Coreq: <a href=\"/search/?P=1.061A\" title=\"1.061A\" class=\"bubblelink code\" onclick=\"return showCourse(this, '1.061A');\">1.061A</a> and <a href=\"/search/?P=1.106\" title=\"1.106\" class=\"bubblelink code\" onclick=\"return showCourse(this, '1.106');\">1.106</a></i> "
            ]
        ],
        [
            "desc",
            "See description under subject 1.070A[J]."
        ],
        [
            "inst",
            [
                "D. Entekhabi"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.320B[J] Introduction to Hydrology Modeling"
        ],
        [
            "prerec",
            "Same subject as 1.070B[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=1.070A\" title=\"1.070A[J]\" class=\"bubblelink code\" onclick=\"return showCourse(this, '1.070A');\">1.070A[J]</a> "
            ]
        ],
        [
            "desc",
            "See description under subject 1.070B[J]."
        ],
        [
            "inst",
            [
                "D. Entekhabi"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.330[J] Fluid Physics"
        ],
        [
            "prerec",
            "Same subject as 1.066[J], 8.292[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=5.60\" title=\"5.60\" class=\"bubblelink code\" onclick=\"return showCourse(this, '5.60');\">5.60</a>, <a href=\"/search/?P=8.044\" title=\"8.044\" class=\"bubblelink code\" onclick=\"return showCourse(this, '8.044');\">8.044</a>, or permission of instructor "
            ]
        ],
        [
            "desc",
            "See description under subject 8.292[J]."
        ],
        [
            "inst",
            [
                "L. Bourouiba"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.335 Experimental Atmospheric Chemistry"
        ],
        [
            "prerec",
            "Subject meets with 12.835"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=3.091|5.111|5.112\" onclick=\"return showCourse(this, '3.091|5.111|5.112');\">Chemistry (GIR)</a> "
            ]
        ],
        [
            "desc",
            "Introduces the atmospheric chemistry involved in climate change, air pollution, and ozone depletion using a combination of interactive laboratory and field studies and simple computer models. Uses instruments for trace gas and aerosol measurements and methods for inferring fundamental information from these measurements. Provides instruction and practice in written and oral communication. Students taking the graduate version complete different assignments."
        ],
        [
            "inst",
            [
                "R. Prinn",
                "S. Ono"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.336[J] Air Pollution and Atmospheric Chemistry"
        ],
        [
            "prerec",
            "Same subject as 1.085[J]\nSubject meets with 1.855"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=18.03\" title=\"18.03\" class=\"bubblelink code\" onclick=\"return showCourse(this, '18.03');\">18.03</a> "
            ]
        ],
        [
            "desc",
            "See description under subject 1.085[J]. Recommended for upper-level undergraduate students."
        ],
        [
            "inst",
            [
                "C. Heald"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.338 Aerosol and Cloud Microphysics and Chemistry"
        ],
        [
            "prerec",
            "Subject meets with 1.842[J], 12.814[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=1.085\" title=\"1.085[J]\" class=\"bubblelink code\" onclick=\"return showCourse(this, '1.085');\">1.085[J]</a>, <a href=\"/search/?P=12.335\" title=\"12.335\" class=\"bubblelink code\" onclick=\"return showCourse(this, '12.335');\">12.335</a>, or permission of instructor "
            ]
        ],
        [
            "desc",
            "Focuses on understanding how aerosol particles form droplets or ice crystals during several atmospheric processes: determining Earth's radiative balance; heterogeneous chemistry and acid rain; understanding where, when and how much precipitation occurs. Provides tools for understanding the physics of aerosol and cloud element motion; the interaction of particles with water vapor, including phase changes and droplet and ice nucleation; the chemical composition of particles and the effect on cloud formation processes; and the effect of cloud processing on aerosol chemistry. Discusses relevant topics of contemporary interest, e.g., geoengineering and weather modification and volcanic effects. Students taking the graduate version complete different assignments."
        ],
        [
            "inst",
            [
                "D. Cziczo"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.346[J] Global Environmental Negotiations"
        ],
        [
            "prerec",
            "Same subject as IDS.062[J]"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "See description under subject IDS.062[J]."
        ],
        [
            "inst",
            [
                "N. E. Selin"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.348[J] Global Climate Change: Economics, Science, and Policy"
        ],
        [
            "prerec",
            "Same subject as 15.026[J]"
        ],
        [
            "terms",
            [
                "Prereq: (<a href=\"/search/?P=18.02|18.02A|18.022|18.024\" onclick=\"return showCourse(this, '18.02|18.02A|18.022|18.024');\">Calculus II (GIR)</a>, <a href=\"/search/?P=5.60\" title=\"5.60\" class=\"bubblelink code\" onclick=\"return showCourse(this, '5.60');\">5.60</a>, and <a href=\"/search/?P=14.01\" title=\"14.01\" class=\"bubblelink code\" onclick=\"return showCourse(this, '14.01');\">14.01</a>) or permission of instructor "
            ]
        ],
        [
            "desc",
            "See description under subject 15.026[J]."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.349 Mechanisms and Models of the Global Carbon Cycle"
        ],
        [
            "prerec",
            "Subject meets with 12.849"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=18.02|18.02A|18.022|18.024\" onclick=\"return showCourse(this, '18.02|18.02A|18.022|18.024');\">Calculus II (GIR)</a> and <a href=\"/search/?P=8.01|8.01L|8.011|8.012\" onclick=\"return showCourse(this, '8.01|8.01L|8.011|8.012');\">Physics I (GIR)</a> "
            ]
        ],
        [
            "desc",
            "Addresses changes in the ocean, terrestrial biosphere and rocks modulation of atmospheric carbon dioxide on timescales from months to millions of years. Includes feedbacks between carbon cycle and climate. Combines hands-on data analysis with the formulation of simple models rooted in basic physical, chemical and biological principles. Students create individual \"toy\" global carbon cycle models. Students taking graduate version complete different assignments."
        ],
        [
            "inst",
            [
                "M. Follows"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.372 Elements of Modern Oceanography"
        ],
        [
            "prerec",
            "Subject meets with 12.702"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Examines a series of crosscutting topics that exemplify current directions in interdisciplinary oceanography. Focuses on current themes in oceanography, their interdisciplinary nature, and the role of ocean sciences in society. Introduces core concepts across the disciplines of biological, physical, and chemical oceanography as well as marine geology. Emphasizes the interdisciplinary aspects of these core concepts, the kinds of approaches and modes of thinking common to all of the disciplines, and the technological developments underpinning current advances. Students taking graduate version complete different assignments."
        ],
        [
            "inst",
            [
                "G. Lawson",
                "A. Kirincich (WHOI)"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.373 Field Oceanography"
        ],
        [
            "prerec",
            "Subject meets with 12.777"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=7.012|7.013|7.014|7.015|7.016\" onclick=\"return showCourse(this, '7.012|7.013|7.014|7.015|7.016');\">Biology (GIR)</a>, <a href=\"/search/?P=3.091|5.111|5.112\" onclick=\"return showCourse(this, '3.091|5.111|5.112');\">Chemistry (GIR)</a>, and permission of instructor "
            ]
        ],
        [
            "desc",
            "Provides an introduction to the biogeochemistry of the ocean, and the field techniques and methods used in its study. Emphasizes biogeochemistry and the interrelated nature of elemental cycling, but also examines physical transport and air-sea gas exchange. Covers multiple aspects related to field instrumentation and measurements, including nutrients, oxygen, the carbon system, temperature, and salinity. Presents microbial analyses, such as metagenomics. Includes a mandatory spring break field trip aboard a research vessel; opportunities for funded travel available. Students work in groups to propose a project over the week-long voyage that utilizes the field time to collect samples. During the second half of the term, students analyze and synthesize the data, and present it in a publication-quality manuscript. Students taking graduate version complete additional assignments. Enrollment limited."
        ],
        [
            "inst",
            [
                "A. R. Babbin"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.377 The History of Earth's Climate"
        ],
        [
            "prerec",
            "Subject meets with 12.707"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Studies the climate history of the Earth, from the formation of the early atmosphere and ocean to the present. Evaluates geochemical, sedimentological, and paleontological evidence for changes in ocean circulation, global temperatures, and atmospheric carbon dioxide levels. Covers theories and models of Phanerozoic climate change. Provides a long-term history of the global carbon cycle. Students taking graduate version complete different assignments."
        ],
        [
            "inst",
            [
                "D. McGee"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.384[J] Living Dangerously: Environmental Problems from 1900 to Today"
        ],
        [
            "prerec",
            "Same subject as STS.055[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Historical overview of the interactions between people and their environments in the past 100 years. Focuses on the accelerating human impact on Earth, starting in the late 19th century and continuing to the present day. Covers case studies showing how people have become aware of their impacts on the environment, and, in turn, the environment's impacts upon human society and what humans have done to mitigate damages. Topics include: food safety and security, industrial agriculture, pesticides, nuclear energy and warfare, lead, smog, ozone depletion, and climate change. Limited to 18."
        ],
        [
            "inst",
            [
                "S. Solomon",
                "K. Brown"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.385 Science, Politics, and Environmental Policy"
        ],
        [
            "prerec",
            "Subject meets with 11.373[J], 12.885[J]"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Examines the role of science in US and international environmental policymaking. Surveys the methods by which scientists learn about the natural world; the treatment of science by experts, advocates, the media, and the public and the way science is used in legislative, administrative and judicial decision making. Through lectures, group discussions, and written essays, students develop a critical understanding of the role of science in environmental policy. Potential case studies include fisheries management, ozone depletion, global warming, smog, and endangered species. Students taking the graduate version complete different assignments."
        ],
        [
            "inst",
            [
                "S. Solomon",
                "J. Knox-Hayes"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.386[J] Environment and History"
        ],
        [
            "prerec",
            "Same subject as 21H.185[J], STS.031[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21H.185[J]. Enrollment limited."
        ],
        [
            "inst",
            [
                "K. Brown",
                "S. Solomon"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.387[J] People and the Planet: Environmental Governance and Science"
        ],
        [
            "prerec",
            "Same subject as 15.874[J], IDS.063[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Introduces governance and science aspects of complex environmental problems and approaches to solutions. Introduces quantitative analyses and methodological tools to analyze environmental issues that have human and natural components. Demonstrates concepts through a series of in-depth case studies of environmental governance and science problems. Students develop writing, quantitative modeling, and analytical skills in assessing environmental systems problems and developing solutions. Through experiential activities, such as modeling and policy exercises, students engage with the challenges and possibilities of governance in complex, interacting systems, including biogeophysical processes and societal and stakeholder interactions."
        ],
        [
            "inst",
            [
                "N. Selin",
                "S. Solomon",
                "J. Sterman"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.390 Fluid Dynamics of the Atmosphere and Ocean"
        ],
        [
            "prerec",
            "Subject meets with 12.800"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=12.003\" title=\"12.003\" class=\"bubblelink code\" onclick=\"return showCourse(this, '12.003');\">12.003</a> "
            ]
        ],
        [
            "desc",
            "Introduction to fluid dynamics. Students acquire an understanding of some of the basic concepts of fluid dynamics that are needed as a foundation for advanced coursework in atmospheric science, physical oceanography, ocean engineering, climate science, etc. Emphasizes fluid fundamentals, with an atmosphere/ocean twist. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "A. Mahadevan",
                "C. Cenedese"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.391 Current Topics in Earth, Atmospheric and Planetary Sciences"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (IAP)"
            ]
        ],
        [
            "desc",
            "Laboratory or field work in earth, atmospheric, and planetary sciences. Consult with department Education Office."
        ],
        [
            "inst",
            [
                "EAPS Faculty"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.396[J] Leadership and Professional Strategies & Skills Training (LEAPS), Part I: Advancing Your Professional Strategies and Skills"
        ],
        [
            "prerec",
            "Same subject as 5.961[J], 8.396[J], 9.980[J], 18.896[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 8.396[J]. Limited to 80."
        ],
        [
            "inst",
            [
                "A. Frebel"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.397[J] Leadership and Professional Strategies & Skills Training (LEAPS), Part II: Developing Your Leadership Competencies"
        ],
        [
            "prerec",
            "Same subject as 5.962[J], 8.397[J], 9.981[J], 18.897[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 8.397[J]. Limited to 80."
        ],
        [
            "inst",
            [
                "D. Rigos"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.400 Our Space Odyssey"
        ],
        [
            "prerec",
            "Prereq: Physics I (GIR)"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Traces historical and scientific advancement of our understanding of Earth's cosmic context. Introduces basic physical principles by which planets form and create their associated features of rings, satellites, diverse landscapes, atmospheres, and climates. Includes the physics of asteroids and comets and their orbital characteristics and links to meteorites. Considers one of the most fundamental questions - whether or not we are alone - by detailing the scientific exploration goals to be achieved at the Moon, Mars, and beyond."
        ],
        [
            "inst",
            [
                "J. de Wit"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.402[J] Introduction to Astronomy"
        ],
        [
            "prerec",
            "Same subject as 8.282[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=8.01|8.01L|8.011|8.012\" onclick=\"return showCourse(this, '8.01|8.01L|8.011|8.012');\">Physics I (GIR)</a> "
            ]
        ],
        [
            "desc",
            "See description under subject 8.282[J]."
        ],
        [
            "inst",
            [
                "M. Tegmark"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.409 Hands-On Astronomy: Observing Stars and Planets"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Background for, and techniques of, visual observation and electronic imaging of the Moon, planets, satellites, stars, and brighter deep-space objects. Weekly outdoor observing sessions using 8-inch diameter telescopes when weather permits. Indoor sessions introduce skills necessary for observation. Introduction to contemporary observational astronomy including astronomical computing, image and data processing, and how astronomers work. Student must maintain a careful and complete written log which is graded. Consumes an entire evening each week; 100% attendance at observing sessions required to pass. Enrollment limited; priority to first-year students."
        ],
        [
            "inst",
            [
                "M. Person"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.410[J] Observational Techniques of Optical Astronomy"
        ],
        [
            "prerec",
            "Same subject as 8.287[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=8.282\" title=\"8.282[J]\" class=\"bubblelink code\" onclick=\"return showCourse(this, '8.282');\">8.282[J]</a>, <a href=\"/search/?P=12.409\" title=\"12.409\" class=\"bubblelink code\" onclick=\"return showCourse(this, '12.409');\">12.409</a>, or other introductory astronomy course "
            ]
        ],
        [
            "desc",
            "Fundamental physical and optical principles used for astronomical measurements at visible wavelengths and practical methods of astronomical observations. Topics: astronomical coordinates, time, optics, telescopes, photon counting, signal-to-noise ratios, data analysis (including least-squares model fitting), limitations imposed by the Earth's atmosphere on optical observations, CCD detectors, photometry, spectroscopy, astrometry, and time variability. Project at Wallace Astrophysical Observatory. Written and oral project reports. Limited to 18; preference to Course 8 and Course 12 majors and minors."
        ],
        [
            "inst",
            [
                "M. Person",
                "R. Teague"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.411 Astronomy Field Camp"
        ],
        [
            "prerec",
            "Prereq: 12.410[J]"
        ],
        [
            "terms",
            [
                "U (IAP)"
            ]
        ],
        [
            "desc",
            "Individual research projects in planetary science and astrophysics, involving supervised work at Teide Observatory on the island of Tenerife, Spain. Projects may include observations made using observatory telescope facilities. Project topics and objectives vary from year to year. Written and oral reports required. Limited to 6."
        ],
        [
            "inst",
            [
                "M. Person"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.412 Meteorites, Cosmochemistry, and Solar System Formation (New)"
        ],
        [
            "prerec",
            "Subject meets with 12.612"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "A broad introduction to cosmochemistry, the study of the solar system formation from a geochemical perspective. Examines how the current meteorite records are used to gain information on the processes that happened in the early solar system. Topics include the origin of elements and isotopes, chemical fractionations of them during different processes, meteorite records, pre-solar grains, cosmochemical models for the solar system formation, chronology of planetary bodies from radioactive isotopes, and analytical techniques commonly used in cosmochemistry. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "N. X. Nie"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.420 Essentials of Planetary Science"
        ],
        [
            "prerec",
            "Subject meets with 12.601"
        ],
        [
            "terms",
            [
                "Prereq: (<a href=\"/search/?P=8.03\" title=\"8.03\" class=\"bubblelink code\" onclick=\"return showCourse(this, '8.03');\">8.03</a>, <a href=\"/search/?P=12.002\" title=\"12.002\" class=\"bubblelink code\" onclick=\"return showCourse(this, '12.002');\">12.002</a>, and <a href=\"/search/?P=18.03\" title=\"18.03\" class=\"bubblelink code\" onclick=\"return showCourse(this, '18.03');\">18.03</a>) or permission of instructor "
            ]
        ],
        [
            "desc",
            "Advanced applications of physical and chemical principles to the study of the solar system. Topics include terrestrial and giant planets, meteorites, asteroids, comets, Kuiper belt objects, rings, impact craters, interiors, surfaces, atmospheres, geomagnetism, cosmochemistry, remote sensing, formation and evolution of the solar system."
        ],
        [
            "inst",
            [
                "B. Weiss",
                "J. De Wit"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.421 Physical Principles of Remote Sensing"
        ],
        [
            "prerec",
            "Subject meets with 12.621"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=8.02|8.021|8.022\" onclick=\"return showCourse(this, '8.02|8.021|8.022');\">Physics II (GIR)</a> and <a href=\"/search/?P=6.100A\" title=\"6.100A\" class=\"bubblelink code\" onclick=\"return showCourse(this, '6.100A');\">6.100A</a> "
            ]
        ],
        [
            "desc",
            "Introduction to the physics of remote sensing with applications to the study of the Earth, Moon, planets and other solar system bodies, as well as to emerging fields, such as autonomous navigation. Includes the principles of optical, thermal, radar and lidar remote sensing. Covers fundamental properties of electromagnetic waves; principles of electromagnetic scattering from real and idealized materials, including various types of surfaces and vegetation; interaction of electromagnetic radiation with the atmosphere; and thermal and microwave emission from various media. Discusses past, present, and future remote sensing platforms along with the fundamentals of orbital mechanics and data processing tools and methods. Assignments require students to write simple computer programs and plot mathematical functions. Students taking graduate version complete different assignments."
        ],
        [
            "inst",
            [
                "B. Minchew"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.422 Planetary Atmospheres"
        ],
        [
            "prerec",
            "Subject meets with 12.622"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=12.003\" title=\"12.003\" class=\"bubblelink code\" onclick=\"return showCourse(this, '12.003');\">12.003</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Provides a basic understanding of the physics and chemistry of planetary atmospheres. Explores the formation and evolution of atmospheres, their structure and dynamics, and what is known about their chemical composition. Pays particular attention to their energy balance. Also presents the current state of understanding of exoplanet atmospheres. Students taking graduate version complete an additional research project."
        ],
        [
            "inst",
            [
                "J. de Wit"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.425[J] Extrasolar Planets: Physics and Detection Techniques"
        ],
        [
            "prerec",
            "Same subject as 8.290[J]\nSubject meets with 12.625"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=8.03\" title=\"8.03\" class=\"bubblelink code\" onclick=\"return showCourse(this, '8.03');\">8.03</a> and <a href=\"/search/?P=18.03\" title=\"18.03\" class=\"bubblelink code\" onclick=\"return showCourse(this, '18.03');\">18.03</a> "
            ]
        ],
        [
            "desc",
            "Presents basic principles of planet atmospheres and interiors applied to the study of extrasolar planets. Focuses on fundamental physical processes related to observable extrasolar planet properties. Provides a quantitative overview of detection techniques. Introduction to the feasibility of the search for Earth-like planets, biosignatures and habitable conditions on extrasolar planets. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "S. Seager"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.43[J] Space Systems Engineering"
        ],
        [
            "prerec",
            "Same subject as 16.83[J]"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "See description under subject 16.83[J]."
        ],
        [
            "inst",
            [
                "K. Cahoy"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.431[J] Space Systems Development"
        ],
        [
            "prerec",
            "Same subject as 16.831[J]"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "See description under subject 16.831[J]."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.UAR[J] Climate and Sustainability Undergraduate Advanced Research"
        ],
        [
            "prerec",
            "Same subject as 1.UAR[J], 3.UAR[J], 5.UAR[J], 11.UAR[J], 15.UAR[J], 22.UAR[J]"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "See description under subject 1.UAR[J]. Application required; consult MCSC website for more information."
        ],
        [
            "inst",
            [
                "D. Plata",
                "E. Olivetti"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.UR Undergraduate Research"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Undergraduate research opportunities in Earth, Atmospheric, and Planetary Sciences."
        ],
        [
            "inst",
            [
                "Consult Department UROP Coordinator"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.URG Undergraduate Research"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Undergraduate research opportunities in Earth, Atmospheric, and Planetary Sciences."
        ],
        [
            "inst",
            [
                "Consult Department UROP Coordinator"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.IND Independent Study"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Independent reading, laboratory, or fieldwork in Earth, Atmospheric, and Planetary Sciences. To be arranged by student and an appropriate EAPS faculty member. A written report may be required at the discretion of the advisor. Units arranged should reflect the project requirements."
        ],
        [
            "inst",
            [
                "Consult EAPS Education Office"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.TIP Thesis Preparation"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Definition of and early-stage work on the thesis project. Students develop a written research proposal and begin writing the supporting text of the thesis concurrent with conducting research for the thesis project. Supervision of the writing continues into the spring term which concludes with an oral presentation of the research results."
        ],
        [
            "inst",
            [
                "J. Abbott"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.THU Undergraduate Thesis"
        ],
        [
            "prerec",
            "Prereq: 12.TIP"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Program of research leading to the writing of a thesis; to be arranged by the student and an appropriate MIT faculty member."
        ],
        [
            "inst",
            [
                "EAPS Faculty"
            ]
        ]
    ],
    [
        "head",
        "Graduate Subjects"
    ],
    [
        "block",
        [
            "title",
            "12.44 Practical Experience"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Summer)"
            ]
        ],
        [
            "desc",
            "For Course 12 students participating in off-campus professional experiences related to their research. Before registering for this subject, students must have an offer from a company or organization, must identify an EAPS supervisor, and must receive prior approval from their advisor. Upon completion of the experience, student must submit a letter from the company or organization describing the what the student accomplished, along with a substantive final report from the student approved by the EAPS supervisor. Consult departmental academic office."
        ],
        [
            "inst",
            [
                "EAPS Faculty"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.444 MatLab, Statistics, Regression, Signal Processing"
        ],
        [
            "prerec",
            "Subject meets with 12.012"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=18.06\" title=\"18.06\" class=\"bubblelink code\" onclick=\"return showCourse(this, '18.06');\">18.06</a> "
            ]
        ],
        [
            "desc",
            "Introduces the basic tools needed for data analysis and interpretation in the Geosciences, as well as other sciences. Composed of four modules, targeted at introducing students to the basic concepts and applications in each module. MatLab: Principles and practice in its uses, script and function modules, basic approaches to solving problems. Statistics: Correlation, means, dispersion, precision, accuracy, distributions, central limit theorem, skewness, probability, Chi-Square, Gaussian and other common distributions used in hypothesis testing. Regression: Random and grid search methods, basic least squares and algorithms applicable to regression, inversion and parameter estimation. Signal Processing: Analog and digital signals, Z-transform, Fourier series, fast Fourier transforms, spectral analysis leakage and bias, digital filtering. Students taking the graduate version complete different assignments."
        ],
        [
            "inst",
            [
                "F. D. Morgan",
                "T. A. Herring",
                "S. Ravela"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.446 Teaching Experience in EAPS"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Recognizes the educational value derived from satisfactory performance of assigned duties as a Teaching Assistant. Laboratory, field, recitation, or classroom teaching under supervision of a faculty member. Credit for this subject may not be used for any degree granted by Course 12. Total enrollment limited by availability of suitable teaching assignments."
        ],
        [
            "inst",
            [
                "EAPS Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.THG Graduate Thesis"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Program of research leading to the writing of an SM, PhD, or ScD thesis; to be arranged by the student and an appropriate MIT faculty member."
        ],
        [
            "inst",
            [
                "Consult Department Headquarters"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.450 Seminar in Geology and Geochemistry"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Seminar on topics of current interest in geology and geochemistry. Required background preparation for students taking pre-doctoral general examinations in these subjects."
        ],
        [
            "inst",
            [
                "Geology and Geochemistry Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.451 Seminar in Regional Tectonics"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall, Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Applies techniques of tectonic synthesis to study the roles of particular orogenic belts in global plate tectonics. Treats different applications in different terms, so that the subject may be taken repeatedly to learn the range of orogenic responses to temporal and spatial variations of activity at plate boundaries."
        ],
        [
            "inst",
            [
                "B. C. Burchfiel",
                "L. H. Royden"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.456 Seminar in Rock Mechanics"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Discussion of current research or advanced topics in continental tectonics, rock mechanics, or experimental structural geology."
        ],
        [
            "inst",
            [
                "EAPS Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.458 Molecular Biogeochemistry"
        ],
        [
            "prerec",
            "Subject meets with 12.158"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Covers all aspects of molecular biosignatures, such as their pathways of lipid biosynthesis, the distribution patterns of lipid biosynthetic pathways with regard to phylogeny and physiology, isotopic contents, occurrence in modern organisms and environments, diagenetic pathways, analytical techniques and the occurrence of molecular fossils through the geological record. Students analyze in depth the recent literature on chemical fossils. Lectures provide background on the subject matter. Basic knowledge of organic chemistry required. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "R. Summons"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.463 Geomorphology"
        ],
        [
            "prerec",
            "Subject meets with 12.163"
        ],
        [
            "terms",
            [
                "Prereq: (<a href=\"/search/?P=18.01|18.01A|18.014\" onclick=\"return showCourse(this, '18.01|18.01A|18.014');\">Calculus I (GIR)</a>, <a href=\"/search/?P=8.01|8.01L|8.011|8.012\" onclick=\"return showCourse(this, '8.01|8.01L|8.011|8.012');\">Physics I (GIR)</a>, and <a href=\"/search/?P=12.001\" title=\"12.001\" class=\"bubblelink code\" onclick=\"return showCourse(this, '12.001');\">12.001</a>) or permission of instructor "
            ]
        ],
        [
            "desc",
            "Quantitative examination of processes that shape Earth's surface. Introduction to fluvial, hillslope, and glacial mechanics. Essentials of weathering, soil formation, runoff, erosion, slope stability, sediment transport, and river morphology. Landscape evolution in response to climatic and tectonic forcing. Application of terrestrial theory to planetary surfaces. Additional instruction in geographic information systems (GIS) and remote sensing analysis, field measurement techniques, and numerical modeling of surface processes. Students taking the graduate version complete different assignments."
        ],
        [
            "inst",
            [
                "T. Perron"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.465A Sedimentary Environments"
        ],
        [
            "prerec",
            "Subject meets with 12.110A"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Covers the basic concepts of sedimentation from the properties of individual grains to large-scale basin analysis. Lectures cover sediment textures and composition, fluid flow and sediment transport, and formation of sedimentary structures. Depositional models, for both modern and ancient environments are a major component and are studied in detail with an eye toward interpretation of depositional processes and reconstructing paleoenvironments from the rock record. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "K. Bergmann"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.465B Sedimentology in the Field"
        ],
        [
            "prerec",
            "Subject meets with 12.110B"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=12.456\" title=\"12.456\" class=\"bubblelink code\" onclick=\"return showCourse(this, '12.456');\">12.456</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Examines the fundamentals of sedimentary deposits and geological reasoning through first hand fieldwork. Students practice methods of modern geological field study off-campus during a required trip over spring break making field observations, measuring stratigraphic sections and making a sedimentological map. Relevant topics introduced are map and figure making in ArcGIS and Adobe Illustrator and sedimentary petrology. Culminates in an oral and written report built around data gathered in the field. Field sites and intervals of geologic time studied rotate annually and include Precambrian, Phanerozoic and Modern depositional environments. May be taken multiple times for credit. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "K. Bergmann"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.467 Seminar in Geomorphology"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Spring)"
            ]
        ],
        [
            "desc",
            "Discussion of current research or advanced topics in landscape evolution, surface hydrology, mechanics of sediment transport, basin analysis, or experimental geomorphology. Advanced instruction in process geomorphology."
        ],
        [
            "inst",
            [
                "Perron",
                "T"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.470 Essentials of Geology"
        ],
        [
            "prerec",
            "Subject meets with 12.170"
        ],
        [
            "terms",
            [
                "Prereq: (<a href=\"/search/?P=18.02|18.02A|18.022|18.024\" onclick=\"return showCourse(this, '18.02|18.02A|18.022|18.024');\">Calculus II (GIR)</a> and <a href=\"/search/?P=8.02|8.021|8.022\" onclick=\"return showCourse(this, '8.02|8.021|8.022');\">Physics II (GIR)</a>) or permission of instructor "
            ]
        ],
        [
            "desc",
            "Geology of planetary interiors and surfaces, including plate tectonics, as a unifying theory of terrestrial geology, surface processes, and the Earth's interior. Igneous, metamorphic, and sedimentary processes associated with tectonic settings and the typical rock suites created. Mineral and rock identification. Causes of compositional differences on many scales: mineral grains, rocks, regions of the Earth, different planets. Conditions required for melting and melting processes. Rock structure and field techniques. Earth history. Treatment of these topics includes discussions of the geochemical, petrologic, geochronological, experimental, or field techniques used to investigate them; the limitations of current geological techniques and geological controversies; and great geological expeditions, experiments, and studies from the past, their premises, and their results. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "EAPS Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.471 Essentials of Geobiology"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Fall)"
            ]
        ],
        [
            "desc",
            "Introduces basic concepts of microbial structure, growth, energetics, molecular biology, and biochemistry. Presents examples of microbial interactions with environments throughout Earth's history as well as current topics in astrobiology. Includes lectures, discussions of literature, and a field trip. Lab focuses on student-designed projects that involve cultivation, modeling, or sample analyses. Intended for students whose background is not in biology, but who want to learn more about the contribution of microbes to geochemistry and planetary evolution."
        ],
        [
            "inst",
            [
                "T. Bosak"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.473 Paleomagnetism and Planetary Magnetism"
        ],
        [
            "prerec",
            "Prereq: (12.002 and 18.03) or permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: G (Fall)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Introduces the study of natural remanent magnetization and the generation of planetary magnetic fields. Topics include paleomagnetism, rock magnetism, geomagnetism, magnetostratigraphy, paleomagnetic measurement techniques, polar wander and continental drift, biomagnetism, dynamo theory, and the history and evolution of magnetic fields on the Earth and planets."
        ],
        [
            "inst",
            [
                "B. P. Weiss"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.474 Origin and Evolution of the Earth's Crust"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Broad overview of the origin and evolution of Earth's crust and mantle with emphasis on the study of the Precambrian rock record. Topics include: processes of crustal growth, stabilization, and reactivation; evaluation of secular change; and use of radiogenic isotopes in geochronology and as tracers of crust forming processes."
        ],
        [
            "inst",
            [
                "O. Jagoutz"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.475 Plate Tectonics and Continental Deformation"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "First half covers basic elements of plate tectonics, including sea floor spreading, magnetic anomalies, and subduction zone. Second half covers implications of plate tectonics for continental processes, including continental rifting, continental collision, and mountain building. Emphasis will be on correlating plate tectonic and continental processes using specific examples from around the world."
        ],
        [
            "inst",
            [
                "L. H. Royden"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.476 Radiogenic Isotope Geology"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Applications of the variations in the relative abundance of radiogenic isotopes to problems of petrology, geochemistry, and tectonics. Topics: geochronology; isotopic evolution of Earth's crust and mantle; petrogenesis; and analytical techniques."
        ],
        [
            "inst",
            [
                "EAPS Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.477 Astrobiology, Origins and Early Evolution of Life"
        ],
        [
            "prerec",
            "Subject meets with 12.177"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Provides an understanding of major areas of research into the problem of the origin of life on the early Earth from an astrobiological perspective. Topics include the timing, setting and conditions for the origin of life on the Hadean Earth; roles of planetary and extra-planetary processes; defining life; prebiotic chemistry; origins of nucleic acids and peptides; evolution of cellularity, replication, metabolism, and translation; establishment of the genetic code; biogenesis vs. ecogenesis; the nature of the last common ancestor of life; conceptualizing the \"tree of life;\" and the early evolution of the ancestors of bacteria, archaeal, and eukaryal lineages. Students taking graduate version complete an extra project."
        ],
        [
            "inst",
            [
                "G. Fournier"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.478 The Phylogenomic Planetary Record"
        ],
        [
            "prerec",
            "Subject meets with 12.178"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Introduces the tools of sequence-based phylogenetic analysis and molecular evolution in the context of studying events in Earth's deep past that have been preserved by genomes. Topics include basic concepts of cladistics, phylogeny and sequence evolution, construction of phylogenetic trees of genes and microbial lineages, molecular clocks, dating, and ancestral sequence reconstruction. Special attention to the evolutionary history of microbial metabolisms and their relationship to global biogeochemical cycles across Earth's history. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "G. Fournier"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.480 Thermodynamics for Geoscientists"
        ],
        [
            "prerec",
            "Prereq: 3.046 or 5.60"
        ],
        [
            "terms",
            [
                "G (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Principles of thermodynamics are used to infer the physical conditions of formation and modification of igneous and metamorphic rocks. Includes phase equilibria of homogeneous and heterogeneous systems and thermodynamic modelling of non-ideal crystalline solutions. Surveys the processes that lead to the formation of metamorphic and igneous rocks in the major tectonic environments in the Earth's crust and mantle."
        ],
        [
            "inst",
            [
                "T. L. Grove"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.481 Advanced Field Geology I"
        ],
        [
            "prerec",
            "Prereq: 12.113"
        ],
        [
            "terms",
            [
                "G (Fall)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Introduction to the problems to be investigated in 12.482, as well as the regional setting and local geology of the field area. Various special techniques may be introduced and preparatory investigations may be conducted that are specific to the area to be studied in 12.482."
        ],
        [
            "inst",
            [
                "O. Jagoutz"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.482 Advanced Field Geology II"
        ],
        [
            "prerec",
            "Prereq: 12.481"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: G (IAP)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "In January, a geological and geomorphological study of a selected field area is conducted during a two-week excursion. Exercises include geological and geomorphological mapping on topographic and photographic base maps of a wide variety of bedrock and surficial rocks. Where feasible, geochemical and geophysical field measurements are correlated with geology. Meets with 12.115 when offered concurrently."
        ],
        [
            "inst",
            [
                "O. E. Jagoutz"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.487A Field Geobiology I"
        ],
        [
            "prerec",
            "Subject meets with 12.117A"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Examines basic biological processes that operate in sediments. Lectures cover biological, physical and chemical processes that influence the formation and stabilization of sediments, including biomineralization, weathering, erosion, the formation of sedimentary structures and interactions with sediments, flow, and the cycles of nutrients. Lab covers analytical methods used to examine microbial processes, bioinformatic methods used to analyze microbial communities, and techniques used to analyze sediment grain sizes and chemistry. Readings and discussions provide preparation for the 12.487B field trip to a modern sedimentary environment. Enables students to interpret processes in modern sedimentary environments, reconstruct similar processes in the rock record, collect appropriate samples in the field, and analyze microbiological data. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "T. Bosak"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.487B Field Geobiology II"
        ],
        [
            "prerec",
            "Subject meets with 12.117B"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Teaches fundamentals of field observations and reasoning in geobiology/sedimentology during a required trip to a modern sedimentary environment over spring break, followed by laboratory analyses of collected samples. Students make observations, develop hypotheses, collect samples required to test their hypotheses and interact with lecturers and students investigating the sedimentology of the site. Upon return to MIT, students work on field samples to characterize the sediments, use the preliminary data to develop an understanding of the field site, and write research reports. Students taking graduate version write proposals that present a research question based on the field observations and subsequent analyses. Meets with 12.110B and 12.465B when those subjects examine modern sedimentary environments."
        ],
        [
            "inst",
            [
                "T. Bosak"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.493[J] Microbial Genetics and Evolution"
        ],
        [
            "prerec",
            "Same subject as 1.87[J], 7.493[J], 20.446[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=7.03\" title=\"7.03\" class=\"bubblelink code\" onclick=\"return showCourse(this, '7.03');\">7.03</a>, <a href=\"/search/?P=7.05\" title=\"7.05\" class=\"bubblelink code\" onclick=\"return showCourse(this, '7.05');\">7.05</a>, or permission of instructor "
            ]
        ],
        [
            "desc",
            "See description under subject 7.493[J]."
        ],
        [
            "inst",
            [
                "A. D. Grossman",
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.494 Geochemistry of Natural Waters"
        ],
        [
            "prerec",
            "Subject meets with 12.104"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=18.02|18.02A|18.022|18.024\" onclick=\"return showCourse(this, '18.02|18.02A|18.022|18.024');\">Calculus II (GIR)</a> "
            ]
        ],
        [
            "desc",
            "Equips students with the fundamental skills to identify major controls on the chemistry of waters on the Earth.  Students examine key concepts, theories and practical tools (e.g., pH, Eh, alkalinity, surface charge, speciation, and carbonate equilibrium) and apply them as tools to understand and make predictions for the biogeochemical cycles of the Earth systems.  Graduate students complete additional assignments."
        ],
        [
            "inst",
            [
                "S. Ono"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.501 Essentials of Global Geophysics"
        ],
        [
            "prerec",
            "Subject meets with 12.201"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=8.02|8.021|8.022\" onclick=\"return showCourse(this, '8.02|8.021|8.022');\">Physics II (GIR)</a> and <a href=\"/search/?P=18.03\" title=\"18.03\" class=\"bubblelink code\" onclick=\"return showCourse(this, '18.03');\">18.03</a> "
            ]
        ],
        [
            "desc",
            "Overview of basic topics in solid-earth geophysics, such as the Earth's rotation, gravity and magnetic field, seismology, and thermal structure. Formulation of physical principles presented in three one-hour lectures per week. Current applications discussed in an additional one-hour tutorial each week. Students taking graduate version complete different assignments."
        ],
        [
            "inst",
            [
                "R. van der Hilst"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.502 Flow, Deformation, and Fracture in Earth and Other Terrestrial Bodies"
        ],
        [
            "prerec",
            "Subject meets with 12.202"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=18.02|18.02A|18.022|18.024\" onclick=\"return showCourse(this, '18.02|18.02A|18.022|18.024');\">Calculus II (GIR)</a> and <a href=\"/search/?P=8.01|8.01L|8.011|8.012\" onclick=\"return showCourse(this, '8.01|8.01L|8.011|8.012');\">Physics I (GIR)</a> "
            ]
        ],
        [
            "desc",
            "Covers fundamentals of deformation and fracture of solids and the flow of viscous fluids. Explores spatial scales from molecular to planetary, and time scales from fractions of a second to millions of years, to understand how and why natural materials on Earth and other terrestrial bodies respond to applied forces. Fundamental concepts include the principles of continuum mechanics, tensor representation of physical properties, forces, tractions, stresses, strain theory, elasticity, contact problems, fracture and friction, and viscous flow and rheological models (plasticity, viscosity, viscoelasticity, elasto-plasticity). Students gather, analyze and interpret data using existing theoretical models. Includes a significant laboratory component that provides practical experience with experimental measurements and tests students' acquired theoretical knowledge. Students taking graduate version complete different assignments."
        ],
        [
            "inst",
            [
                "B. Minchew",
                "M. Pec"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.503 Mechanics of Earth"
        ],
        [
            "prerec",
            "Subject meets with 12.203"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=18.02|18.02A|18.022|18.024\" onclick=\"return showCourse(this, '18.02|18.02A|18.022|18.024');\">Calculus II (GIR)</a> and <a href=\"/search/?P=8.01|8.01L|8.011|8.012\" onclick=\"return showCourse(this, '8.01|8.01L|8.011|8.012');\">Physics I (GIR)</a> "
            ]
        ],
        [
            "desc",
            "Covers topics in the deformation and fracture of solids and the flow of viscous fluids. Explores spatial scales from molecular to planetary, and time scales from fractions of a second to millions of years, to understand how and why natural materials on Earth and other terrestrial bodies respond to applied forces. Introduces anelasticity, granular mechanics, poroelasticity, rate-and-state friction, transport properties of Earth materials (Darcy's law, Fick's law), brittle-ductile transitions, creep of polycrystalline materials, stored energy and dissipation, and convection. Prepares students to gather, analyze and interpret data using existing theoretical models. Through a significant laboratory component, students obtain practical experience with experimental measurements and test their acquired theoretical knowledge. Students taking graduate version complete different assignments."
        ],
        [
            "inst",
            [
                "B. Minchew",
                "M. Pec"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.507 Essentials of Field Geophysics"
        ],
        [
            "prerec",
            "Subject meets with 12.214"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=8.02|8.021|8.022\" onclick=\"return showCourse(this, '8.02|8.021|8.022');\">Physics II (GIR)</a>, <a href=\"/search/?P=6.100A\" title=\"6.100A\" class=\"bubblelink code\" onclick=\"return showCourse(this, '6.100A');\">6.100A</a>, and <a href=\"/search/?P=18.03\" title=\"18.03\" class=\"bubblelink code\" onclick=\"return showCourse(this, '18.03');\">18.03</a> "
            ]
        ],
        [
            "desc",
            "Introduces students to the practical field application of various geophysical methods to studying Earth's to all aspects of near-surface and prepares students to undertake fieldwork that uses these methods. Methods covered include but are not limited to measuring seismic waves, gravity, precise positions (commonly referred to as GPS but formally known as GNSS), and topography using drones. Lab time involves local fieldwork to gain experience with the methods being taught. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "B. Minchew",
                "W. Frank"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.510 Introduction to Seismology"
        ],
        [
            "prerec",
            "Prereq: 18.075 or 18.085"
        ],
        [
            "terms",
            [
                "G (Spring)"
            ]
        ],
        [
            "desc",
            "A basic study in seismology and the utilization of seismic waves for the study of Earth's interior. Introduces techniques necessary for understanding of elastic wave propagation in stratified media and for calculation of synthetic seismograms (WKBJ and mode summation). Ray theory; interpretation of travel times. (e.g., tomography); surface wave dispersion in layered media; Earth's free oscillations; and seismicity, (earthquake locations, magnitude, moment, and source properties)."
        ],
        [
            "inst",
            [
                "R. van der Hilst",
                "W. Frank"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.511 Field Geophysics"
        ],
        [
            "prerec",
            "Subject meets with 12.211"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=12.507\" title=\"12.507\" class=\"bubblelink code\" onclick=\"return showCourse(this, '12.507');\">12.507</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Covers practical methods of modern geophysics, including the global positioning system (GPS), gravity, and magnetics. Field work is conducted in western US and includes intensive 10-day field exercise. Focuses on measurement techniques and their interpretation. Introduces the science of gravity, magnetics, and the GPS. Measures crustal structure, fault motions, tectonic deformations, and the local gravity and magnetic fields. Students perform high-precision measurements and participate in data analysis. Emphasizes principles of geophysical data collection and the relevance of these data for tectonic faulting, crustal structure, and the dynamics of the earthquake cycle. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "W. Frank",
                "B. Minchew",
                "B. H. Hager",
                "T. A. Herring"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.512 Field Geophysics Analysis"
        ],
        [
            "prerec",
            "Prereq: 12.511"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: G (Spring)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Focuses on in-depth data analysis and development of skills needed to report results both in writing and orally. Students use data collected in 12.511 to develop written and oral reports of the results, with each student focusing on a different area. For example, students can develop the geophysical modeling or synthesis of the results into other studies in the area. The final written and oral reports are combined into a comprehensive report and presentation of the field camp and its results. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "T. A. Herring",
                "B. H. Hager"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.515 Data and Models"
        ],
        [
            "prerec",
            "Prereq: 18.075 or 18.085"
        ],
        [
            "terms",
            [
                "G (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Surveys a number of methods of inverting data to obtain model parameter estimates. Topics include review of matrix theory and statistics, random and grid-search methods, linear and non-linear least squares, maximum-likelihood estimation, ridge regression, stochastic inversion, sequential estimation, singular value decomposition, solution of large systems, genetic and simulated annealing inversion, regularization, parameter error estimates, and solution uniqueness and resolution. Computer laboratory and algorithm development."
        ],
        [
            "inst",
            [
                "F. D. Morgan"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.521 Computational Geophysical Modeling"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Fall)"
            ]
        ],
        [
            "desc",
            "Introduces theory, design, and practical methods of computational modeling in geodynamics and geophysical fluid dynamics. Covers the most effective and widely used numerical modeling approaches (e.g., boundary element, finite difference, finite element) and emphasizes problem-solving skills through illustrative examples of heat and mass transfer in the mantle and the ocean. Students acquire experience with various numerical methods through regularly assigned computational exercises and a term-long modeling project of each student's choice."
        ],
        [
            "inst",
            [
                "J. Lin",
                "O. Marchal",
                "M. Behn"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.522 Geological Fluid Mechanics"
        ],
        [
            "prerec",
            "Prereq: 8.03 and (18.075 or 18.085)"
        ],
        [
            "terms",
            [
                "G (Fall)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Treats heat transfer and fluid mechanics in the Earth, low Reynolds number flows, convection instability, double diffusion, Non-Newtonian flows, flow in porous media, and the interaction of flows with accreting and deforming boundaries. Applications include: the flow under plates, postglacial rebound, diapirism, magma dynamics, and the mantle convection problem."
        ],
        [
            "inst",
            [
                "J. A. Whitehead (WHOI)"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.525 Mechanisms of Faulting and Earthquakes"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Fall)"
            ]
        ],
        [
            "desc",
            "Explores the fundamental mechanics of faulting and earthquakes from four related perspectives: seismology, geodesy, geodynamics, and rheology. Topics to be covered include (1) the physical processes that control the rheology of faults, including friction and fracture, (2) how these rheological processes are manifest in faulting and earthquakes in the earth from a geodynamics perspective, and (3) how the mechanics of faulting and earthquakes are constrained by seismological and geodetic observations. Both continental and oceanic examples of faulting and earthquakes will be featured."
        ],
        [
            "inst",
            [
                "J. McGuire",
                "G. Prieto"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.540 Principles of Global Positioning System"
        ],
        [
            "prerec",
            "Prereq: Calculus II (GIR), Physics I (GIR), and 18.06"
        ],
        [
            "terms",
            [
                "G (Spring)"
            ]
        ],
        [
            "desc",
            "The principles and applications of the Global Positioning System (US), GLONASS (Russia), Galileo (EU) and Beidou (China), known as Global Navigation Satellite Systems  (GNSS), along with other space geodetic systems, including very-long-baseline interferometry (VLBI), satellite laser ranging (SLR), and Interferometric Synthetics Aperture Radar (InSAR). Topics covered include CDMA and FDMA encoding used by these systems to allow measurements of pseudo-range and carrier phase which allow millimeter accuracy positioning, models and analysis methods required for millimeter accuracy positioning. Other topics include: satellite orbit modeling, atmospheric refraction modeling, estimation techniques (including Kalman filtering), statistical and spectral analysis of data.  Application areas include tectonic studies of Earth deformation, meteorology, space weather, and millimeter accuracy tracking of moving objects."
        ],
        [
            "inst",
            [
                "T. A. Herring"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.552 Advanced Seismology: Theory and Applications of Seismic Imaging"
        ],
        [
            "prerec",
            "Prereq: 12.510"
        ],
        [
            "terms",
            [
                "G (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Introduces fundamental principles of seismic imaging used in both exploration and solid earth applications. Topics include ray theoretical approaches, scattering theory, and seismic waveform modeling. Through lectures, projects and student-led discussions of journal articles, the class covers the whole process of seismic imaging, from data preprocessing to model generation and geological interpretation of the results."
        ],
        [
            "inst",
            [
                "EAPS Faculty"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.560-12.561 Advanced Seminar in Exploration Geophysics"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall, IAP, Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Advanced seminar focusing on areas of current interest in exploration geophysics and seismology. 12.560 is letter-graded."
        ],
        [
            "inst",
            [
                "Geophysics Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.570 Topical Issues in Global Geophysics"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Series of formal lectures and seminars with the specific content varying by term to reflect current issues in research. Meets jointly with relevant Harvard course."
        ],
        [
            "inst",
            [
                "R. D. van der Hilst"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.571 Seminar in Geophysics"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: G (Fall, Spring)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Problems of current interest in geophysics; subject matter varying from term to term."
        ],
        [
            "inst",
            [
                "Geophysics Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.586 Modeling Environmental Complexity"
        ],
        [
            "prerec",
            "Subject meets with 12.086"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=18.03\" title=\"18.03\" class=\"bubblelink code\" onclick=\"return showCourse(this, '18.03');\">18.03</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Introduction to mathematical and physical models of environmental processes. Emphasis on the development of macroscopic continuum or statistical descriptions of complex microscopic dynamics. Problems of interest include: random walks and statistical geometry of landscapes; percolation theory and transport in disordered media; fractals, scaling, and universality; ecological dynamics and the structure of ecosystems, food webs, and other natural networks; kinetics of biogeochemical cycles. Appropriate for advanced undergraduates. Beginning graduate students are encouraged to register for 12.586. Students taking the graduate version complete different assignments."
        ],
        [
            "inst",
            [
                "D. H. Rothman"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.601 Essentials of Planetary Science"
        ],
        [
            "prerec",
            "Subject meets with 12.420"
        ],
        [
            "terms",
            [
                "Prereq: (<a href=\"/search/?P=8.03\" title=\"8.03\" class=\"bubblelink code\" onclick=\"return showCourse(this, '8.03');\">8.03</a>, <a href=\"/search/?P=12.002\" title=\"12.002\" class=\"bubblelink code\" onclick=\"return showCourse(this, '12.002');\">12.002</a>, and <a href=\"/search/?P=18.03\" title=\"18.03\" class=\"bubblelink code\" onclick=\"return showCourse(this, '18.03');\">18.03</a>) or permission of instructor "
            ]
        ],
        [
            "desc",
            "Reviews fundamental physical concepts pertaining to the study of the solar system, and highlights recent spacecraft results. Topics include: meteorites, orbital dynamics, asteroids, impact craters, surfaces, atmospheres, atmospheric dynamics, interiors, magnetospheres, rings, comets, formation of the solar system."
        ],
        [
            "inst",
            [
                "B. P. Weiss"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.603 Solar System Dynamics"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: G (Spring)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Studies the dynamics of the solar system and its major subsystems, and the dynamics of exoplanets, with a modern emphasis on the qualitative structure of phase space. Topics may include rotational dynamics, spin-orbit coupling, Cassini states, and orbital dynamics, resonances, and Kozai oscillations, tidal evolution and tidal heating."
        ],
        [
            "inst",
            [
                "J. Wisdom"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.612 Meteorites, Cosmochemistry, and Solar System Formation (New)"
        ],
        [
            "prerec",
            "Subject meets with 12.412"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "A broad introduction to cosmochemistry, the study of the solar system formation from a geochemical perspective. Examines how the current meteorite records are used to gain information on the processes that happened in the early solar system. Topics include the origin of elements and isotopes, chemical fractionations of them during different processes, meteorite records, pre-solar grains, cosmochemical models for the solar system formation, chronology of planetary bodies from radioactive isotopes, and analytical techniques commonly used in cosmochemistry. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "N. X. Nie"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.620[J] Classical Mechanics: A Computational Approach"
        ],
        [
            "prerec",
            "Same subject as 6.5160[J], 8.351[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=8.01|8.01L|8.011|8.012\" onclick=\"return showCourse(this, '8.01|8.01L|8.011|8.012');\">Physics I (GIR)</a>, <a href=\"/search/?P=18.03\" title=\"18.03\" class=\"bubblelink code\" onclick=\"return showCourse(this, '18.03');\">18.03</a>, and permission of instructor "
            ]
        ],
        [
            "desc",
            "Classical mechanics in a computational framework, Lagrangian formulation, action, variational principles, and Hamilton's principle. Conserved quantities, Hamiltonian formulation, surfaces of section, chaos, and Liouville's theorem. Poincaré integral invariants, Poincaré-Birkhoff and KAM theorems. Invariant curves and cantori. Nonlinear resonances, resonance overlap and transition to chaos. Symplectic integration. Adiabatic invariants. Applications to simple physical systems and solar system dynamics. Extensive use of computation to capture methods, for simulation, and for symbolic analysis. Programming experience required."
        ],
        [
            "inst",
            [
                "J. Wisdom",
                "G. J. Sussman"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.621 Physical Principles of Remote Sensing"
        ],
        [
            "prerec",
            "Subject meets with 12.421"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=8.02|8.021|8.022\" onclick=\"return showCourse(this, '8.02|8.021|8.022');\">Physics II (GIR)</a> and <a href=\"/search/?P=6.100A\" title=\"6.100A\" class=\"bubblelink code\" onclick=\"return showCourse(this, '6.100A');\">6.100A</a> "
            ]
        ],
        [
            "desc",
            "Introduction to the physics of remote sensing with applications to the study of the Earth, Moon, planets and other solar system bodies, as well as to emerging fields, such as autonomous navigation. Includes the principles of optical, thermal, radar and lidar remote sensing. Covers fundamental properties of electromagnetic waves; principles of electromagnetic scattering from real and idealized materials, including various types of surfaces and vegetation; interaction of electromagnetic radiation with the atmosphere; and thermal and microwave emission from various media. Discusses past, present, and future remote sensing platforms along with the fundamentals of orbital mechanics and data processing tools and methods. Assignments require students to write simple computer programs and plot mathematical functions. Students taking graduate version complete different assignments."
        ],
        [
            "inst",
            [
                "B. Minchew"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.622 Planetary Atmospheres"
        ],
        [
            "prerec",
            "Subject meets with 12.422"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Provides a basic understanding of the physics and chemistry of planetary atmospheres. Explores the formation and evolution of atmospheres, their structure and dynamics, and what is known about their chemical composition. Pays particular attention to their energy balance. Also presents the current state of understanding of exoplanet atmospheres. Students taking graduate version complete an additional research project."
        ],
        [
            "inst",
            [
                "J. de Wit"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.625 Extrasolar Planets: Physics and Detection Techniques"
        ],
        [
            "prerec",
            "Subject meets with 8.290[J], 12.425[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=8.03\" title=\"8.03\" class=\"bubblelink code\" onclick=\"return showCourse(this, '8.03');\">8.03</a> and <a href=\"/search/?P=18.03\" title=\"18.03\" class=\"bubblelink code\" onclick=\"return showCourse(this, '18.03');\">18.03</a> "
            ]
        ],
        [
            "desc",
            "In-depth study of current topics in exoplanets, such as exoplanet transits, radial velocity curves, current survey missions, the mass-radius relation, and super Earths. Class activities consist of reading the current literature, problem sets, and a term project. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "S. Seager"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.650 Current Topics in Planetary Science"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Fall)"
            ]
        ],
        [
            "desc",
            "In-depth discussion of current and classic literature on selected topics in planetary science. Topics vary from year to year."
        ],
        [
            "inst",
            [
                "J. Wisdom"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.652 Current Topics in Planetary Science"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall, Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "In-depth discussion of current and classic literature on selected topics in the specialty areas of asteroids and the Pluto-Charon system. Topics vary from year to year."
        ],
        [
            "inst",
            [
                "R. P. Binzel"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.701 Classic Papers in Physical Oceanography"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Spring)"
            ]
        ],
        [
            "desc",
            "Provides a historical perspective on fundamental topics in oceanography by considering individual works which, when pieced together, contribute to the more cohesive description of how the ocean works. In class discussions, students consider various aspects of the work in question, including motivation, approach, and implications for the broader context. They also synthesize information and make oral presentations. Develops basic analytical and critical skills in paper reading and writing."
        ],
        [
            "inst",
            [
                "Y. Kwon (WHOI)"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.702 Elements of Modern Oceanography"
        ],
        [
            "prerec",
            "Subject meets with 12.372"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines a series of crosscutting topics that exemplify current directions in interdisciplinary oceanography. Focuses on current themes in oceanography, their interdisciplinary nature, and the role of ocean sciences in society. Introduces core concepts across the disciplines of biological, physical, and chemical oceanography as well as marine geology. Emphasizes the interdisciplinary aspects of these core concepts, the kinds of approaches and modes of thinking common to all of the disciplines, and the technological developments underpinning current advances. Students taking graduate version complete different assignments."
        ],
        [
            "inst",
            [
                "G. Lawson",
                "A. Kirincich (WHOI)"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.703 Presenting Scientific Research"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Fall)"
            ]
        ],
        [
            "desc",
            "Presenting scientific research geared toward a scientific audience. Each student gives one 30-minute talk, one AGU-style 15-minute talk, and one poster presentation. Students present their ongoing research and use the class as a forum to practice for upcoming talks in more formal settings. Abstracts are prepared for each presentation and discussed in class. Students provide comments, questions, encouragement, critiques, etc. on their peers' presentations."
        ],
        [
            "inst",
            [
                "S. Nielsen",
                "V. Le Roux (WHOI)"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.707 The History of Earth's Climate"
        ],
        [
            "prerec",
            "Subject meets with 12.377"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Studies the climate history of the Earth, from the formation of the early atmosphere and ocean to the present. Evaluates geochemical, sedimentological, and paleontological evidence for changes in ocean circulation, global temperatures, and atmospheric carbon dioxide levels. Covers theories and models of Phanerozoic climate change. Provides a long-term history of the global carbon cycle. Students taking graduate version complete different assignments."
        ],
        [
            "inst",
            [
                "D. McGee"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.708 Topics in Paleoceanography"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall)"
            ]
        ],
        [
            "desc",
            "Seminar focusing on areas of current interest in paleoceanography and paleoclimatology. Includes discussion of current and classic literature. Topics vary from year to year."
        ],
        [
            "inst",
            [
                "D. Oppo",
                "O. Marchal (WHOI)"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.710 Geological Oceanography"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall)"
            ]
        ],
        [
            "desc",
            "Provides a high level survey of a broad range of active science topics in Geological Oceanography. Presents background material that graduate students are expected to know in the disciplines of solid-earth geophysics, geochemistry, sedimentology and stratigraphy, coastal processes, and climate, including a representative set of canonical science papers, and builds on this material to give a sense of the current state of the science in these fields. Broad topics include the formation of the earth, petrogenesis, volcanism, plate tectonics, geodynamics, sedimentation in the oceans, coastal morphodynamics, paleo-oceanography, and climate. The interconnectedness of and feedbacks between processes discussed under these various topics is emphasized."
        ],
        [
            "inst",
            [
                "WHOI Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.712 Advanced Marine Seismology"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Fall)"
            ]
        ],
        [
            "desc",
            "Focuses on synthetic seismograms, ocean bottom refraction seismology, and multi-channel reflection seismology as applied to studies of the ocean sediments, crust, and lithosphere. Topics include: the wave equations for elastic/anelastic, isotropic/anisotropic, homogeneous/heterogeneous and fluid/solid media; ray theory and WKBJ approximations; the Sommerfeld/Weyl integrals, asymptotic analysis, and Lamb's problem for a fluid/solid interface; reflectivity and related methods; finite difference and finite element methods; and special topics of interest to the class. Extensive readings of geophysical and seismological literature."
        ],
        [
            "inst",
            [
                "R. Stephen (WHOI)"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.714 Computational Data Analysis"
        ],
        [
            "prerec",
            "Prereq: 18.03"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: G (Spring)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "An introduction to the theory and practice of analyzing discrete data such as are normally encountered in geophysics and geology. Emphasizes statistical aspects of data interpretation and the nonparametric discrete-time approach to spectral analysis. Topics include: elements of probability and statistics, statistical inference, robust and nonparametric statistics, the method of least squares, univariate and multivariate spectral analysis, digital filters, and aspects of multidimensional data analysis."
        ],
        [
            "inst",
            [
                "A. D. Chave",
                "T. A. Herring"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.715 Environmental Bioinformatics"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: G (Fall)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "An intensive introduction to computational skills and a survey of modern computational theory and approaches for the manipulation and analysis of genomic data in environmental and non-model systems. Designed to synthesize theory (both biological and computational) and programming to equip students with the ability to understand and carry out hypothesis testing with genomic data. Topics include: introduction to programming and biological algorithms; genomic and transcriptomic data; environmental metagenomics; intraspecific diversity; and best practices in data science and reproducibility."
        ],
        [
            "inst",
            [
                "WHOI Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.716 Essentials of Oceanic Petrology"
        ],
        [
            "prerec",
            "Prereq: 12.710 or permission of instructor"
        ],
        [
            "terms",
            [
                "G (Spring)"
            ]
        ],
        [
            "desc",
            "Qualitative interpretation and quantitative analysis of melting, melt transport, melt-rock reactions, igneous crustal accretion, metamorphism and hydrothermalism at oceanic spreading centers and subduction-related arcs applied to understanding the variations in the composition of the Earth's (oceanic) mantle and crust and accretionalry processes at mid-ocean ridges. Combines theoretical methods with field, petrographic, geochemical, and computational techniques. Topics vary from year to year."
        ],
        [
            "inst",
            [
                "H. Dick",
                "F. Klein (WHOI)"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.717 Coastal Geomorphology"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: G (Spring)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Explores mechanisms behind the formation and reshaping of coastal environments. Focuses on a process-based understanding of both the fluid dynamic and sediment transport aspects of coastal landforms, and, especially, the importance of feedbacks between the two. Investigates coastal evolution at various scales - from ripples to coastline formation - with an emphasis on the behavior of coastal environments over integrated timescales of days and years to centuries and millennia. Students investigate the effect of storms, sea-level rise, and interactions with biological and anthropogenic influences. Covers a broad array of coastal environments, including beaches, barrier islands, spits, inlets, tidal flats, deltas, rocky coasts, arctic shores, and carbonate atolls."
        ],
        [
            "inst",
            [
                "A. Ashton"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.718 Kinetics and Mass Transport"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Fall)"
            ]
        ],
        [
            "desc",
            "Offers a broad overview of various kinetic and transport processes in geology, including volume and grain boundary solid-state diffusion, defects in minerals, rates of mineral reaction and transformation, crystal nucleation and growth, advective transport in porous media and partially molten aggregates, and percolation theory. Emphasis on processes in crystalline rocks. Covers theoretical, phenomenological, and experimental constraints, with a consistent application to \"real-world\" settings and actual case histories."
        ],
        [
            "inst",
            [
                "M. Behn and G. Gaetani (WHOI)"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.739 Marine Microbiology and Biogeochemistry"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: G (Fall)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Integrates the fields of microbiology and biogeochemistry, and is centered on elucidating the linkages between microorganisms and geochemical processes in the oceans. Divided into modules that first lay the theoretical framework to familiarize students of diverse backgrounds (biologists, chemists, physical oceanographers). Next, introduces specific and general linkages between the topics and the major tools and techniques that have advanced their integrated study. Concludes with a synthesis module examining the role of microorganisms in the biogeochemical cycles of diverse ocean biomes"
        ],
        [
            "inst",
            [
                "A. Apprill",
                "S. Sievert (WHOI)"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.740 Paleoceanography"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: G (Spring)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Studies the basic principles of techniques for reconstructing the history of ocean climate from marine sediment cores, corals, ice cores, and other paleoclimate archives. Examines this data in the light of proposed climate change mechanisms. Micropaleontological, isotopic, geochemical, and mineralogical changes are used to infer changes in seawater composition, atmospheric chemistry, and climate. Observations are interpreted as consequences of changes in ocean temperature, circulation, and chemistry, and are used to evaluate theories proposed to account for glacial/interglacial cycles. Focuses on the past two million years, but major processes and events from the past 100 million years are also included."
        ],
        [
            "inst",
            [
                "E. A. Boyle"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.741 Marine Bioinorganic Chemistry"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Fall)"
            ]
        ],
        [
            "desc",
            "Provides an overview of trace element biogeochemistry and marine bioinorganic chemistry. Topics include controls on oceanic trace metal distributions; co-evolution of biological metal requirements and metal availability during early Earth history; chemical speciation and its influence on microbial bioavailability; applications of metal isotopes; roles of metalloenzymes and metal proteins in biogeochemical cycles; and biogeochemical applications of metagenomics, metaproteomics, and bioinformatics."
        ],
        [
            "inst",
            [
                "M. Saito"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.742 Marine Chemistry"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall)"
            ]
        ],
        [
            "desc",
            "An introduction to chemical oceanography. Reservoir models and residence time. Major ion composition of seawater. Inputs to and outputs from the ocean via rivers, the atmosphere, and the sea floor. Biogeochemical cycling within the oceanic water column and sediments, emphasizing the roles played by the formation, transport, and alteration of oceanic particles and the effects that these processes have on seawater composition. Cycles of carbon, nitrogen, phosphorus, oxygen, and sulfur. Uptake of anthropogenic carbon dioxide by the ocean. Material presented through lectures and student-led presentation and discussion of recent papers."
        ],
        [
            "inst",
            [
                "B. Van Mooy",
                "E. Kojawinski (WHOI)"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.743 Geochemistry of Marine Sediments"
        ],
        [
            "prerec",
            "Prereq: Chemistry (GIR) and 5.60"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Spring)"
            ]
        ],
        [
            "desc",
            "Focuses on processes that control the composition of sediments in coastal, shelf, and deep-sea environments and processes that define their roles in biogeochemical cycles. Topics include calculating chemical fluxes across the sediment-water interface; evaluating the sources and reactivity of carbonate, silicic, and detrital sediments; using pore water gradients to calculate diffusion, reaction, and flux rates; sediment dating; estimating accumulation rates; and using stable isotopes and natural-series radioisotopes. Covers evaluation of the links between sedimentary and water column processes; the effects of anthropogenic disturbances (e.g., eutrophication, acidification, warming) on sedimentary processes; and the role of sediments in global biogeochemical cycles. Introduces sampling techniques and mathematical modeling of sedimentary processes."
        ],
        [
            "inst",
            [
                "D. McCorkle",
                "W. Martin",
                "A. Wang",
                "M. Long (WHOI)"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.744 Marine Isotope Chemistry"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Spring)"
            ]
        ],
        [
            "desc",
            "Fundamentals of using isotopes to study processes and timescales for marine chemistry and geochemistry. Provides basic introduction to the nature, origins, and reasons for the distributions of isotopes in nature, then develops theory and approaches for radioactive dating methods. These are used to constrain the timing and nature of the geochemical evolution of the elements, solar system, earth, ocean, and atmosphere. Covers cosmogenic isotopes and their applications. Briefly discusses basics of mass spectrometry, followed by a closer inspection of the principles and applications of isotope fractionation. Introduces mass independent fractionation and clumped isotope methods. Explores applications of isotope methods to a number of water column processes, including particle scavenging, sedimentation, long term element budgets, redox processes, and air-sea exchange. Emphasizes quantitative methods and problem-solving. Includes problem sessions with development of problem solutions."
        ],
        [
            "inst",
            [
                "WHOI Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.746 Marine Organic Geochemistry"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: G (Spring)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Provides an understanding of the distribution of organic carbon (OC) in marine sediments from a global and molecular-level perspective. Surveys the mineralization and preservation of OC in the water column and within anoxic and oxic marine sediments. Topics include: OC composition, reactivity and budgets within, and fluxes through, major reservoirs; microbial recycling pathways for OC; models for OC degradation and preservation; role of anoxia in OC burial; relationships between dissolved and particulate (sinking and suspended) OC; methods for characterization of sedimentary organic matter; application of biological markers as tools in oceanography. Both structural and isotopic aspects are covered."
        ],
        [
            "inst",
            [
                "D. Repeta (WHOI)"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.747 Modeling, Data Analysis, and Numerical Techniques for Geochemistry"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Fall)"
            ]
        ],
        [
            "desc",
            "Emphasizes the basic skills needed for handling and assimilating data as well as the basic tool-set for numerical modeling. Uses MATLAB as its computation engine; begins with an introduction to MATLAB to ensure familiarity with software. Topics include: probability distributions, error propagation, least squares and regression techniques, principle component and factor analysis, objective mapping, Fourier and spectral analysis, numerical solutions to ODEs and PDEs, finite difference techniques, inverse models, and scientific visualization."
        ],
        [
            "inst",
            [
                "D. Nicholson (WHOI)"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.749 Solid Earth Geochemistry"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: G (Spring)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Integrates methods in mineralogy, petrology (both igneous and metamorphic), and trace element and isotope geochemistry to address scientific issues of the solid earth. Covers processes in the solar nebula, accretion, and early differentiation of the earth. Discusses topics in three representative geodynamic environments - mid-ocean ridges, subduction zones, and mantle plumes - with respect to physical framework and petrological/geochemical aspects."
        ],
        [
            "inst",
            [
                "N. Shimizu",
                "S. Nielsen",
                "G. Gaetani (WHOI)"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.751-12.759 Seminar in Oceanography at Woods Hole"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Spring)"
            ]
        ],
        [
            "desc",
            "Topics in marine geology and geophysics, physical, dynamical, and chemical oceanography. Content varies from term to term. 12.754, 12.755, and 12.756 are letter-graded."
        ],
        [
            "inst",
            [
                "WHOI Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.760-12.761 Seminar in Marine Geology and Geophysics at MIT"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall, Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Topics in marine geology and geophysics taught at MIT. Content varies from term to term. 12.760 is letter-graded."
        ],
        [
            "inst",
            [
                "Marine Geology and Geophysics Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.770-12.771 Seminar in Chemical Oceanography at MIT"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall, Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Topics in chemical oceanography taught at MIT. Content varies from term to term. 12.770 is letter-graded."
        ],
        [
            "inst",
            [
                "Chemical Oceanography Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.777 Field Oceanography"
        ],
        [
            "prerec",
            "Subject meets with 12.373"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Provides an introduction to the biogeochemistry of the ocean, and the field techniques and methods used in its study. Emphasizes biogeochemistry and the interrelated nature of elemental cycling, but also examines physical transport and air-sea gas exchange. Covers multiple aspects related to field instrumentation and measurements, including nutrients, oxygen, the carbon system, temperature, and salinity. Presents microbial analyses, such as metagenomics. Includes a mandatory spring break field trip aboard a research vessel; opportunities for funded travel available. Students work in groups to propose a project over the week-long voyage that utilizes the field time to collect samples. During the second half of the term, students analyze and synthesize the data, and present it in a publication-quality manuscript. Students taking graduate version complete additional assignments. Enrollment limited."
        ],
        [
            "inst",
            [
                "A. R. Babbin"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.800 Fluid Dynamics of the Atmosphere and Ocean"
        ],
        [
            "prerec",
            "Subject meets with 12.390"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=8.03\" title=\"8.03\" class=\"bubblelink code\" onclick=\"return showCourse(this, '8.03');\">8.03</a> and <a href=\"/search/?P=18.04\" title=\"18.04\" class=\"bubblelink code\" onclick=\"return showCourse(this, '18.04');\">18.04</a> "
            ]
        ],
        [
            "desc",
            "Introduction to fluid dynamics. Students acquire an understanding of some of the basic concepts of fluid dynamics that are needed as a foundation for advanced coursework in atmospheric science, physical oceanography, ocean engineering, climate science, etc. Emphasizes fluid fundamentals, with an atmosphere/ocean twist. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "A. Mahadevan",
                "C. Cenedese"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.801 Large-scale Ocean Dynamics"
        ],
        [
            "prerec",
            "Prereq: 12.800"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Spring)"
            ]
        ],
        [
            "desc",
            "Applies fundamental principles of geophysical fluid dynamics to understand the general patterns of the ocean circulation and stratification. Includes the mid-latitude wind-driven circulation, the Southern Ocean circulation, and the global overturning circulation. Uses a combination of theory, numerical simulations, and observations to illustrate the concepts."
        ],
        [
            "inst",
            [
                "J. Yang (WHOI)"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.802 Waves, Instability and Turbulence at Small Scales"
        ],
        [
            "prerec",
            "Prereq: 12.800 or permission of instructor"
        ],
        [
            "terms",
            [
                "G (Spring)"
            ]
        ],
        [
            "desc",
            "Covers basic concepts of wave motion, flow instability, and turbulence in rotating and stratified fluids with emphasis on small scales. Presents wave properties, including the dispersion relation, phase and group velocities, and wave kinematics, and uses these concepts to study the dynamics of surface and internal gravity waves, Poincare waves, Kelvin waves, and topographic waves. Includes flow instability. Explores general concepts of linear instability in small-scale stratified shear flows (Rayleigh and Kelvin-Helmholtz instabilities); examines non-rotating stratified turbulence resulting from these instabilities. Also discusses wave-mean flow interaction, hydraulic control, the entrainment assumption, and the interpretation of microstructure observations."
        ],
        [
            "inst",
            [
                "G. Flierl",
                "R. Ferrari"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.803 Advanced Geophysical Fluid Dynamics"
        ],
        [
            "prerec",
            "Prereq: 12.843"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: G (Spring)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Further development of topics covered in 12.843, with a more mathematical treatment. Covers current topics of interest in rotating stratified flows of oceans and atmospheres."
        ],
        [
            "inst",
            [
                "G. Flierl",
                "R. Ferrari"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.805 Data Analysis in Physical Oceanography"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: G (Fall)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Directed at making scientifically-sensible inferences from physical oceanography data (both observations and models). Introduces linear inverse methods, including regression, singular value decomposition, objective mapping, and data assimilation. Connects these methods to time series analysis, including Fourier methods, spectra, coherence, and filtering. Focuses on working with data in a computer laboratory setting. Emphasizes how statistical information can be used to improve experimental design. Gives some attention to the instruments and algorithms used to acquire the data."
        ],
        [
            "inst",
            [
                "G. Gebbie",
                "T. Farrar (WHOI)"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.806[J] Atmospheric Physics and Chemistry"
        ],
        [
            "prerec",
            "Same subject as 10.571[J]\nSubject meets with 12.306"
        ],
        [
            "terms",
            [
                "Prereq: (<a href=\"/search/?P=18.075\" title=\"18.075\" class=\"bubblelink code\" onclick=\"return showCourse(this, '18.075');\">18.075</a> and (<a href=\"/search/?P=5.60\" title=\"5.60\" class=\"bubblelink code\" onclick=\"return showCourse(this, '5.60');\">5.60</a> or 5.61)) or permission of instructor "
            ]
        ],
        [
            "desc",
            "Introduction to the physics and chemistry of the atmosphere including experience with computer codes. Aerosols and theories of their formation, evolution, and removal. Gas and aerosol transport from urban to continental scales. Coupled models of radiation, transport, and chemistry. Solution of inverse problems to deduce emissions and removal rates. Emissions control technology and costs. Applications to air pollution and climate."
        ],
        [
            "inst",
            [
                "R. G. Prinn"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.807[J] Atmospheric Chemistry"
        ],
        [
            "prerec",
            "Same subject as 1.84[J], 10.817[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=5.601\" title=\"5.601\" class=\"bubblelink code\" onclick=\"return showCourse(this, '5.601');\">5.601</a> and <a href=\"/search/?P=5.602\" title=\"5.602\" class=\"bubblelink code\" onclick=\"return showCourse(this, '5.602');\">5.602</a> "
            ]
        ],
        [
            "desc",
            "See description under subject 1.84[J]."
        ],
        [
            "inst",
            [
                "J. H. Kroll"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.808 Introduction to Observational Physical Oceanography"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall)"
            ]
        ],
        [
            "desc",
            "Results and techniques of observations of the ocean in the context of its physical properties and dynamical constraints. Emphasis on large-scale steady circulation and the time-dependent processes that contribute to it. Includes the physical setting of the ocean, atmospheric forcing, application of conservation laws, description of wind-driven and thermohaline circulation, eddy processes, and interpretive techniques."
        ],
        [
            "inst",
            [
                "H. Seo",
                "J. Toole (WHOI)"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.809 Hydraulic Phenomena in Geophysical Fluid Flows"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: G (Fall)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Examination of the hydraulics of nonrotating flows (Long's experiments, hydraulic control, upstream influence, nonlinear wave steepening, hydraulic jump and bores, application to severe downslope winds). Other topics may include: nonrotating stratified flows (two-layer hydraulics, virtual and approach controls, maximal and submaximal flow, application to the Strait of Gibraltar and the Bab al Mandab); and deep ocean straits and sills (steady theories for rotating channel flow, nonlinear Kelvin and frontal waves, rotating hydraulic jumps, geostrophic adjustment in a rotating channel, and applications to the Denmark Strait and other deep passages)."
        ],
        [
            "inst",
            [
                "L. Pratt",
                "K. Helfrich (WHOI)"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.810 Dynamics of the Atmosphere"
        ],
        [
            "prerec",
            "Prereq: 12.800"
        ],
        [
            "terms",
            [
                "G (Spring)"
            ]
        ],
        [
            "desc",
            "Discusses the dynamics of the atmosphere, with emphasis on the large scale. Topics include internal gravity waves in the atmosphere; potential vorticity conservation and Rossby waves; baroclinic instability and extratropical storms; the tropical Hadley and Walker circulations and equatorial waves; and the general circulation, annular modes, and the response to climate change."
        ],
        [
            "inst",
            [
                "P. O'Gorman"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.811 Tropical Meteorology"
        ],
        [
            "prerec",
            "Prereq: 12.810; or Coreq: 12.843"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: G (Spring)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "A description of the large-scale circulation systems of the tropical atmosphere and analysis of the dynamics of such systems. Topics include: Radiative-convective equilibrium; the Hadley and walker circulation; monsoons; tropical boundary layers; theory of the response of the tropical atmosphere to localized sea-surface temperature anomalies; intraseasonal oscillations; equatorial waves; El Niño/Southern Oscillation; easterly waves; and tropical cyclones."
        ],
        [
            "inst",
            [
                "K. A. Emanuel"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.812 The General Circulation of the Atmosphere and Climate Change"
        ],
        [
            "prerec",
            "Prereq: 12.810 or permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Fall)"
            ]
        ],
        [
            "desc",
            "Describes the general circulation of Earth's atmosphere and its maintenance. Second half of the course explores the response of the general circulation to climate change."
        ],
        [
            "inst",
            [
                "P. O'Gorman"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.814[J] Aerosol and Cloud Microphysics and Chemistry"
        ],
        [
            "prerec",
            "Same subject as 1.842[J]\nSubject meets with 12.338"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Focuses on understanding how aerosol particles form droplets or ice crystals during several atmospheric processes: determining Earth's radiative balance; heterogeneous chemistry and acid rain; understanding where, when and how much precipitation occurs. Provides tools for understanding the physics of aerosol and cloud element motion; the interaction of particles with water vapor, including phase changes and droplet and ice nucleation; the chemical composition of particles and the effect on cloud formation processes; and the effect of cloud processing on aerosol chemistry. Discusses relevant topics of contemporary interest, e.g., geoengineering and weather modification and volcanic effects. Students taking the graduate version complete different assignments."
        ],
        [
            "inst",
            [
                "D. Cziczo"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.815 Atmospheric Radiation and Convection"
        ],
        [
            "prerec",
            "Subject meets with 12.315"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=12.800\" title=\"12.800\" class=\"bubblelink code\" onclick=\"return showCourse(this, '12.800');\">12.800</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Introduction to the physics of atmospheric radiation, remote sensing, and convection, including use of computer codes. Radiative transfer equation including emission and scattering, spectroscopy, Mie theory, and numerical solutions. Physics of dry and moist convection, including moist thermodynamics. Radiative-convective equilibrium. Solution of inverse problems in remote sensing of atmospheric temperature and composition. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "T. Cronin"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.817[J] Atmospheric Composition and Global Change"
        ],
        [
            "prerec",
            "Same subject as 1.841[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=1.84\" title=\"1.84[J]\" class=\"bubblelink code\" onclick=\"return showCourse(this, '1.84');\">1.84[J]</a> "
            ]
        ],
        [
            "desc",
            "See description under subject 1.841[J]."
        ],
        [
            "inst",
            [
                "C. Heald"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.818 Introduction to Atmospheric Data and Large-scale Dynamics"
        ],
        [
            "prerec",
            "Subject meets with 12.318"
        ],
        [
            "terms",
            [
                "Prereq: None. <i>Coreq: <a href=\"/search/?P=12.800\" title=\"12.800\" class=\"bubblelink code\" onclick=\"return showCourse(this, '12.800');\">12.800</a></i> "
            ]
        ],
        [
            "desc",
            "Provides a general introduction to meteorological data and analysis techniques, and their use in the MIT Synoptic Laboratory to study the phenomenology and dynamics of large-scale atmospheric flow. Illustrates balance concepts as applied to the dynamics of frontal and synoptic scales, using real-time upper-air and surface station data and gridded analyzed fields. Uses advanced meteorological software packages to access, manipulate, and graphically display the data. Students taking graduate version complete different assignments."
        ],
        [
            "inst",
            [
                "L. Illari"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.820 Turbulence in the Ocean and Atmosphere"
        ],
        [
            "prerec",
            "Prereq: 12.843"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: G (Spring)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Covers phenomena, theory and modeling of turbulence in the Earth's oceans and atmosphere. The scope will range from centimeter- to planetary-scale motions. Includes homogeneous isotropic three- and two-dimensional turbulence, convection, stratified turbulence, quasi-gesotrophic turbulence, baroclinic turbulence, and macroturbulence in the ocean and atmosphere."
        ],
        [
            "inst",
            [
                "R. Ferrari",
                "G. Flierl"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.823 Modeling the Biology and Physics of the Ocean"
        ],
        [
            "prerec",
            "Prereq: 18.075 or 18.085"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: G (Spring)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Principles and examples of the construction of physical/ biological models for oceanic systems. Individual-based and continuum representations. Food webs and structured population models. Fluid transport, stirring, and mixing. Effects of rotation and stratification. Advection, diffusion, reaction dynamics. Oceanic examples of physical-biological dynamics: surface mixed layer, upwelling regimes, mesoscale eddies, and oceanic gyres."
        ],
        [
            "inst",
            [
                "G. Flierl",
                "D. McGillicuddy"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.824 Stability Theory for Oceanic & Atmospheric Flows"
        ],
        [
            "prerec",
            "Prereq: 12.802 or permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: G (Fall)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Basic theory of hydrodynamic instability with special application to flows of interest in oceanography and meteorology. Topics covered include general formulation of stability theory; concept of normal modes and linearization; fundamental stability theorems; baroclinic instability: Charney model, Eady model and the Phillips two-layer model; energy transformations; initial value theory and non-modal instability; barotropic instability for jets and shear layers; radiating instabilities; initial value problems applied to the concepts of convective, absolute and spatial instabilities; finite amplitude theory; stability of non-parallel flows."
        ],
        [
            "inst",
            [
                "G. Flierl"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.830 Topics in Waves and Instability"
        ],
        [
            "prerec",
            "Prereq: 12.843"
        ],
        [
            "terms",
            [
                "G (Fall)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "A detailed presentation of selected advanced topics in waves and instability in the atmosphere. The precise selection varies from year to year. Topics have included wave-mean flow interaction, the quasi-biennial oscillation, sudden warmings, critical-level behavior, wave overreflection, nonlinear equilibration, wave breaking, tropical waves, and stationary waves."
        ],
        [
            "inst",
            [
                "EAPS Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.834[J] Land-Atmosphere Interactions"
        ],
        [
            "prerec",
            "Same subject as 1.713[J]"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "See description under subject 1.713[J]."
        ],
        [
            "inst",
            [
                "D. Entekhabi"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.835 Experimental Atmospheric Chemistry"
        ],
        [
            "prerec",
            "Subject meets with 12.335"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Introduces the atmospheric chemistry involved in climate change, air pollution, and ozone depletion using a combination of interactive laboratory and field studies and simple computer models. Uses instruments for trace gas and aerosol measurements and methods for inferring fundamental information from these measurements. Students taking the graduate version complete different assignments."
        ],
        [
            "inst",
            [
                "R. Prinn",
                "S. Ono"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.842 Climate Science"
        ],
        [
            "prerec",
            "Subject meets with 12.301"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=3.091|5.111|5.112\" onclick=\"return showCourse(this, '3.091|5.111|5.112');\">Chemistry (GIR)</a>, <a href=\"/search/?P=18.03\" title=\"18.03\" class=\"bubblelink code\" onclick=\"return showCourse(this, '18.03');\">18.03</a>, or permission of instructor "
            ]
        ],
        [
            "desc",
            "Introduction to climate studies, including beginnings of the solar system, time scales, and climate in human history; methods for detecting climate change, including proxies, ice cores, instrumental records, and time series analysis; physical and chemical processes in climate, including primordial atmosphere, ozone chemistry, carbon and oxygen cycles, and heat and water budgets; internal feedback mechanisms, including ice, aerosols, water vapor, clouds, and ocean circulation; climate forcing, including orbital variations, volcanism, plate tectonics, and solar variability; climate models and mechanisms of variability, including energy balance, coupled models, and global ocean and atmosphere models; and outstanding problems. Students taking the graduate version complete different assignments."
        ],
        [
            "inst",
            [
                "A. Fiore",
                "E. Boyle"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.843 Large-scale Atmosphere and Ocean Dynamics"
        ],
        [
            "prerec",
            "Prereq: 12.801, 12.810, or permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall)"
            ]
        ],
        [
            "desc",
            "Project-based with lectures covering the relevant theory. Students work in groups on four projects. Each of these comprises a numerical part, to illuminate and illustrate the theory, and a data part (drawn from laboratory tank experiments, atmospheric, or ocean observations), to illustrate the phenomena. Topics include: barotropic vorticity dynamics including inversion and evolution, geostrophic and higher order balance, baroclinic dynamics and the evolution of balanced flows, and stability with emphasis on the mutual interaction of disturbances. Projects include a verbal presentation and writeup covering both the numerical and geophysical parts plus additional derivations as needed."
        ],
        [
            "inst",
            [
                "G. Flierl",
                "L. Illari"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.845[J] Sustainability Science and Engineering"
        ],
        [
            "prerec",
            "Same subject as IDS.526[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject IDS.526[J]."
        ],
        [
            "inst",
            [
                "N. E. Selin"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.846[J] Global Environmental Negotiations"
        ],
        [
            "prerec",
            "Same subject as IDS.525[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject IDS.525[J]."
        ],
        [
            "inst",
            [
                "N. Selin"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.849 Mechanisms and Models of the Global Carbon Cycle"
        ],
        [
            "prerec",
            "Subject meets with 12.349"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Addresses changes in the ocean, terrestrial biosphere and rocks modulation of atmospheric carbon dioxide on timescales from months to millions of years. Includes feedbacks between carbon cycle and climate. Combines hands-on data analysis with the formulation of simple models rooted in basic physical, chemical and biological principles. Students create individual \"toy\" global carbon cycle models. Students taking graduate version complete different assignments."
        ],
        [
            "inst",
            [
                "M. Follows"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.850 Computational Ocean Modeling"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: G (Spring)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Numerical modeling in oceanography and environmental fluid mechanics. Focuses on the building of computational models that describe processes such as transport (advection, diffusion), reaction (ecosystems), and boundary forcing, of relevance in the ocean. Models are developed in a hierarchical manner, starting from the simple (zero-dimensional in space), and incrementally advancing toward more complex, time-evolving systems in one-, two- (shallow water) and three-dimensions (Primitive equations). Students build their own models using the finite volume approach with an appreciation and understanding of the working of general circulation models"
        ],
        [
            "inst",
            [
                "A. Mahadevan (WHOI)",
                "W. Zhang (WHOI)"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.853 Advanced geophysical fluid dynamics"
        ],
        [
            "prerec",
            "Prereq: 12.843 or permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Follow-on to 12.843, with a more mathematical treatment and extension of material to current topics of interest involving rotating, stratified flows of oceans and atmospheres."
        ],
        [
            "inst",
            [
                "G. Flierl"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.860 Climate Variability and Diagnostics"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Spring)"
            ]
        ],
        [
            "desc",
            "Explores climate variability and change, focusing on the atmosphere and ocean, while building experience applying diagnostic analyses to a range of modern observations and models. Provides practical insight, from regional to global scale, with applications to past and future climates. Emphasizes salient features of the mean climate system and modes of natural variability, as well as observed and projected manifestations of anthropogenic climate change. Students gain experience accessing, analyzing, and visualizing a wide range of gridded observational-based datasets, as well as output from global climate model simulations. Develops the tools necessary to apply climate diagnostic analysis to one's own research, as well as the interdisciplinary edge to critically assess and interpret the observational and model results underpinning the Fifth Assessment Reports of the Intergovernmental Panel on Climate Change."
        ],
        [
            "inst",
            [
                "C. Uhmmenhofer"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.862 Coastal Physical Oceanography"
        ],
        [
            "prerec",
            "Prereq: 12.800"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Fall)"
            ]
        ],
        [
            "desc",
            "Introduction to the dynamics of flow over the continental shelf, nearshore, and estuaries, emphasizing both theory and observations. Content varies somewhat according to student and staff interests. Possible topics include fronts, buoyant plumes, surface and bottom boundary layers, wind-driven upwelling, coastal-trapped waves, internal waves, quasi-steady flows, high-latitude shelf processes, tides, and shelf-open ocean interactions."
        ],
        [
            "inst",
            [
                "R. Todd",
                "D. Ralston (WHOI)"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.863 Advanced Topics in Coastal Physical Oceanography"
        ],
        [
            "prerec",
            "Prereq: 12.862 or permission of instructor"
        ],
        [
            "terms",
            [
                "G (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "More specialized topics in the dynamics of flow over the continental shelf, including coastal-trapped waves, wind-driving, and mean flows. Emphasis on the relationship between theory and observations. Instrumentation and the application of statistical techniques also covered."
        ],
        [
            "inst",
            [
                "Woods Hole Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.866 Theory of the General Circulation of the Ocean"
        ],
        [
            "prerec",
            "Prereq: 12.800, 12.801, and 12.802"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: G (Spring)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "A review of wind-driven circulation, and the development of the baroclinic theory of the wind-driven circulation. Potential vorticity homohenization and the ventilated thermocline. Wind-driven circulation with continuous stratification, subduction/obduction. Equatorial thermocline and its relation to ENSO. Decadal climate variability. Thermohaline circulation and variability. Abyssal circulation. Mixing and energetics of the oceanic general circulation."
        ],
        [
            "inst",
            [
                "R. X. Huang (WHOI)"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.870 Air-Sea Interaction: Boundary Layers"
        ],
        [
            "prerec",
            "Prereq: Graduate-level fluid mechanics and a subject on waves or permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Spring)"
            ]
        ],
        [
            "desc",
            "Addresses the interaction of the atmosphere and ocean on temporal scales from seconds to days and spatial scales from centimeters to kilometers. Topics include the generation, propagation, and decay of surface waves; the processes by which mass, heat, momentum, and energy are transported vertically within the coupled atmospheric and oceanic boundary layers and across the air-sea interface; and the statistical tools, mathematical models, and observational methods that are used to quantify these processes."
        ],
        [
            "inst",
            [
                "R. Todd",
                "D. Ralston (WHOI)"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.884[J] Dimensions of Geoengineering"
        ],
        [
            "prerec",
            "Same subject as 1.850[J], 5.000[J], 10.600[J], 11.388[J], 15.036[J], 16.645[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 5.000[J]. Limited to 100."
        ],
        [
            "inst",
            [
                "J. Deutch",
                "M. Zuber"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.885[J] Science, Politics, and Environmental Policy"
        ],
        [
            "prerec",
            "Same subject as 11.373[J]\nSubject meets with 12.385"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Examines the role of science in US and international environmental policymaking. Surveys the methods by which scientists learn about the natural world; the treatment of science by experts, advocates, the media, and the public and the way science is used in legislative, administrative and judicial decision making. Through lectures, group discussions, and written essays, students develop a critical understanding of the role of science in environmental policy. Potential case studies include fisheries management, ozone depletion, global warming, smog, and endangered species. Students taking the graduate version complete different assignments."
        ],
        [
            "inst",
            [
                "S. Solomon",
                "J. Knox-Hayes"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.900 EAPS First Year Graduate Seminar"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Fall)"
            ]
        ],
        [
            "desc",
            "Provides a shared experience for first-year graduate students in EAPS and the MIT/ WHOI Joint Program. Facilitates opportunities to interact with senior graduate students and to meet a wide range of faculty.  Familiarizes students with departmental research within the themes of Earth, planets, climate, and life.  Discusses resources, graduate life at MIT, and the path to PhD. "
        ],
        [
            "inst",
            [
                "K. Bergmann",
                "T. Cronin",
                "J. de Wit",
                "M. Pec"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.901 Proposals, Papers and Pathways"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: G (Fall)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "This seminar builds skills for writing scientific proposals and papers, and facilitates investigation of career pathways. Topics covered include scientific writing and graphics, peer review, proposal writing for grants and fellowships, and exploration of academic and non-academic careers."
        ],
        [
            "inst",
            [
                "P. O'Gorman"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.910 Communicating Ocean Science"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Fall)"
            ]
        ],
        [
            "desc",
            "For students interested in improving their ability to teach science, the focus is on inquiry-based instructional methods and application to various audiences. Includes an opportunity to teach in a course at a local state university and in a supervised elementary school classroom. Class meets twice a week for 11 sessions, and episodically thereafter. The undergraduate lesson is arranged in consultation with Bridgewater State University faculty. Outreach in local school classrooms involves one session observing and three sessions teaching."
        ],
        [
            "inst",
            [
                "L. Mullineaux (WHOI)",
                "A. Michel (WHOI)"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.950, 12.951 Seminar in Physical Oceanography at MIT"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall, Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Topics in physical and dynamical oceanography. Content varying from term to term. 12.950 is letter-graded."
        ],
        [
            "inst",
            [
                "Physical Oceanography Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.970, 12.971 Current Research in Earth, Atmospheric and Planetary Sciences"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Original investigations, laboratory work, or field work on Earth, atmospheric, or planetary issues. 12.970 is letter-graded."
        ],
        [
            "inst",
            [
                "EAPS Faculty"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.980, 12.981 Current Research in Joint Program at MIT"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Original investigations on problems in oceanography. 12.980 is letter-graded."
        ],
        [
            "inst",
            [
                "EAPS Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.982, 12.983 Current Research in Joint Program at WHOI"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Original investigations, laboratory work, or fieldwork in oceanography. 12.982 is letter-graded."
        ],
        [
            "inst",
            [
                "WHOI Faculty"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.S488, 12.S489 Special Seminar in Structural Geology"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Organized lecture or laboratory subject on an aspect of structural geology not normally covered in regularly scheduled subjects. 12.S488 is letter-graded."
        ],
        [
            "inst",
            [
                "EAPS Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.S490, 12.S491 Special Seminar in Geology and Geochemistry"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Spring; second half of term)"
            ]
        ],
        [
            "desc",
            "Organized lecture or laboratory subject on an aspect of geology or geochemistry not normally covered in regularly scheduled subjects. 12.490 is letter-graded."
        ],
        [
            "inst",
            [
                "Geology and Geochemistry Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.S492, 12.S493 Special Seminar in Geobiology"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Spring)"
            ]
        ],
        [
            "desc",
            "Organized lecture or laboratory subject on an aspect of geobiology not normally covered in regularly scheduled subjects. 12.492 is letter-graded."
        ],
        [
            "inst",
            [
                "Geobiology Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.S501 Special Seminar in Earth, Atmospheric, and Planetary Sciences (New)"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Organized lecture or laboratory subject on an aspect of the earth sciences, planetary sciences, or astronomy not normally covered in regularly scheduled subjects. 12.592 is letter-graded."
        ],
        [
            "inst",
            [
                "EAPS Faculty"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.S590 Special Seminar in Geophysics"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: G (IAP)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Organized lecture or laboratory subject on an aspect of geophysics not normally covered in regularly scheduled subjects."
        ],
        [
            "inst",
            [
                "T. Herring and V. Pankratius"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.S591 Special Seminar in Geophysics"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Organized lecture or laboratory subject on an aspect of geophysics not normally covered in regularly scheduled subjects. 12.S590 is letter-graded."
        ],
        [
            "inst",
            [
                "Consult EAPS Education Office"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.S592 Special Seminar in Earth, Atmospheric and Planetary Sciences"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Organized lecture or laboratory subject on an aspect of the earth sciences, planetary sciences, or astronomy not normally covered in regularly scheduled subjects."
        ],
        [
            "inst",
            [
                "EAPS Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.S593 Special Seminar in Earth, Atmospheric and Planetary Sciences"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Spring)"
            ]
        ],
        [
            "desc",
            "Organized lecture or laboratory subject on an aspect of the earth sciences, planetary sciences, or astronomy not normally covered in regularly scheduled subjects. 12.592 is letter-graded."
        ],
        [
            "inst",
            [
                "EAPS Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.S594 Special Seminar in Earth, Atmospheric and Planetary Sciences"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Fall, IAP, Spring)"
            ]
        ],
        [
            "desc",
            "Organized lecture or laboratory subject on an aspect of the earth sciences, planetary sciences, or astronomy not normally covered in regularly scheduled subjects."
        ],
        [
            "inst",
            [
                "Consult EAPS Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.S595 Special Seminar in Geophysics"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Fall)"
            ]
        ],
        [
            "desc",
            "Organized lecture or laboratory subject on an aspect of geophysics not normally covered in regularly scheduled subjects. 12.S590 is letter-graded."
        ],
        [
            "inst",
            [
                "EAPS Faculty"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.S596 Special Seminar in Earth, Atmospheric, and Planetary Sciences"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Organized lecture or laboratory subject on an aspect of the earth sciences, planetary sciences, or astronomy not normally covered in regularly scheduled subjects."
        ],
        [
            "inst",
            [
                "EAPS Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.S597 Special Seminar in Earth, Atmospheric and Planetary Sciences"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Fall, IAP)"
            ]
        ],
        [
            "desc",
            "Organized lecture or laboratory subject on an aspect of the earth sciences, planetary sciences, or astronomy not normally covered in regularly scheduled subjects. 12.592 is letter-graded."
        ],
        [
            "inst",
            [
                "EAPS Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.S680, 12.S681 Special Seminar in Planetary Science"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Organized lecture or laboratory subject on an aspect of planetary science not normally covered in regularly scheduled subjects. 12.S680 is letter-graded."
        ],
        [
            "inst",
            [
                "Planetary Science Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.S990, 12.S991 Special Subject in Atmospheric Science"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall, IAP, Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Organized lecture or laboratory subject on an aspect of atmospheric science not normally covered in regularly scheduled subjects. 12.S990 is letter-graded."
        ],
        [
            "inst",
            [
                "PAOC Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "12.S992, 12.S993 Special Subject in Climate Science"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Organized lecture or laboratory subject on an aspect of climate not normally covered in the regularly scheduled subjects. 12.S992 is letter-graded."
        ],
        [
            "inst",
            [
                "PAOC Staff"
            ]
        ]
    ]
]