[
    "Anthropology (Course 21A)",
    [
        "head",
        "Core Subjects"
    ],
    [
        "block",
        [
            "title",
            "21A.00 Introduction to Anthropology: Comparing Human Cultures"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Through the comparative study of different cultures, anthropology explores fundamental questions about what it means to be human. Seeks to understand how culture shapes societies, from the smallest island in the South Pacific to the largest Asian metropolis, and affects the way institutions work, from scientific laboratories to Christian mega-churches. Provides a framework for analyzing diverse facets of human experience, such as gender, ethnicity, language, politics, economics, and art."
        ],
        [
            "inst",
            [
                "G. Jones"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.01 How Culture Works"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Introduces diverse meanings and uses of the concept of culture with historical and contemporary examples from scholarship and popular media around the globe. Includes first-hand observations, synthesized histories and ethnographies, quantitative representations, and visual and fictionalized accounts of human experiences. Students conduct empirical research on cultural differences through the systematic observation of human interaction, employ methods of interpretative analysis, and practice convincing others of the accuracy of their findings."
        ],
        [
            "inst",
            [
                "M. Buyandelger"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.157 The Meaning of Life"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Examines how a variety of cultural traditions propose answers to the question of how to live a meaningful life. Considers the meaning of life, not as a philosophical abstraction, but as a question that individuals grapple with in their daily lives, facing difficult decisions between meeting and defying cultural expectations. Provides tools for thinking about moral decisions as social and historical practices, and permits students to compare and contextualize the ways people in different times and places approach fundamental ethical concerns."
        ],
        [
            "inst",
            [
                "S. Helmreich",
                "H. Paxson"
            ]
        ]
    ],
    [
        "head",
        "Culture, Politics, and Identities"
    ],
    [
        "block",
        [
            "title",
            "21A.103[J] The Science of Race, Sex, and Gender"
        ],
        [
            "prerec",
            "Same subject as STS.046[J], WGS.225[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject WGS.225[J]."
        ],
        [
            "inst",
            [
                "A. Sur"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.104 Memory, Culture, and Forgetting"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Spring)"
            ]
        ],
        [
            "desc",
            "Introduces scholarly debates about the sociocultural practices through which individuals and societies create, sustain, recall, and erase memories. Emphasis is given to the history of knowledge, construction of memory, the role of authorities in shaping memory, and how societies decide on whose versions of memory are more \"truthful\" and \"real.\" Other topics include how memory works in the human brain, memory and trauma, amnesia, memory practices in the sciences, false memory, sites of memory, and the commodification of memory."
        ],
        [
            "inst",
            [
                "M. Buyandelger"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.111[J] For Love and Money: Rethinking the Family"
        ],
        [
            "prerec",
            "Same subject as WGS.172[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Cross-cultural case studies introduce students to the anthropological study of the social institutions and symbolic meanings of family, gender, and sexuality. Investigates the different forms families and households take and considers their social, emotional, and economic dynamics. Analyzes how various expectations for, and experiences of, family life are rooted in or challenged by particular conceptions of gender and sexuality. Addresses questions surrounding what it means to be a \"man\" or a \"woman,\" as well as a family member, in different social contexts."
        ],
        [
            "inst",
            [
                "H. Paxson"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.120 American Dream: Exploring Class in the US"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Spring)"
            ]
        ],
        [
            "desc",
            "Examines the \"American Dream\" — the belief that all individuals and groups can succeed in the US through hard work and determination — in light of decreasing social mobility, increasing inequality, and shifting patterns of immigration. Focuses on how people use storytelling — such as oral narrative, memoirs, home movies, family photo albums, and novels — to reflect on their day-to-day experience of social class in the United States. Considers how social class intersects with other aspects of identity, such as race, ethnicity, and gender. Students undertake research projects and class assignments using oral histories, interviews, and analysis of archival records."
        ],
        [
            "inst",
            [
                "C. Walley"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.127[J] Power: Interpersonal, Organizational, and Global Dimensions"
        ],
        [
            "prerec",
            "Same subject as 11.045[J], 15.302[J], 17.045[J]\nSubject meets with 21A.129"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "The study of power among individuals and within organizations, markets, and states. Using examples from anthropology and sociology alongside classical and contemporary social theory, explores the nature of dominant and subordinate relationships, types of legitimate authority, and practices of resistance. Examines how people are influenced in subtle ways by those around them, who makes controlling decisions in the family, how people get ahead at work, and whether democracies, in fact, reflect the will of the people. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "S. Silbey"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.129 Power: Interpersonal, Organizational, and Global Dimensions"
        ],
        [
            "prerec",
            "Subject meets with 11.045[J], 15.302[J], 17.045[J], 21A.127[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "The study of power among individuals and within organizations, markets, and states. Using examples from anthropology and sociology alongside classical and contemporary social theory, explores the nature of dominant and subordinate relationships, types of legitimate authority, and practices of resistance. Examines how people are influenced in subtle ways by those around them, who makes controlling decisions in the family, how people get ahead at work, and whether democracies, in fact, reflect the will of the people. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "S. Silbey"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.130[J] Introduction to Latin American Studies"
        ],
        [
            "prerec",
            "Same subject as 17.55[J], 21G.084[J], 21H.170[J]\nSubject meets with 21G.784"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 17.55[J]."
        ],
        [
            "inst",
            [
                "T. Padilla",
                "P. Duong"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.131[J] Latinx in the Age of Empire"
        ],
        [
            "prerec",
            "Same subject as 21H.270[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21H.270[J]."
        ],
        [
            "inst",
            [
                "H. Beltran",
                "T. Padilla"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.132[J] Race and Migration in Europe"
        ],
        [
            "prerec",
            "Same subject as 21G.058[J]\nSubject meets with 21G.418"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Addresses the shifting politics of nation, ethnicity, and race in the context of migration and globalization in Germany and Europe. Provides students with analytical tools to approach global concerns and consider Europe and Germany from cross-cultural and interdisciplinary perspectives. Familiarizes students with the ways in which histories of migration, travel, and colonial encounters shape contemporary Europe. Introduces the concepts of transnationalism, diasporic cultures, racism, ethnicity, asylum, and mobility via case studies and materials, including film, ethnography, fiction, and autobiography. Taught in English. Limited to 18."
        ],
        [
            "inst",
            [
                "B. Stoetzer"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.135[J] Africa and the Politics of Knowledge"
        ],
        [
            "prerec",
            "Same subject as 21G.025[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Considers how, despite its immense diversity, Africa continues to hold purchase as both a geographical entity and meaningful knowledge category. Examines the relationship between articulations of \"Africa\" and projects like European imperialism, developments in the biological sciences, African de-colonization and state-building, and the imagining of the planet's future. Readings in anthropology and history are organized around five themes: space and place, race, representation, self-determination, and time. Enrollment limited."
        ],
        [
            "inst",
            [
                "A. Edoh"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.136[J] Global Africa: Creative Cultures"
        ],
        [
            "prerec",
            "Same subject as 21G.026[J]\nSubject meets with 21G.326"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines contemporary and historical cultural production on and from Africa across a range of registers, including literary, musical and visual arts, material culture, and science and technology. Employs key theoretical concepts from anthropology and social theory to analyze these forms and phenomena. Uses case studies to consider how Africa articulates its place in, and relationship to, the world through creative practices. Discussion topics largely drawn from Francophone and sub-Saharan Africa, but also from throughout the continent and the African diaspora. Taught in English. Limited to 18."
        ],
        [
            "inst",
            [
                "A. Edoh"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.137[J] African Migrations"
        ],
        [
            "prerec",
            "Same subject as 21G.028[J]\nSubject meets with 21G.328"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines West African migration to France and to the United States from the early 20th century to the present. Centering the experiences of African social actors and historicizing recent dynamics, students consider what migration across these three regions reveals about African projects of self-determination, postcolonial nation-building, and global citizenship. Students also comparatively analyze the workings of contemporary French and American societies, in particular, the articulations of race and citizenship in the two nations. Taught in English. Limited to 18."
        ],
        [
            "inst",
            [
                "A. Edoh"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.141[J] Images of Asian Women: Dragon Ladies and Lotus Blossoms"
        ],
        [
            "prerec",
            "Same subject as 21G.048[J], WGS.274[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Explores some of the forces and mechanisms through which stereotypes are built and perpetuated. In particular, examines stereotypes associated with Asian women in colonial, nationalist, state-authoritarian, and global/diasporic narratives about gender and power. Students read ethnography, fiction, and history, and view films to examine the politics and circumstances that create and perpetuate the representation of Asian women as dragon ladies, lotus blossoms, despotic tyrants, desexualized servants, and docile subordinates. Students are introduced to debates about Orientalism, gender, and power."
        ],
        [
            "inst",
            [
                "M. Buyandelger"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.143[J] Gender and Japanese Popular Culture"
        ],
        [
            "prerec",
            "Same subject as 21G.039[J], WGS.154[J]\nSubject meets with 21G.591"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21G.039[J]."
        ],
        [
            "inst",
            [
                "I. Condry"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.150 Teaching and Learning: Cross-Cultural Perspectives"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Explores the diverse ways that people teach and learn in different countries, disciplines, and subcultures (computer gamers, magicians, jazz musicians, etc.). Compares schooling to other forms of knowledge transmission, from initiation and apprenticeship to recent innovations in online education. Students discuss various learning theories and apply them to a variety of in-class activities using qualitative methods to conduct original research on topics of their choice. Limited to 15."
        ],
        [
            "inst",
            [
                "G. Jones"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.155 Food, Culture, and Politics"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Explores connections between what we eat and who we are through cross-cultural study of how personal identities and social groups are formed via food production, preparation, and consumption. Organized around critical discussion of what makes \"good\" food good (healthy, authentic, ethical, etc.). Uses anthropological and literary classics as well as recent writing and films on the politics of food and agriculture. Instruction and practice in written and oral communication provided."
        ],
        [
            "inst",
            [
                "H. Paxson"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.461 What Is Capitalism?"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Introduces academic debates on the nature of capitalism, drawing upon the ideas of scholars as diverse as Adam Smith and Karl Marx. Examines anthropological studies of how contemporary capitalism plays out in people's daily lives in a range of geographic and social settings, and implications for how we understand capitalism today. Settings range from Wall Street investment banks to auto assembly plants, from family businesses to consumer shopping malls. Enrollment limited."
        ],
        [
            "inst",
            [
                "C. Walley"
            ]
        ]
    ],
    [
        "head",
        "Bodies, Health, and Environment"
    ],
    [
        "block",
        [
            "title",
            "21A.301 Disease and Health: Culture, Society, and Ethics"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "From a cross cultural and global perspective, examines how medicine is practiced, with particular emphasis on biomedicine. Analyzes medical practice as a cultural system, focusing on the human and social side of things. Considers how people in different societies think of disease, health, body, and mind. Enrollment limited."
        ],
        [
            "inst",
            [
                "A. Moran-Thomas"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.302[J] Dilemmas in Biomedical Ethics: Playing God or Doing Good?"
        ],
        [
            "prerec",
            "Same subject as 11.133[J], WGS.271[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 11.133[J]."
        ],
        [
            "inst",
            [
                "E. C. James"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.303[J] The Anthropology of Biology"
        ],
        [
            "prerec",
            "Same subject as STS.060[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Applies the tools of anthropology to examine biology in the age of genomics, biotechnological enterprise, biodiversity conservation, pharmaceutical bioprospecting, and synthetic biology. Examines such social concerns such as bioterrorism, genetic modification, and cloning. Offers an anthropological inquiry into how the substances and explanations of biology — ecological, organismic, cellular, molecular, genetic, informatic — are changing. Examines such artifacts as cell lines, biodiversity databases, and artificial life models, and using primary sources in biology, social studies of the life sciences, and literary and cinematic materials, asks how we might answer Erwin Schrodinger's 1944 question, \"What Is Life?\", today."
        ],
        [
            "inst",
            [
                "S. Helmreich"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.311 The Social Lives of Medical Objects"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Explores the theories and assumptions built into objects meant to improve health.  Students read and discuss case studies that follow the often unexpected ways intended intervention objects are designed and developed, globally travel, and at times become part of people's everyday lives.  Studies include a broad range of medical materials and development technologies, such as penicillin, anti-malarial drugs, water pumps, air filters, prosthetic limbs, glucose meters, scales, DDT insecticides, bednets, and micro-nutrient pills. Limited to 20."
        ],
        [
            "inst",
            [
                "A. Moran-Thomas"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.312 Planetary Change and Human Health"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Fall)"
            ]
        ],
        [
            "desc",
            "Explores intersections between health of the planet and the health of human beings. Drawing upon case studies of growing ecological crisis around the world, topics include the human health implications of global climate change, sea level rise, weather disasters and fossil fuel pollution; connections between the health of plants, animals, microbes, and people; shifting industrial food systems and human nutrition; representations of race and indigeneity amid struggles for environmental justice; waste disposal and nuclear afterlives; and debates surrounding controversial issues such as geoengineering and climate AI.  Students practice inserting environmental sciences in dialogue with toolkits from the social sciences and humanities to explore the uneven social worlds that shape how science gets traction (or not) in policy and law. Limited to 25 students."
        ],
        [
            "inst",
            [
                "A. Moran-Thomas"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.319[J] History and Anthropology of Medicine and Biology"
        ],
        [
            "prerec",
            "Same subject as STS.330[J]"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Explores recent historical and anthropological approaches to the study of medicine and biology. Topics might include interaction of disease and society; science, colonialism, and international health; impact of new technologies on medicine and the life sciences; neuroscience and psychiatry; race, biology and medicine. Specific emphasis varies from year to year."
        ],
        [
            "inst",
            [
                "S. Helmreich"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.400 The Stakes of International Development"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Offers an anthropological perspective on international development. Students consider development, not in policy or technical terms, but through its social and political dynamics and its impacts on daily life. Examines the various histories of, and meanings given to, international development as well as the social organization of aid agencies and projects. Follows examples of specific projects in various parts of the world. Examples: water projects for pastorialists in Africa, factory development in Southeast Asia, and international nature parks in Indonesia."
        ],
        [
            "inst",
            [
                "C. Walley"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.402[J] City Living: Ethnographies of Urban Worlds"
        ],
        [
            "prerec",
            "Same subject as 21G.029[J]\nSubject meets with 21G.419"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Introduces the ways in which anthropologists have studied cities. Addressing the question of what constitutes the boundaries of life in the city, students familiarize themselves with key themes - such as the relation between city and countryside, space and place, urban economies, science, globalization, migration, nature/culture, kinship, and race, gender, class and memory - that have guided anthropological analyses of cities across the world. Via engagement with case studies and their own small fieldwork projects, students gain experience with different ethnographic strategies for documenting urban life. Taught in English. Limited to 25 across 21A.402[J] and 21G.419."
        ],
        [
            "inst",
            [
                "B. Stoetzer"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.404 Living Through Climate Change (New)"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Uses anthropological approaches to better understand those social and political forces shaping climate change as well as proposed solutions, including those leveraging technical and scientific tools. Examines how climate change is bound up, historically and today, with other processes — including land dispossession, pollution, resource insecurity, industrial agriculture, eroding infrastructure, racial housing discrimination, and job loss. Explores perspectives on social justice, community engagement, and lived experiences of climate change — and their implications for science, engineering, and industry. Engages ethnographic case studies that address unequal climate impacts, the effects of policy, and ongoing mitigation efforts unfolding in agriculture, coastal engineering, architecture, urban planning, global migration, and historical repair. Includes a couple of mandatory field trips during class time."
        ],
        [
            "inst",
            [
                "S. Helmreich",
                "A. Moran-Thomas",
                "B. Stoetzer",
                "C. Walley"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.407[J] Gender, Race, and Environmental Justice"
        ],
        [
            "prerec",
            "Same subject as 21G.057[J], STS.022[J], WGS.275[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Provides an introduction to the analysis of gender in science, technology, and environmental politics from a global perspective. Familiarizes students with central objects, questions, and methods in the field. Examines existent critiques of the racial, sexual and environmental politics at stake in techno-scientific cultures. Draws on material from popular culture, media, fiction, film, and ethnography. Addressing specific examples from across the globe, students also explore different approaches to build more livable environments that promote social justice. Taught in English. Limited to 18."
        ],
        [
            "inst",
            [
                "B. Stoetzer"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.409[J] Ethics of Intervention"
        ],
        [
            "prerec",
            "Same subject as 11.238[J]"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "See description under subject 11.238[J]."
        ],
        [
            "inst",
            [
                "E. C. James"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.410 Environmental Struggles"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Spring)"
            ]
        ],
        [
            "desc",
            "Offers an international perspective on the environment. Using environmental conflict to consider the stakes that groups in various parts of the world have in nature, while also exploring how ecological and social dynamics interact and change over time, subject considers such controversial environmental issues as: nuclear contamination in Eastern Europe; genetic bioprospecting in Mexico; toxic run-off in the rural US; the Bhopal accident in India; and the impact of population growth in the Third World."
        ],
        [
            "inst",
            [
                "C. Walley"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.411[J] People and Other Animals"
        ],
        [
            "prerec",
            "Same subject as 21H.380[J]\nSubject meets with 21A.419[J], 21H.980[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21H.380[J]."
        ],
        [
            "inst",
            [
                "H. Ritvo"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.419[J] People and Other Animals"
        ],
        [
            "prerec",
            "Same subject as 21H.980[J]\nSubject meets with 21A.411[J], 21H.380[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21H.980[J]."
        ],
        [
            "inst",
            [
                "H. Ritvo"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.429[J] Environmental Conflict"
        ],
        [
            "prerec",
            "Same subject as STS.320[J]"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Explores the complex interrelationships among humans and natural environments, focusing on non-western parts of the world in addition to Europe and the United States. Use of environmental conflict to draw attention to competing understandings and uses of \"nature\" as well as the local, national and transnational power relationships in which environmental interactions are embedded. In addition to utilizing a range of theoretical perspectives, subject draws upon a series of ethnographic case studies of environmental conflicts in various parts of the world."
        ],
        [
            "inst",
            [
                "C. Walley"
            ]
        ]
    ],
    [
        "head",
        "Science, Technology, and Media"
    ],
    [
        "block",
        [
            "title",
            "21A.151 Language, Communication, and Culture"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Fall)"
            ]
        ],
        [
            "desc",
            "Provides an introduction to linguistic anthropology, which deals with the role of language in social, cultural, and political processes. Considers language as more than just a neutral conduit for exchanging information, but rather as a factor shaping and shaped by interpersonal relationships, national identity, and perception of the world. Drawing on case studies and first-hand observations, students apply methods for analyzing communication and miscommunication in everyday conversation, professional discourse, verbal performance, online interaction, political rhetoric, and more."
        ],
        [
            "inst",
            [
                "G. Jones"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.500[J] Technology and Culture"
        ],
        [
            "prerec",
            "Same subject as STS.075[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines the intersections of technology, culture, and politics in a variety of social and historical settings ranging from 19th-century factories to 21st-century techno dance floors, from Victorian London to anything-goes Las Vegas. Discussions and readings organized around three questions: what cultural effects and risks follow from treating biology as technology; how computers have changed the way we think about ourselves and others; and how politics are built into our infrastructures. Explores the forces behind technological and cultural change; how technological and cultural artifacts are understood and used by different communities; and whether, in what ways, and for whom technology has produced a better world. Limited to 50."
        ],
        [
            "inst",
            [
                "H. Paxson"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.501[J] Art, Craft, Science"
        ],
        [
            "prerec",
            "Same subject as STS.074[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines how people learn, practice, and evaluate traditional and contemporary craft techniques. Social science theories of design, embodiment, apprenticeship learning, skill, labor, expertise, and tacit knowledge are used to explore distinctions among art, craft, and science. Also discusses the commoditization of craft into market goods, collectible art, and tourism industries. Ethnographic and historical case studies include textiles, Shaker furniture, glassblowing, quilting, cheesemaking, industrial design, home and professional cooking, factory and laboratory work, CAD/CAM. Demonstrations, optional field trips, and/or hands-on craft projects may be included. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "H. Paxson"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.502 Fun and Games: Cross-Cultural Perspectives"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Spring)"
            ]
        ],
        [
            "desc",
            "Considers the cultural organization of play in different communities and societies. Explores why all people play, how different cultures experience fun, and what particular games mean, if anything. Surveys major theories of play in relation to a variety of play phenomena, such as jokes, video games, children's fantasies, sports, and entertainment spectacles. As a final project, students develop their own case study."
        ],
        [
            "inst",
            [
                "G. Jones"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.504[J] Cultures of Computing"
        ],
        [
            "prerec",
            "Same subject as STS.086[J], WGS.276[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines computers anthropologically, as artifacts revealing the social orders and cultural practices that create them. Students read classic texts in computer science along with cultural analyses of computing history and contemporary configurations. Explores the history of automata, automation and capitalist manufacturing; cybernetics and WWII operations research; artificial intelligence and gendered subjectivity; robots, cyborgs, and artificial life; creation and commoditization of the personal computer; the growth of the Internet as a military, academic, and commercial project; hackers and gamers; technobodies and virtual sociality. Emphasis is placed on how ideas about gender and other social differences shape labor practices, models of cognition, hacking culture, and social media."
        ],
        [
            "inst",
            [
                "H. Beltrán"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.505[J] The Anthropology of Sound"
        ],
        [
            "prerec",
            "Same subject as STS.065[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines the ways humans experience sound and how perceptions and technologies of sound emerge from cultural, economic, and historical worlds. Consider how the sound/noise/music boundaries have been imagined, created, and modeled across sociocultural and historical contexts. Learn how environmental, linguistic, and musical sounds are construed cross-culturally as well as the rise of telephony, architectural acoustics, sound recording, multi-channel and spatial mix performance, and the globalized travel of these technologies. Questions of sound ownership, property, authorship, remix, and copyright in the digital age are also addressed."
        ],
        [
            "inst",
            [
                "S. Helmreich"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.506 The Anthropology of Politics: Persuasion and Power"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Fall)"
            ]
        ],
        [
            "desc",
            "Introduces the ethnographic study of politics, i.e., what anthropologists understand to be \"political\" in various social and economic systems, from small-scale societies to liberal democratic states. Examines politics across three contemporary contexts: electoral politics, public spheres, and bureaucracies and humanitarian governance.  Students consider and analyze how questions of authority, coercion, and violence have been theorized to relate to the political, and how some aspects of social life are regimented in explicitly non-political ways."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.507[J] Resonance: Sonic Experience, Science, and Art"
        ],
        [
            "prerec",
            "Same subject as 4.648[J]\nSubject meets with 4.649[J], 21A.519[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 4.648[J]."
        ],
        [
            "inst",
            [
                "S. Helmreich",
                "C. Jones"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.508 Culture and Ethics in Science Fiction Worlds"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Fall)"
            ]
        ],
        [
            "desc",
            "Examines the ethical and controversial aspects of technology's impacts on society, as approached through the lens of science fiction and media. From novels such as Kindred to films like Sleep Dealer, the social inequalities and political complexities portrayed in science fiction worlds offer a launch point to discuss the uneasy aspects and uneven reach of science, technology, and medicine. Covers issues including gene editing, data privacy, border surveillance, human experimentation, environmental crises, war industries, and the impacts of AI."
        ],
        [
            "inst",
            [
                "A. Moran-Thomas"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.509[J] Art, Craft, Science"
        ],
        [
            "prerec",
            "Same subject as STS.474[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines how people learn, practice, and evaluate traditional and contemporary craft techniques. Social science theories of design, embodiment, apprenticeship learning, skill, labor, expertise, and tacit knowledge are used to explore distinctions among art, craft, and science. Also discusses the commoditization of craft into market goods, collectible art, and tourism industries. Ethnographic and historical case studies include textiles, Shaker furniture, glassblowing, quilting, cheesemaking, industrial design, home and professional cooking, factory and laboratory work, CAD/CAM. Demonstrations, optional field trips, and/or hands-on craft projects may be included. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "H. Paxson"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.511 Hacking from the South"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Using anthropological perspectives to propose critically reflexive modes of participation in existing socio-technical systems, students draw on ethnographic case studies to understand how practices and definitions of \"hacking\" are grounded in specific political and cultural contexts. With a focus on the Global South (Africa, Latin America, Caribbean, Middle East, Asia and Southeast Asia, Oceania), examines the relationship between international development and technological empowerment by interrogating assumptions associated with particular locations and peoples, especially those constructed as peripheral to geographic centers of power."
        ],
        [
            "inst",
            [
                "H. Beltran"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.513 Drawing Human Experience (New)"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Introduces fundamental techniques of drawing with traditional media and their application as tools of anthropological inquiry. Examines what the human impulse to draw reveals about connections between mind, hand, and eye. Explores ideas, refines perceptions, and communicates insights through both abstract and figurative drawing. Each student completes a portfolio of original drawings with accompanying written analysis. Limited to 20 due to space constraints."
        ],
        [
            "inst",
            [
                "G. Jones",
                "S. Riskin"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.519[J] Resonance: Sonic Experience, Science, and Art"
        ],
        [
            "prerec",
            "Same subject as 4.649[J]\nSubject meets with 4.648[J], 21A.507[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 4.649[J]."
        ],
        [
            "inst",
            [
                "S. Helmreich",
                "C. Jones"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.520 Magic, Science, and Religion"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Fall)"
            ]
        ],
        [
            "desc",
            "Explores the origins of magic, science, and religion as forms of belief within and across cultures. Addresses the place of rationality and belief in competing sociocultural theories, with a focus on analyzing modern perspectives. Examines how cases of overlap between magic, science, and religion raise new questions about modernity and human nature."
        ],
        [
            "inst",
            [
                "G. Jones"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.529 Virtual and Other Realities"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Spring)"
            ]
        ],
        [
            "desc",
            "Explores virtual worlds created in cyberspace, non-internet ritual spaces, science laboratories, tech companies, and artistic performances from an anthropological perspective. Students acquire analytical tools for thinking about immersive experiences of being someone else, and the socio-economic, political, and technological contexts behind creating specific types of parallel worlds. Examines and contextualizes the ways in which scientists, designers, shamans, ritual specialists, and corporations imagine, respond to, and steer people's desires and needs. Considers debates on the future of imagination, sensory experiences, and creativity in technology. Limited to 20. This class is designed as a seminar class for graduate and advanced undergraduate students."
        ],
        [
            "inst",
            [
                "M. Buyandelger"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.550[J] DV Lab: Documenting Science through Video and New Media"
        ],
        [
            "prerec",
            "Same subject as STS.064[J]\nSubject meets with 21A.559"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Uses documentary video making as a tool to explore everyday social worlds (including those of science and engineering), and for thinking analytically about media itself. Students make videos and engage in critical analysis. Provides students with instruction on how to communicate effectively and creatively in a visual medium, and how to articulate their own analyses of documentary images in writing and spoken word. Readings drawn from documentary film theory, anthropology, and social studies of science. Students view a wide variety of classic documentaries and explore different styles. Lab component devoted to digital video production. Includes a final video project. Students taking graduate version complete additional assignments. Limited to 12."
        ],
        [
            "inst",
            [
                "C. Walley",
                "C. Boebel"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.559 DV Lab: Documenting Science through Video and New Media"
        ],
        [
            "prerec",
            "Subject meets with 21A.550[J], STS.064[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Uses documentary video making as a tool to explore everyday social worlds (including those of science and engineering), and for thinking analytically about media itself. Students make videos and engage in critical analysis. Provides students with instruction on how to communicate effectively and creatively in a visual medium, and how to articulate their own analyses of documentary images in writing and spoken word. Readings drawn from documentary film theory, anthropology, and social studies of science. Students view a wide variety of classic documentaries and explore different styles. Lab component devoted to digital video production. Includes a final video project. Students taking graduate version complete additional assignments. Limited to 12."
        ],
        [
            "inst",
            [
                "C. Walley",
                "C. Boebel"
            ]
        ]
    ],
    [
        "head",
        "Research Methods in Anthropology"
    ],
    [
        "block",
        [
            "title",
            "21A.802 Seminar in Ethnography and Fieldwork"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Introduction to ethnographic practices: the study of and communicating about culture. Subject provides instruction and practice in writing, revision of fieldnotes, and a final paper. Preference to Anthropology majors and minors."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.809 Designing Empirical Research in the Social Sciences"
        ],
        [
            "prerec",
            "Subject meets with 15.347"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Foundations of good empirical research in the social sciences. Introduction to the basic assumptions and underlying logic of both qualitative and quantitative methodologies. Explores a variety of approaches to research design, evaluates the products of empirical research, and practices several common techniques. Discusses several major theoretical paradigms used as interpretive frameworks for social science research. Students develop a proposal for their own research project."
        ],
        [
            "inst",
            [
                "S. Silbey"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.819 Ethnographic Research Methods"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Fall)"
            ]
        ],
        [
            "desc",
            "Training in the design and practice of qualitative research. Organized around illustrative texts, class exercises, and student projects. Topics include the process of gaining access to and participating in the social worlds of others; techniques of observation, fieldnote-taking, researcher self-monitoring and reflection; methods of inductive analysis of qualitative data including conceptual coding, grounded theory, and narrative analysis. Discussion of research ethics, the politics of fieldwork, modes of validating researcher accounts, and styles of writing up qualitative field research."
        ],
        [
            "inst",
            [
                "G. Jones"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.829[J] Ethnography"
        ],
        [
            "prerec",
            "Same subject as STS.360[J]"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "See description under subject STS.360[J]. Preference to HASTS students; open to others with permission of instructor."
        ],
        [
            "inst",
            [
                "M. Fischer"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.859[J] Social Theory and Analysis"
        ],
        [
            "prerec",
            "Same subject as STS.250[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Major theorists and theoretical schools since the late 19th century. Marx, Weber, Durkheim, Bourdieu, Levi-Strauss, Geertz, Foucault, Gramsci, and others. Key terms, concepts, and debates."
        ],
        [
            "inst",
            [
                "M. Fischer"
            ]
        ]
    ],
    [
        "head",
        "Independent Study, Special Subjects, and Thesis"
    ],
    [
        "block",
        [
            "title",
            "21A.901 Independent Study in Anthropology"
        ],
        [
            "prerec",
            "Prereq: Two subjects in Anthropology"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Opportunity for independent study, guided research, practicum, or field work under regular supervision by a faculty member. Projects require prior approval of the instructor and Head of the Anthropology Program. Normal maximum is 6 units; exceptional 9- or 12-unit projects occasionally approved."
        ],
        [
            "inst",
            [
                "Consult Program Head"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.902 Independent Study in Anthropology"
        ],
        [
            "prerec",
            "Prereq: Two subjects in Anthropology"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Opportunity for independent study, guided research, practicum, or field work under regular supervision by a faculty member. Projects require prior approval of the instructor and Head of the Anthropology Program. Normal maximum is 6 units; exceptional 9- or 12-unit projects occasionally approved."
        ],
        [
            "inst",
            [
                "Consult Program Head"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.929 Graduate Independent Study"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Opportunity for study or projects at an advanced level with an Anthropology faculty member."
        ],
        [
            "inst",
            [
                "Consult Program Head"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.939 Graduate Independent Study"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Opportunity for study or projects at an advanced level with an Anthropology faculty member."
        ],
        [
            "inst",
            [
                "Consult Program Head"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.949 Graduate Independent Study"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Opportunity for study or projects at an advanced level with an Anthropology faculty member."
        ],
        [
            "inst",
            [
                "Consult Program Head"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.950 Teaching Anthropology"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "For qualified graduate students serving as either a teaching assistant or instructor for subjects in Anthropology. Enrollment limited by availability of suitable teaching assignments."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.S01 Special Subject in Anthropology"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Seminar or lecture on a topic in anthropology that is not covered in the regular curriculum."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.S02 Special Subject in Anthropology"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (IAP)"
            ]
        ],
        [
            "desc",
            "Seminar or lecture on a topic in anthropology that is not covered in the regular curriculum."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.S10 Special Graduate Subject in Anthropology"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Spring)"
            ]
        ],
        [
            "desc",
            "Seminar or lecture on a topic in anthropology that is not covered in the regular curriculum."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.S11 Special Graduate Subject in Anthropology"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Fall)"
            ]
        ],
        [
            "desc",
            "Seminar or lecture on a topic in anthropology that is not covered in the regular curriculum."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.THT Anthropology Pre-Thesis Tutorial"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Students writing a thesis work with an advisor to develop research topics, review relevant research and scholarship, frame research questions, choose an appropriate methodology for data collection and analysis, and draft the introductory and methodology sections of their theses. Includes substantial practice in writing (with revision) and oral presentations."
        ],
        [
            "inst",
            [
                "Consult Program Head"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.THU Undergraduate Thesis in Anthropology"
        ],
        [
            "prerec",
            "Prereq: 21A.THT"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Completion of work on the senior major thesis under supervision of a faculty thesis advisor. Includes oral presentation of thesis progress early in the term, assembling and revising the final text, and a final meeting with a committee of faculty evaluators to discuss the successes and limitations of the project."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.UR Undergraduate Research"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Individual participation in an ongoing research project. For students in the Undergraduate Research Opportunities Program."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21A.URG Undergraduate Research"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Individual participation in an ongoing research project. For students in the Undergraduate Research Opportunities Program."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ]
]