[
    "Global Languages (Course 21G)",
    [
        "head",
        "First Year Discovery"
    ],
    [
        "block",
        [
            "title",
            "21G.012 Exploring Globalization through Chinese Food"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Introduces students to some of the central themes of cultural globalization through the case study of Chinese food. An exploration of the cuisine in the local Boston area exposes students to the topics of global trade, migration, transnational business and labor, the transnational dissemination of knowledge, and cultural production. Readings and films include cookbooks, memoirs, reportage and documentaries. Includes walking tours of Boston's Chinatown. Students produce a blog to document their findings. Concludes with a Chinese cooking workshop. Subject can count toward the 6-unit discovery-focused credit limit for first year students. Limited to 15; preference to first-year students."
        ],
        [
            "inst",
            [
                "E. Teng"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.013 Discovering Multilingual Boston: Voices of Immigrant Communities"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall; partial term)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "This discovery subject will expose first-year students to the 21G curriculum through exposure to the importance of global languages in our local community. Introduces Boston's multilingual richness and vibrant immigrant communities through an exploration of the city's diverse cultures and neighborhoods. Readings and films provide an overview of Boston's recent immigrant profile, document key issues within immigrant communities, and provide testimonies of lived experience. Field trips and guest speakers allow students to learn from organizations working with immigrants in Boston neighborhoods. Students have the option to produce a blog to document their findings and report on an immigrant community, struggle, or testimony. Class meets every other week over the course of the term. Subject can count toward the 6-unit discovery-focused credit limit for first-year students. Limited to 16; preference for first-year students."
        ],
        [
            "inst",
            [
                "R. Herr"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.014 Introduction to Russian Politics and Society"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Fall; partial term)"
            ]
        ],
        [
            "desc",
            "Introduces students to contemporary Russia through analysis of major political, social, and cultural trends and addresses how they have developed due to the 2022 invasion of Ukraine. Considers the role of identity, state propaganda, civil society — including those in exile — and music both as an instrument of political power and popular resistance. Study materials include academic and media articles, recent documentaries, and video interviews with prominent figures in Russian science and culture. Subject can count toward the 6-unit discovery-focused credit limit for first year students. Limited to 15."
        ],
        [
            "inst",
            [
                "E. Wood"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.015 Introduction to Buddhism, Mindfulness, and Meditation"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall; second half of term)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Companion to the Fitness and Meditation class offered through MIT's Wellness program. Introduces students to the basic ideas of Buddhism, the history of Buddhism's transmission through East Asia, and core aspects of the philosophy of Humanistic Buddhism, including the role of meditation and mindfulness in Buddhist practice. Meets with the MIT Wellness Fitness and Meditation class; students must enroll in both to receive credit. Subject can count toward the 6-unit discovery-focused credit limit for first-year students. Limited to 18."
        ],
        [
            "inst",
            [
                "E. Teng"
            ]
        ]
    ],
    [
        "head",
        "Studies in International Literatures and Cultures"
    ],
    [
        "block",
        [
            "title",
            "21G.011 Topics in Indian Popular Culture"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: U (Spring)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Overview of Indian popular culture over the last two decades, through a variety of material such as popular fiction, music, television and Bombay cinema. Explores major themes and their representations in relation to current social and political issues, elements of the formulaic masala movie, music and melodrama, ideas of nostalgia and incumbent change in youth culture, and questions of gender and sexuality in popular fiction. Taught in English. Enrollment limited."
        ],
        [
            "inst",
            [
                "A. Banerjee"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.022[J] International Women's Voices"
        ],
        [
            "prerec",
            "Same subject as 21L.522[J], WGS.141[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21L.522[J]."
        ],
        [
            "inst",
            [
                "M. Resnick"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.024[J] The Linguistic Study of Bilingualism"
        ],
        [
            "prerec",
            "Same subject as 24.906[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=24.900\" title=\"24.900\" class=\"bubblelink code\" onclick=\"return showCourse(this, '24.900');\">24.900</a> or <a href=\"/search/?P=24.9000\" title=\"24.9000\" class=\"bubblelink code\" onclick=\"return showCourse(this, '24.9000');\">24.9000</a> "
            ]
        ],
        [
            "desc",
            "See description under subject 24.906[J]. Enrollment limited."
        ],
        [
            "inst",
            [
                "S. Flynn"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.025[J] Africa and the Politics of Knowledge"
        ],
        [
            "prerec",
            "Same subject as 21A.135[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21A.135[J]. Enrollment limited."
        ],
        [
            "inst",
            [
                "A. Edoh"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.026[J] Global Africa: Creative Cultures"
        ],
        [
            "prerec",
            "Same subject as 21A.136[J]\nSubject meets with 21G.326"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21A.136[J]. Limited to 18."
        ],
        [
            "inst",
            [
                "A. Edoh"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.028[J] African Migrations"
        ],
        [
            "prerec",
            "Same subject as 21A.137[J]\nSubject meets with 21G.328"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21A.137[J]. Limited to 18."
        ],
        [
            "inst",
            [
                "A. Edoh"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.029[J] City Living: Ethnographies of Urban Worlds"
        ],
        [
            "prerec",
            "Same subject as 21A.402[J]\nSubject meets with 21G.419"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21A.402[J]. Limited to 25 across 21A.402[J] and 21G.419."
        ],
        [
            "inst",
            [
                "B. Stoetzer"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.030[J] Introduction to East Asian Cultures: From Zen to K-Pop"
        ],
        [
            "prerec",
            "Same subject as WGS.236[J]\nSubject meets with 21G.193"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines traditional forms of East Asian culture (including literature, art, performance, food, and religion) as well as contemporary forms of popular culture (film, pop music, karaoke, and manga). Covers China, Japan, Korea, Taiwan, and Hong Kong, with an emphasis on China. Considers women's culture, as well as the influence and presence of Asian cultural expressions in the US. Uses resources in the Boston area, including the MFA, the Children's Museum, and the Sackler collection at Harvard. Taught in English."
        ],
        [
            "inst",
            [
                "E. Teng"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.036[J] Advertising and Media: Comparative Perspectives"
        ],
        [
            "prerec",
            "Same subject as CMS.356[J]\nSubject meets with 21G.190, CMS.888"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Compares modern and contemporary advertising culture in China, the US, and other emerging markets. First half focuses on branding in the old media environment; second half introduces the changing practice of advertising in the new media environment. Topics include branding and positioning, media planning, social media campaigns, cause marketing 2.0, social TV, and mobility marketing. Required lab work includes interactive sessions in branding a team product for the US (or a European country) and China markets. Taught in English and requires no knowledge of Chinese. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.038 China in the News: The Untold Stories"
        ],
        [
            "prerec",
            "Subject meets with 21G.194"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines issues and debates crucial to understanding contemporary Chinese society, culture, and politics. Discusses how cultural politics frames the way in which China is viewed by mass media around the world and by China scholars in the West. Topics include the Beijing Olympic Games; Mao in post-Mao China; the new patriotism; leisure and consumer culture; the rise of the internet and web culture in urban China; media censorship, remix, and creative online culture. Analyzes the central debate over progress and the role played by the state, the market, and citizen activists in engineering social change. Uses documentaries and feature films to illustrate the cultural, social and political changes that have taken place in China since the 1980s. Includes two short writing assignments and a final paper. Taught in English."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.039[J] Gender and Japanese Popular Culture"
        ],
        [
            "prerec",
            "Same subject as 21A.143[J], WGS.154[J]\nSubject meets with 21G.591"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines relationships between identity and participation in Japanese popular culture as a way of understanding the changing character of media, capitalism, fan communities, and culture. Emphasizes contemporary popular culture and theories of gender, sexuality, race, and the workings of power and value in global culture industries. Topics include manga (comic books), hip-hop and other popular music, anime and feature films, video games, contemporary literature, and online communication. Students present analyses and develop a final project based on a particular aspect of gender and popular culture. Several films screened outside of regular class meeting times. Taught in English."
        ],
        [
            "inst",
            [
                "I. Condry"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.040 A Passage to India: Introduction to Modern Indian Culture and Society"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Spring)"
            ]
        ],
        [
            "desc",
            "Introduction to Indian culture through films, short-stories, novels, essays, newspaper articles. Examines some major social and political controversies of contemporary India through discussions centered on India's history, politics and religion. Focuses on issues such as ethnic tension and terrorism, poverty and inequality, caste conflict, the missing women, and the effects of globalization on popular and folk cultures. Particular emphasis on the IT revolution, outsourcing, the new global India and the enormous regional and subcultural differences. Taught in English."
        ],
        [
            "inst",
            [
                "A. Banerjee"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.041[J] Foundations of East Asian Literature and Culture: From Confucius to the Beats"
        ],
        [
            "prerec",
            "Same subject as 21L.040[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21L.040[J]."
        ],
        [
            "inst",
            [
                "W. Denecke"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.042[J] Three Kingdoms: From History to Fiction, Comic, Film, and Game"
        ],
        [
            "prerec",
            "Same subject as 21H.352[J], 21L.492[J], CMS.359[J]\nSubject meets with 21G.133"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Analyzing core chapters of the great Chinese epic novel, Three Kingdoms, and its adaptations across diverse media, considers what underlies the appeal of this classic narrative over the centuries. Through focus on historical events in the period 206 BC to AD 280, examines the representation of power, diplomacy, war, and strategy, and explores the tension among competing models of political authority and legitimacy. Covers basic elements of classical Chinese political and philosophical thought, and literary and cultural history. Final group project involves digital humanities tools. Readings in translation. Films and video in Chinese with English subtitles."
        ],
        [
            "inst",
            [
                "E. Teng"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.043[J] Asian American History: 1865 to 1965"
        ],
        [
            "prerec",
            "Same subject as 21H.107[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Provides an overview of Asian American history between 1865 and 1965 and its relevance for contemporary issues. Covers the first wave of Asian immigration in the 19th century, the rise of anti-Asian movements, the experiences of Asian Americans during WWII, the emergence of the Asian American movement in the 1960s, and the 1965 immigration reform. Examines the role these experiences played in the formation of Asian American ethnicity. Addresses key societal issues such as racial stereotyping, xenophobia, ethnicity and racial formation, citizenship, worker activism, immigrant community building, the \"model minority\" myth, and anti-Asian harassment and violence. Taught in English."
        ],
        [
            "inst",
            [
                "Consult E. Teng"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.044[J] Classics of Chinese Literature in Translation"
        ],
        [
            "prerec",
            "Same subject as 21L.494[J], WGS.235[J]\nSubject meets with 21G.195"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Introduction to some of the major genres of traditional Chinese poetry, fiction, and drama. Intended to give students a basic understanding of the central features of traditional Chinese literary genres, as well as to introduce students to the classic works of the Chinese literary tradition. Works read include Journey to the West, Outlaws of the Margin, Dream of the Red Chamber, and the poetry of the major Tang dynasty poets. Literature read in translation. Taught in English."
        ],
        [
            "inst",
            [
                "E. Teng",
                "W. Denecke"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.045[J] Global Chinese Food: A Historical Overview"
        ],
        [
            "prerec",
            "Same subject as 21H.156[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Introduces the history of Chinese food around the world. Illustrates how the globalization of Chinese food is deeply connected to Chinese migration patterns, expansion of Western influence in Asia, Chinese entrepreneurship, and interethnic relations in places of Chinese settlement. With an overview of earlier periods in Chinese history, focuses on the 18th through 20th centuries, specifically on major events in modern world history that affected the availability and demand for Chinese food. Considers environmental issues in relation to China's changing food systems. Includes a mandatory field trip to Boston Chinatown. Taught in English. Limited to 30."
        ],
        [
            "inst",
            [
                "E. Teng"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.046 Modern Chinese Fiction and Cinema"
        ],
        [
            "prerec",
            "Subject meets with 21G.192"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Covers major works of Chinese fiction and film, from mainland China, Taiwan, and Hong Kong. Focusing on the modern period, examines how Chinese intellectuals, writers, and filmmakers have used artistic works to critically explore major issues in modern Chinese culture and society. Literature read in translation. Taught in English. Enrollment limited."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.048[J] Images of Asian Women: Dragon Ladies and Lotus Blossoms"
        ],
        [
            "prerec",
            "Same subject as 21A.141[J], WGS.274[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21A.141[J]."
        ],
        [
            "inst",
            [
                "M. Buyandelger"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.049[J] French Photography"
        ],
        [
            "prerec",
            "Same subject as 4.674[J], 21H.145[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21H.145[J]. Enrollment limited."
        ],
        [
            "inst",
            [
                "C. Clark"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.052 French Film Classics"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "History and aesthetics of French cinema from the advent of sound to present-day. Treats films in the context of technical processes, the art of narration, directorial style, role of the scriptwriter, the development of schools and movements, the impact of political events and ideologies, and the relation between French and other national cinemas. Films shown with English subtitles. Taught in English."
        ],
        [
            "inst",
            [
                "C. Clark"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.053 Understanding Contemporary French Politics"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Examines the changes in contemporary French society through the study of political debates, reforms and institutions since 1958. Analyzes the deep influence of politics on cultural and social life, despite a decline in political participation. Revisits public controversies and political cleavages, from the Algerian war to postcolonial issues, from the birth of the European Union to the recent financial crisis, and from the moral \"revolution\" of the seventies to the recognition of new families. Course taught in English. Enrollment limited."
        ],
        [
            "inst",
            [
                "B. Perreau"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.054[J] France: Enlightenment and Revolution"
        ],
        [
            "prerec",
            "Same subject as 21H.241[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21H.241[J]."
        ],
        [
            "inst",
            [
                "J. Ravel"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.055[J] Media in Weimar and Nazi Germany (New)"
        ],
        [
            "prerec",
            "Same subject as CMS.311[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject CMS.311[J]. Enrollment limited."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.056[J] The \"Making\" of Modern Europe: 1789-Present"
        ],
        [
            "prerec",
            "Same subject as 21H.143[J]\nSubject meets with 21G.356"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21H.143[J]."
        ],
        [
            "inst",
            [
                "C. Clark"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.057[J] Gender, Race, and Environmental Justice"
        ],
        [
            "prerec",
            "Same subject as 21A.407[J], STS.022[J], WGS.275[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21A.407[J]. Limited to 18."
        ],
        [
            "inst",
            [
                "B. Stoetzer"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.058[J] Race and Migration in Europe"
        ],
        [
            "prerec",
            "Same subject as 21A.132[J]\nSubject meets with 21G.418"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21A.132[J]. Limited to 18."
        ],
        [
            "inst",
            [
                "B. Stoetzer"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.059 Paradigms of European Thought and Culture"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Subject surveys the main currents of European cultural and intellectual history in the modern period. Introduces a set of ideas and arguments that have played a formative role in European culture, and acquaints students with exemplars of critical thought. Readings begin with the Protestant Reformation and move through the French Revolution up to the post-WWII period. Figures to be considered include Luther, Descartes, Kant, Hegel, Rousseau, Smith, Marx, Freud, Beauvoir, and Foucault. Class discussions set these texts into the context of European culture. Topics to be considered are artworks by Goya, David, and Duchamp; the architecture of Schinkel; the music of Bach; and the literature of Goethe. Taught in English."
        ],
        [
            "inst",
            [
                "Consult E. Crocker"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.062[J] Gateway to Japanese Literature and Culture (New)"
        ],
        [
            "prerec",
            "Same subject as 21L.493[J]\nSubject meets with 21G.562"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21L.493[J]."
        ],
        [
            "inst",
            [
                "W. Denecke"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.063 Anime: Transnational Media and Culture"
        ],
        [
            "prerec",
            "Subject meets with 21G.596"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Explores anime (Japanese animated films and TV shows) as a study in flows among media and cultures. Discusses Japan's substantial share of the TV cartoon market and the reasons for anime's worldwide success. Focuses on cultural production and the ways anime cultures are created through the interactive efforts of studios, sponsors, fans, broadcasters, and distributors. Uses anime scholarship and media examples as a means to examine leading theories in media and cultural studies, gender and sexuality, technology and identity, and post-industrial globalization. Taught in English."
        ],
        [
            "inst",
            [
                "I. Condry"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.064 Introduction to Japanese Culture"
        ],
        [
            "prerec",
            "Subject meets with 21G.592"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines the major aesthetic, social, and political elements which have shaped modern Japanese culture and society. Readings on contemporary Japan and historical evolution of the culture are coordinated with study of literary texts, film, and art, along with an analysis of everyday life and leisure activities. Taught in English. Limited to 18."
        ],
        [
            "inst",
            [
                "Consult P. Roquet"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.065[J] Japanese Media Cultures"
        ],
        [
            "prerec",
            "Same subject as CMS.354[J]\nSubject meets with 21G.593"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject CMS.354[J]. Enrollment limited."
        ],
        [
            "inst",
            [
                "Consult P. Roquet"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.066[J] Gateway to Korean Literature and Culture"
        ],
        [
            "prerec",
            "Same subject as 21L.491[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21L.491[J]."
        ],
        [
            "inst",
            [
                "W. Denecke"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.067[J] Digital Media in Japan and Korea"
        ],
        [
            "prerec",
            "Same subject as CMS.351[J]\nSubject meets with 21G.597"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject CMS.351[J]."
        ],
        [
            "inst",
            [
                "P. Roquet"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.068 The Invention of French Theory: A History of Transatlantic Intellectual Life since 1945"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Examines post-WWII French theory. Discusses how theorists such as Lacan, Cixous, Derrida, and Debord were perceived in France and the US. Explores transatlantic intellectual debates since 1989 and the \"new\" French theory. Topics include: communism, decolonization, neo-liberalism, gender and mass media. Taught in English."
        ],
        [
            "inst",
            [
                "B. Perreau"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.070[J] Latin America and the Global Sixties: Counterculture and Revolution"
        ],
        [
            "prerec",
            "Same subject as CMS.355[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject CMS.355[J]. Enrollment limited."
        ],
        [
            "inst",
            [
                "P. Duong"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.072[J] The New Latin American Novel"
        ],
        [
            "prerec",
            "Same subject as CMS.353[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject CMS.353[J]. Enrollment limited."
        ],
        [
            "inst",
            [
                "P. Duong"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.073[J] The Spanish Incubator (New)"
        ],
        [
            "prerec",
            "Same subject as 21L.590[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21L.590[J]. Enrollment limited. Application required; contact Literature Headquarters for details."
        ],
        [
            "inst",
            [
                "M. Resnick"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.075[J] The Global Chinese: Chinese Migration, 1567-Present"
        ],
        [
            "prerec",
            "Same subject as 21H.253[J]\nSubject meets with 21G.196"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines Chinese migration in historical and comparative perspective, beginning in 1567 with the lifting of the imperial ban on private maritime trade. Covers migration to diverse venues across the globe, including tropical colonies, settler societies, Chinese frontiers, and postcolonial metropoles. Topics include the varied roles of Chinese migrants in these diverse venues, the coolie trade and anti-Chinese movements, overseas students, transnational networks, cultural adaptation, and the creolization of Chinese food in migrant communities. Critically examines the degree to which this transnational migration has produced a \"Global Chinese\" identity. Taught in English."
        ],
        [
            "inst",
            [
                "E. Teng"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.077[J] Introduction to the Classics of Russian Literature"
        ],
        [
            "prerec",
            "Same subject as 21L.490[J]\nSubject meets with 21G.618"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Explores the works of classical Russian writers of the 19th and 20th centuries, including stories and novels by Pushkin, Gogol, Dostoevsky, Tolstoy, Chekhov, Bunin, Nabokov, Platonov, and others. Focuses on their approaches to portraying self and society, and on literary responses to fundamental ethical and philosophical questions about justice, freedom, free will, fate, love, loyalty, betrayal, and forgiveness.  Taught in English; students interested in completing some readings and a short writing project in Russian should register for 21G.618."
        ],
        [
            "inst",
            [
                "M. Khotimsky"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.078[J] Latin America Through Film"
        ],
        [
            "prerec",
            "Same subject as 21H.172[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21H.172[J]."
        ],
        [
            "inst",
            [
                "T. Padilla"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.084[J] Introduction to Latin American Studies"
        ],
        [
            "prerec",
            "Same subject as 17.55[J], 21A.130[J], 21H.170[J]\nSubject meets with 21G.784"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 17.55[J]."
        ],
        [
            "inst",
            [
                "T. Padilla",
                "P. Duong"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.085[J] Imperial and Revolutionary Russia: Culture and Politics, 1700-1917"
        ],
        [
            "prerec",
            "Same subject as 21H.244[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21H.244[J]."
        ],
        [
            "inst",
            [
                "E. Wood"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.086[J] Soviet and Post-Soviet Politics and Society: 1917 to the Present"
        ],
        [
            "prerec",
            "Same subject as 17.57[J], 21H.245[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21H.245[J]. Enrollment limited."
        ],
        [
            "inst",
            [
                "E. Wood"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.087[J] Introduction to Russian Studies"
        ],
        [
            "prerec",
            "Same subject as 21H.144[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Explores Russian culture and society by analyzing its unique position at the crossroads of Europe and Asia throughout medieval, Imperial, Soviet, and contemporary periods. Investigates a variety of topics: defining the borders of the country and shaping its relationship with the outside world; changes in living spaces from rural to urban, development of cultural centers; and daily life, customs, and traditions. Includes readings in literature, history, and cultural studies, as well visual arts, music, and film. Limited to 25."
        ],
        [
            "inst",
            [
                "E. Wood",
                "M. Khotimsky"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.094[J] Cinema in Japan and Korea"
        ],
        [
            "prerec",
            "Same subject as CMS.352[J]\nSubject meets with 21G.594"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject CMS.352[J]."
        ],
        [
            "inst",
            [
                "P. Roquet"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.095[J] Cultures of Popular Music in East Asia: Japan, Korea, China"
        ],
        [
            "prerec",
            "Same subject as 21M.297[J]\nSubject meets with 21G.595"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Explores a variety of music cultures in contemporary East Asia. Emphasizes examples from Japan, but forays elsewhere, including South Korea and China. Uses writings, videos, and recordings of musical performances, events, and objects in a variety of contexts to better understand how the concept of culture gives insight into gender, class, sexuality, race, ethnicity, nationhood, and individual identities. Explores ethnographic approaches to musical cultures with a focus on the last thirty years. Topics include Japanese hip-hop, K-Pop idols, Vocaloids (virtual idols), Chinese popular music and protest, street music, streaming and online distribution for global music, and experimental music. Students conduct ethnographic fieldwork and produce sonic presentations. No music experience nor technical expertise required. Taught in English."
        ],
        [
            "inst",
            [
                "I. Condry"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.111 Chinese Calligraphy"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (IAP, Spring)"
            ]
        ],
        [
            "desc",
            "Provides an introduction to the ancient art of Chinese calligraphy and its traditional uses. Studies the history of the Chinese writing system and develops skills through guided reading, classroom discussion, and systematic practice with brush and ink. Students work on a small calligraphy project based on their own interest. Taught in English; no prior knowledge of Chinese language required. Limited to 25."
        ],
        [
            "inst",
            [
                "K. Zhou"
            ]
        ]
    ],
    [
        "head",
        "Chinese"
    ],
    [
        "block",
        [
            "title",
            "21G.101 Chinese I (Regular)"
        ],
        [
            "prerec",
            "Subject meets with 21G.151"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Introduction to modern standard Chinese (Mandarin) with emphasis on developing conversational skills by using fundamental grammatical patterns and vocabulary in functional and culturally suitable contexts. Basic reading and writing are also taught. For graduate credit, see 21G.151. Placement interview with instructors required of students who have had prior exposure to Chinese before or on Reg Day. Limited to 16 per section. No listeners."
        ],
        [
            "inst",
            [
                "Consult H. Liao"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.102 Chinese II (Regular)"
        ],
        [
            "prerec",
            "Subject meets with 21G.152"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.101\" title=\"21G.101\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.101');\">21G.101</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Continuation of 21G.101. For full description, see 21G.101. For graduate credit see 21G.152. Placement interview on or before Reg. Day required of students who have had prior exposure of Chinese elsewhere. Limited to 16 per section. No listeners."
        ],
        [
            "inst",
            [
                "Consult H. Liao"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.103 Chinese III (Regular)"
        ],
        [
            "prerec",
            "Prereq: 21G.102 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Continuing instruction in spoken and written Chinese, with particular emphasis on consolidating basic conversational skills and improving reading confidence and depth. Lab work required. Placement interview with instructors before or on Reg. Day required of students who have had prior exposure to Chinese elsewhere. Limited to 16 per section. No listeners."
        ],
        [
            "inst",
            [
                "Consult H. Liao"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.104 Chinese IV (Regular)"
        ],
        [
            "prerec",
            "Prereq: 21G.103 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Continuation of 21G.103. For full description, see 21G.103. Placement interview on or before Reg. Day required of students who have had prior exposure to Chinese elsewhere. Limited to 16 per section. No listeners."
        ],
        [
            "inst",
            [
                "Consult H. Liao"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.105 Chinese V (Regular): Discovering Chinese Cultures and Societies"
        ],
        [
            "prerec",
            "Prereq: 21G.104 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Students develop more sophisticated conversational and reading skills by combining traditional textbook material with their own explorations of Chinese speaking societies, using the human, literary, and electronic resources available at MIT and in the Boston area. Placement interview on or before Reg. Day required of students who have had prior exposure to Chinese elsewhere. Limited to 16 per section. No listeners."
        ],
        [
            "inst",
            [
                "Consult T. Chen"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.106 Chinese VI (Regular): Discovering Chinese Cultures and Societies"
        ],
        [
            "prerec",
            "Prereq: 21G.105 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Continuation of 21G.105. For full description see 21G.105. Placement interview on or before Reg. Day required of students who have had prior exposure to Chinese elsewhere. Limited to 16 per section. No listeners."
        ],
        [
            "inst",
            [
                "Consult T. Chen"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.107 Chinese I (Streamlined)"
        ],
        [
            "prerec",
            "Subject meets with 21G.157"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "The first term streamlined sequence. Designed for students who have conversational skills (typically gained from growing up in a Chinese speaking environment) without a corresponding level of literacy. For graduate credit see 21G.157. Placement interview on or before Reg. Day required of students who have had prior exposure to Chinese elsewhere. Limited to 16 per section. No listeners."
        ],
        [
            "inst",
            [
                "Consult M. Liang"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.108 Chinese II (Streamlined)"
        ],
        [
            "prerec",
            "Subject meets with 21G.158"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.107\" title=\"21G.107\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.107');\">21G.107</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "The second term streamlined sequence; continuation of 21G.107. The streamlined sequence is designed for students who have conversational skills (typically gained from growing up in a Chinese speaking environment) without a corresponding level of literacy. For graduate credit see 21G.158. Placement interview on or before Reg. Day required of students who have had prior exposure to Chinese elsewhere. Limited to 16 per section. No listeners."
        ],
        [
            "inst",
            [
                "Consult M. Liang"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.109 Chinese III (Streamlined)"
        ],
        [
            "prerec",
            "Prereq: 21G.108 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Intermediate level subject in streamlined sequence. Designed for students who have conversational skills (typically gained from growing up in a Chinese speaking environment) without a corresponding level of literacy. Consolidates conversation skills, improves reading confidence and broadens composition style. Placement interview on or before Reg. Day required of students who have had prior exposure to Chinese elsewhere. Limited to 16 per section. No listeners."
        ],
        [
            "inst",
            [
                "Consult K. Zhou"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.110 Chinese IV (Streamlined)"
        ],
        [
            "prerec",
            "Prereq: 21G.109 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Intermediate level subject in streamlined sequence; continuation of 21G.109. Designed for students who have conversational skills (typically gained from growing up in a Chinese speaking environment) without a corresponding level of literacy. Consolidates conversation skills, improves reading confidence and broadens composition style. Placement interview on or before Reg. Day required of students who have had prior exposure to Chinese elsewhere. Limited to 16 per section. No listeners."
        ],
        [
            "inst",
            [
                "Consult P. Gao"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.112 Intermediate Chinese in Shenzhen"
        ],
        [
            "prerec",
            "Prereq: 21G.103 or 21G.107"
        ],
        [
            "terms",
            [
                "U (IAP)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Taught on-site at Southern University of Science and Technology in Shenzhen, China. Consolidates foundations built in Regular Chinese I-III and Streamlined I; continues instruction of skills in aural comprehension, speaking, reading, and writing. Encourages development of a sensitivity to linguistically-appropriate behavior, introduces extensive vocabulary and usage as a basis for conversational development, and provides a step-by-step guide to the principles and practice of reading and writing Chinese short narratives. Addresses issues of how cultural differences inform and are informed by different linguistic contexts and practices. Taught in Chinese. Limited to 16."
        ],
        [
            "inst",
            [
                "H. Liao"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.113 Chinese V (Streamlined)"
        ],
        [
            "prerec",
            "Prereq: 21G.110 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Advanced level subject in streamlined sequence. Designed for students who have conversational skills (typically gained from growing up in a Chinese speaking environment) without a corresponding level of literacy. Students conduct their own explorations of modern China using online and print materials, as well as interviews with Chinese in the Boston area. Placement interview on or before Reg. Day required of students who have had prior exposure to Chinese elsewhere. Limited to 16 per section. No listeners."
        ],
        [
            "inst",
            [
                "P. Gao"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.118 Advanced Chinese in Shenzhen"
        ],
        [
            "prerec",
            "Prereq: 21G.105 or 21G.109"
        ],
        [
            "terms",
            [
                "U (IAP)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Taught on-site at Southern University of Science and Technology in Shenzhen, China. Builds students' vocabulary through authentic material reading, and improves oral communication skills through discussion of topics related to cultural, social and historical aspects of China, focusing on Shenzhen. Provides extensive listening, speaking, reading practice in discourse, including dialogues with native speakers, narrative and description, with emphasis on cultural, social, and historical issues of China. Taught in Chinese. Limited to 16."
        ],
        [
            "inst",
            [
                "H. Liao"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.120 Business Chinese"
        ],
        [
            "prerec",
            "Prereq: 21G.106, 21G.113, or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Aimed at advanced-level students to enhance language skills and cultural knowledge specific to conducting business in Chinese societies. Topics include the specialization of materials used in commercial, economic, and business contexts; Greater China's economic development, business culture, and etiquette; and case studies from successful international enterprises in China. Students develop project reports based on their own interests. Taught in Chinese. Limited to 16."
        ],
        [
            "inst",
            [
                "Consult P. Gao"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.151 Chinese I (Regular)"
        ],
        [
            "prerec",
            "Subject meets with 21G.101"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Introduction to modern standard Chinese (Mandarin). For a full description, see 21G.101. For undergraduate credit see 21G.101. Limited to 16 per section."
        ],
        [
            "inst",
            [
                "Consult H. Liao"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.152 Chinese II (Regular)"
        ],
        [
            "prerec",
            "Subject meets with 21G.102"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.151\" title=\"21G.151\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.151');\">21G.151</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Continuation of 21G.151. For a description, see 21G.102. For undergraduate credit see 21G.102."
        ],
        [
            "inst",
            [
                "Consult H. Liao"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.157 Chinese I (Streamlined)"
        ],
        [
            "prerec",
            "Subject meets with 21G.107"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Introduction to modern standard Chinese (Mandarin) for students with some speaking ability but little reading ability. For full description, see 21G.107. For undergraduate credit see 21G.107. Limited to 16 per section."
        ],
        [
            "inst",
            [
                "Consult M. Liang"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.158 Chinese II (Streamlined)"
        ],
        [
            "prerec",
            "Subject meets with 21G.108"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.157\" title=\"21G.157\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.157');\">21G.157</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Continuation of 21G.157. For a description see 21G.157. For undergraduate credit see 21G.108."
        ],
        [
            "inst",
            [
                "Consult M. Liang"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.133 Three Kingdoms: From History to Fiction, Comic, Film, and Game (New)"
        ],
        [
            "prerec",
            "Subject meets with 21G.042[J], 21H.352[J], 21L.492[J], CMS.359[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.104\" title=\"21G.104\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.104');\">21G.104</a>, <a href=\"/search/?P=21G.110\" title=\"21G.110\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.110');\">21G.110</a>, or permission of instructor "
            ]
        ],
        [
            "desc",
            "Analyzing core chapters of the great Chinese epic novel, Three Kingdoms, and its adaptations across diverse media, considers what underlies the appeal of this classic narrative over the centuries. Through focus on historical events in the period 206 BC to AD 280, examines the representation of power, diplomacy, war, and strategy, and explores the tension among competing models of political authority and legitimacy. Covers basic elements of classical Chinese political and philosophical thought, and literary and cultural history. Final group project involves digital humanities tools. Readings in translation. Films and video in Chinese with English subtitles. Taught in English with a project that requires research in Chinese. Preference to students in the Chinese minor"
        ],
        [
            "inst",
            [
                "E. Teng"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.190 Advertising and Media: Comparative Perspectives"
        ],
        [
            "prerec",
            "Subject meets with 21G.036[J], CMS.356[J], CMS.888"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.105\" title=\"21G.105\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.105');\">21G.105</a>, <a href=\"/search/?P=21G.110\" title=\"21G.110\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.110');\">21G.110</a>, or permission of instructor "
            ]
        ],
        [
            "desc",
            "Compares modern and contemporary advertising culture in China, the US, and other emerging markets. First half focuses on branding in the old media environment; second half introduces the changing practice of advertising in the new media environment. Topics include branding and positioning, media planning, social media campaigns, cause marketing 2.0, social TV, and mobility marketing. Required lab work includes interactive sessions in branding a team product for the US (or a European country) and China markets. Taught in English with a project that requires research in Chinese. Preference to Chinese minors."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.192 Modern Chinese Fiction and Cinema"
        ],
        [
            "prerec",
            "Subject meets with 21G.046"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.105\" title=\"21G.105\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.105');\">21G.105</a>, <a href=\"/search/?P=21G.110\" title=\"21G.110\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.110');\">21G.110</a>, or permission of instructor "
            ]
        ],
        [
            "desc",
            "Covers major works of Chinese fiction and film, from mainland China, Taiwan, and Hong Kong. Focusing on the modern period, examines how Chinese intellectuals, writers, and filmmakers have used artistic works to critically explore major issues in modern Chinese culture and society. Literature read in translation. Taught in English with a project that requires research in Chinese. Enrollment limited; preference to Chinese minors."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.193 Introduction to East Asian Cultures: From Zen to K-Pop"
        ],
        [
            "prerec",
            "Subject meets with 21G.030[J], WGS.236[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.104\" title=\"21G.104\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.104');\">21G.104</a>, <a href=\"/search/?P=21G.110\" title=\"21G.110\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.110');\">21G.110</a>, or permission of instructor "
            ]
        ],
        [
            "desc",
            "Examines traditional forms of East Asian culture (including literature, art, performance, food, and religion) as well as contemporary forms of popular culture (film, pop music, karaoke, and manga). Covers China, Japan, Korea, Taiwan, and Hong Kong, with an emphasis on China. Considers women's culture, as well as the influence and presence of Asian cultural expressions in the US. Uses resources in the Boston area, including the MFA, the Children's Museum, and the Sackler collection at Harvard. Taught in English with a project that requires research in Chinese. Preference to Chinese minors."
        ],
        [
            "inst",
            [
                "E. Teng"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.194 China in the News: The Untold Stories"
        ],
        [
            "prerec",
            "Subject meets with 21G.038"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.105\" title=\"21G.105\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.105');\">21G.105</a>, <a href=\"/search/?P=21G.110\" title=\"21G.110\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.110');\">21G.110</a>, or permission of instructor "
            ]
        ],
        [
            "desc",
            "Examines issues and debates crucial to understanding contemporary Chinese society, culture, and politics. Discusses how cultural politics frames the way in which China is viewed by mass media around the world and by China scholars in the West. Topics include the Beijing Olympic Games; Mao in post-Mao China; the new patriotism; leisure and consumer culture; the rise of the internet and web culture in urban China; media censorship, remix, and creative online culture. Analyzes the central debate over progress and the role played by the state, the market, and citizen activists in engineering social change. Uses documentaries and feature films to illustrate the cultural, social and political changes that have taken place in China since the 1980s. Includes two short writing assignments and a final paper. Taught in English with a project that requires research in Chinese. Preference to Chinese minors."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.195 Classics of Chinese Literature in Translation"
        ],
        [
            "prerec",
            "Subject meets with 21G.044[J], 21L.494[J], WGS.235[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.104\" title=\"21G.104\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.104');\">21G.104</a>, <a href=\"/search/?P=21G.110\" title=\"21G.110\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.110');\">21G.110</a>, or permission of instructor "
            ]
        ],
        [
            "desc",
            "Introduction to some of the major genres of traditional Chinese poetry, fiction, and drama. Intended to give students a basic understanding of the central features of traditional Chinese literary genres, as well as to introduce students to the classic works of the Chinese literary tradition. Works read include Journey to the West, Outlaws of the Margin, Dream of the Red Chamber, and the poetry of the major Tang dynasty poets. Literature read in translation. Taught in English with a project that requires research in Chinese. Preference to Chinese minors."
        ],
        [
            "inst",
            [
                "E. Teng",
                "W. Denecke"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.196 The Global Chinese: Chinese Migration, 1567-Present"
        ],
        [
            "prerec",
            "Subject meets with 21G.075[J], 21H.253[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.104\" title=\"21G.104\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.104');\">21G.104</a>, <a href=\"/search/?P=21G.110\" title=\"21G.110\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.110');\">21G.110</a>, or permission of instructor "
            ]
        ],
        [
            "desc",
            "Examines Chinese migration in historical and comparative perspective, beginning in 1567 with the lifting of the imperial ban on private maritime trade. Covers migration to diverse venues across the globe, including tropical colonies, settler societies, Chinese frontiers, and postcolonial metropoles. Topics include the varied roles of Chinese migrants in these diverse venues, the coolie trade and anti-Chinese movements, overseas students, transnational networks, cultural adaptation, and the creolization of Chinese food in migrant communities. Critically examines the degree to which this transnational migration has produced a \"Global Chinese\" identity. Taught in English with a project that requires research in Chinese. Preference to students in the Chinese minor."
        ],
        [
            "inst",
            [
                "E. Teng"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.199 Chinese Youths and Web Culture"
        ],
        [
            "prerec",
            "Prereq: 21G.113 and permission of instructor"
        ],
        [
            "terms",
            [
                "U (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Introduces the cultural trends and media habits of Chinese Generation X and the post-1990s generation, and its context of the rise of Web culture. Topics include the influence of the global Web culture on China; the cross-fertilization of youth volunteer culture and Web 2.0; popular sites where Chinese college students and other youths congregate, including BBS forums and social networking platforms; and the debates in online communities that made an impact on Chinese politics and society. Students examine literature on the evolution of Chinese Web culture and conduct exercises using Web 2.0 tools. Taught in Chinese."
        ],
        [
            "inst",
            [
                "J. Wang"
            ]
        ]
    ],
    [
        "head",
        "French"
    ],
    [
        "block",
        [
            "title",
            "21G.301 French I"
        ],
        [
            "prerec",
            "Subject meets with 21G.351"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Introduction to the French language and culture with emphasis on the acquisition of vocabulary and grammatical concepts through active communication. Conducted entirely in French. Exposure to the language via a variety of authentic sources such as the Internet, audio, video and printed materials which help develop cultural awareness as well as linguistic proficiency. Coordinated language lab program. For graduate credit see 21G.351. Limited to 18 per section."
        ],
        [
            "inst",
            [
                "Consult L. Rezvani"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.302 French II"
        ],
        [
            "prerec",
            "Subject meets with 21G.352"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.301\" title=\"21G.301\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.301');\">21G.301</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Continuation of introductory course to the French language and culture with emphasis on acquisition of vocabulary and grammatical concepts through active communication. Conducted entirely in French. Exposure to the language via a variety of authentic sources such as the Internet, audio, video and printed materials which help develop cultural awareness as well as linguistic proficiency. Coordinated language lab. For graduate credit see 21G.352. Limited to 18 per section."
        ],
        [
            "inst",
            [
                "L. Rezvani"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.303 French III"
        ],
        [
            "prerec",
            "Prereq: 21G.302 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Third subject in the French language sequence. Systematic work on grammar and vocabulary expands skills in understanding, speaking, reading and writing in French. Intercultural exploration through a variety of authentic materials, such as music, videos, films, newspapers, and excerpts from literary texts. Limited to 18 per section."
        ],
        [
            "inst",
            [
                "C. Culot"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.304 French IV"
        ],
        [
            "prerec",
            "Prereq: 21G.303 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Fourth subject in the French language sequence. Focuses on language and intercultural understanding. Students work with a variety of materials such as surveys, newspapers, commercials, films and music. Systematic work on grammar and vocabulary expands students' skills in understanding, speaking, reading and writing. Limited to 18 per section."
        ],
        [
            "inst",
            [
                "S. Levet"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.306 French: Communication Intensive I"
        ],
        [
            "prerec",
            "Prereq: None. Coreq: 21G.308, 21G.310, 21G.311, 21G.312, 21G.315, 21G.320[J], 21G.321, or 21G.322[J]; permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Intensive tutorial in writing and speaking for majors. Provides students with enhanced linguistic and cultural fluency for academic or real-world purposes. 21G.307 builds on writing and speaking skills acquired in 21G.306. Conducted entirely in French. Preference to French majors."
        ],
        [
            "inst",
            [
                "Information: B. Perreau"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.307 French: Communication Intensive II"
        ],
        [
            "prerec",
            "Prereq: None. Coreq: 21G.308, 21G.310, 21G.311, 21G.312, 21G.315, 21G.320[J], 21G.321, or 21G.322[J]; permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Intensive tutorial in writing and speaking for majors. Provides students with enhanced linguistic and cultural fluency for academic or real-world purposes. 21G.307 builds on writing and speaking skills acquired in 21G.306. Conducted entirely in French. Preference to French majors."
        ],
        [
            "inst",
            [
                "Information: C. Clark"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.308 Writing (Like the) French"
        ],
        [
            "prerec",
            "Prereq: 21G.304 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "For students who wish to continue with language study before taking upper-level subjects in literature or culture. Emphasis on development of reading and writing skills, review of the basic concepts of French grammar, and acquisition of precise vocabulary through the use of printed materials, short stories, and poems. Taught in French."
        ],
        [
            "inst",
            [
                "C. Culot"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.310 French Conversation: Intensive Practice"
        ],
        [
            "prerec",
            "Prereq: 21G.304 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Training in oral expression including communication skills, fluency, idiomatic French and pronunciation. Discussion materials include short literary and sociological texts, recent films, varied audio and digitized video interviews and the Internet. Taught in French. Limited to 16."
        ],
        [
            "inst",
            [
                "L. Rezvani"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.311 Introduction to French Culture"
        ],
        [
            "prerec",
            "Prereq: 21G.304 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Examines major social and political trends, events, debates and personalities which help place various aspects of contemporary French culture in their historical perspective. Topics include the heritage of the French Revolution, the growth and consequences of colonialism, the role of intellectuals in public debates, the impact of the Occupation, the modernization of the economy and of social structures. Also studied are the sources and meanings of national symbols, monuments, myths and manifestoes. Documents include fiction, films, essays, newspaper articles, and television shows. Recommended for students planning to study abroad. Taught in French."
        ],
        [
            "inst",
            [
                "Consult C. Clark"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.312 Basic Themes in French Literature and Culture"
        ],
        [
            "prerec",
            "Prereq: 21G.304 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Introduction to literary and cultural analysis through the close reading and discussion of texts united by a common theme. Taught in French."
        ],
        [
            "inst",
            [
                "Consult I. Nicholas"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.315 A Window onto Contemporary French Society"
        ],
        [
            "prerec",
            "Prereq: 21G.304 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Intermediate subject designed to help students gradually build an in-depth understanding of France. Focuses on French attitudes and values regarding education, work, family, and institutions. Deals with the differing notions that underlie interpersonal interactions and communication styles, such as politeness, friendship, and formality. Using a Web comparative, cross-cultural approach, students explore a variety of French and American materials, then analyze and compare using questionnaires, opinion polls, news reports (in different media), as well as a variety of historical, anthropological and literary texts. Students involved in team research projects. Attention given to the development of relevant linguistics skills. Recommended for students planning to study and work in France. Taught in French."
        ],
        [
            "inst",
            [
                "S. Levet"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.320[J] Introduction to French Literature"
        ],
        [
            "prerec",
            "Same subject as 21L.620[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.304\" title=\"21G.304\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.304');\">21G.304</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "A basic study of major French literary genres — poetry, drama, and fiction — and an introduction to methods of literary analysis. Authors include: Voltaire, Balzac, Sand, Baudelaire, Apollinaire, Camus, Sartre, Ionesco, Duras, and Tournier. Special attention devoted to the improvement of French language skills. Taught in French."
        ],
        [
            "inst",
            [
                "B. Perreau"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.321 Childhood and Youth in French and Francophone Cultures"
        ],
        [
            "prerec",
            "Prereq: One intermediate subject in French"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: U (Spring)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Studies the transformation of childhood and youth since the 18th century in France, as well as the development of sentimentality within the family in a francophone context. Examines the personification of children, both as a source of inspiration for artistic creation and a political ideal aimed at protecting future generations. Considers various representations of childhood and youth in literature (e.g., Pagnol, Proust, Sarraute, Laye, Morgiévre), movies (e.g., Truffaut), and songs (e.g., Brel, Barbara). Taught in French."
        ],
        [
            "inst",
            [
                "B. Perreau"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.322[J] Frenchness in an Era of Globalization"
        ],
        [
            "prerec",
            "Same subject as 21H.242[J]"
        ],
        [
            "terms",
            [
                "Prereq: One intermediate subject in French or permission of instructor "
            ]
        ],
        [
            "desc",
            "Approaches the question of what constitutes Frenchness in today's era of globalization through issues of memory, belonging, and cultural production. Explores the role of timeless traditions - common technologies, an internationally-spoken language, monuments open to the world, and foods such as wine and cheese - remain quintessentially French. Also covers recent scandals about France's role in the world, such as its colonial identity and Dominique Strauss-Kahn's New York debacle. Taught in French. Limited to 18."
        ],
        [
            "inst",
            [
                "C. Clark"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.325[J] New Culture of Gender: Queer France"
        ],
        [
            "prerec",
            "Same subject as WGS.233[J]"
        ],
        [
            "terms",
            [
                "Prereq: One intermediate subject in French "
            ]
        ],
        [
            "desc",
            "Addresses the place of contemporary queer identities in French discourse. Discusses the new generation of queer authors and their principal concerns. Introduces students to the main classical references of queer subcultures, from Proust and Vivien to Hocquenghem and Wittig. Examines current debates on post-colonial and globalized queer identities through essays, songs, movies, and novels. Authors include Didier Eribon, Anne Garréta, Abdellah Taïa, Anne Scott, and Nina Bouraoui. Taught in French."
        ],
        [
            "inst",
            [
                "B. Perreau"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.326 Global Africa: Creative Cultures"
        ],
        [
            "prerec",
            "Subject meets with 21A.136[J], 21G.026[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.304\" title=\"21G.304\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.304');\">21G.304</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Examines contemporary and historical cultural production on and from Africa across a range of registers, including literary, musical and visual arts, material culture, and science and technology. Employs key theoretical concepts from anthropology and social theory to analyze these forms and phenomena. Uses case studies to consider how Africa articulates its place in, and relationship to, the world through creative practices. Discussion topics largely drawn from Francophone and sub-Saharan Africa, but also from throughout the continent and the African diaspora. Taught in English with a project that requires research in French. Limited to 18."
        ],
        [
            "inst",
            [
                "A. Edoh"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.328 African Migrations"
        ],
        [
            "prerec",
            "Subject meets with 21A.137[J], 21G.028[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.304\" title=\"21G.304\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.304');\">21G.304</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Examines West African migration to France and to the United States from the early 20th century to the present. Centering the experiences of African social actors and historicizing recent dynamics, students consider what migration across these three regions reveals about African projects of self-determination, postcolonial nation-building, and global citizenship. Students also comparatively analyze the workings of contemporary French and American societies, in particular, the articulations of race and citizenship in the two nations. Taught in English with a project that requires research in French. Limited to 18."
        ],
        [
            "inst",
            [
                "A. Edoh"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.341 Contemporary French Film and Social Issues"
        ],
        [
            "prerec",
            "Prereq: 21G.304 or permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: U (Fall)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Issues in contemporary French society as expressed through movies made in the 1990s. Topics include France's national self-image, the women's movement, sexuality and gender, family life and class structure, post-colonialism and immigration, and American cultural imperialism. Films by Lelouch, Audiard, Doillon, Denis, Klapisch, Resnais, Rouan, Balasko, Collard, Dridi, Kassovitz, and others. Readings from French periodicals. Films shown with English subtitles. Taught in French."
        ],
        [
            "inst",
            [
                "C. Clark"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.342 French Pop Music"
        ],
        [
            "prerec",
            "Prereq: 21G.304 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Studies the literary, political and social traditions of \"la chanson française\" from the early 20th century to the present. Discusses the influences of world music on both French and francophone songs. Students investigate individual musicians' careers, as well as generational phenomena, such as cabaret songs, yéyés, and French rap. Examines the impact of social media on the music industry in France, the role of television and cinema, and the influence of dance and living art. Taught in French. Limited to 18."
        ],
        [
            "inst",
            [
                "B. Perreau"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.344[J] French Feminist Literature: Yesterday and Today"
        ],
        [
            "prerec",
            "Same subject as 21L.621[J], WGS.321[J]"
        ],
        [
            "terms",
            [
                "Prereq: One intermediate subject in French or permission of instructor "
            ]
        ],
        [
            "desc",
            "Explores feminist literary voices in France throughout the ages. Discusses the theory that the power of feminist writing lies in its ability to translate dominant language into a language of one's own. Studies lifestyles, family norms, political representation, social movements, as well as the perception of the body. Investigates how feminist genealogies redefine the relationship between belonging and knowledge through a dialogue between several generations of women writers. Taught in French. Limited to 18."
        ],
        [
            "inst",
            [
                "B. Perreau"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.346 Topics in Modern French Literature and Culture"
        ],
        [
            "prerec",
            "Prereq: One intermediate subject in French"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Close study of history and criticism of French literature, focusing on a specific group of writers, a movement, a theme, a critical or theoretical issue, or an analytic approach. May be repeated for credit with permission of instructor. Taught in French."
        ],
        [
            "inst",
            [
                "Consult B. Perreau"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.347 Social and Literary Trends in Contemporary Short French Fiction"
        ],
        [
            "prerec",
            "Prereq: One intermediate subject in French or permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Fall)"
            ]
        ],
        [
            "desc",
            "Examines short stories and short novels published in France during the past 20 years, with emphasis on texts related to the dominant social and cultural trends. Themes include the legacy of France's colonial experience, the re-examination of its wartime past, memory and the Holocaust, the specter of AIDS, changing gender relationships, new families, the quest for personal identity, and immigration narratives. Covers a wide variety of authors, including Christine Angot, Nina Bouraoui, Herve Guibert, and Patrick Modiano. Taught in French."
        ],
        [
            "inst",
            [
                "B. Perreau"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.348 Global Paris"
        ],
        [
            "prerec",
            "Prereq: One intermediate subject in French or permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Spring)"
            ]
        ],
        [
            "desc",
            "Investigates Paris' oversized status as a global capital by looking at the events, transformations, cultures, and arts for which the city is known. Explores Paris as a magnet for immigrants, and how their presence has transformed the city. Takes into account the city as a mythic place, dreamed of and reconstructed as far away as Bollywood and Las Vegas. Provides a deeper understanding of Paris and its current place in French and global cultures. Taught in French."
        ],
        [
            "inst",
            [
                "C. Clark"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.353 Understanding Contemporary French Politics"
        ],
        [
            "prerec",
            "Prereq: 21G.304 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Examines French politics since 1958. Analyzes how politics has deeply influenced cultural and social life in France, including daily interactions. Questions public controversies and history's political cleavages, from the Algerian war to postcolonial issues, from the birth of the European construction to the Covid crisis. To explore French institutions and understand the impact of political issues in contemporary France, students \"run\" for the French presidency by preparing historical notes, delivering speeches, participating in a first-round presidential debate, and submitting a final political statement. Taught in French. Limited to 25."
        ],
        [
            "inst",
            [
                "B. Perreau"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.356 The \"Making\" of Modern Europe: 1789-Present"
        ],
        [
            "prerec",
            "Subject meets with 21G.056[J], 21H.143[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.304\" title=\"21G.304\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.304');\">21G.304</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Provides an overview of European history from 1789 to the present. Explores how the ideas of \"European\" and \"modern\" have been defined over time. Explores major events and the evolution of major tensions and issues that consumed Europe and Europeans through the period, including questions of identity, inclusion/exclusion, religion, and equality. Places major emphasis on the fiction, visual culture, and films of the century as the products and evidence of political, social and cultural change. Taught in English with a project that requires research in French."
        ],
        [
            "inst",
            [
                "C. Clark"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.351 French I"
        ],
        [
            "prerec",
            "Subject meets with 21G.301"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Introduction to the French language and culture with emphasis on acquisition of vocabulary and grammatical concepts through active communication. Conducted entirely in French. Exposure to the language via a variety of authentic sources such as the Internet, audio, video and printed materials which help develop cultural awareness and linguistic proficiency. Coordinated language lab program. Limited to 18 per section."
        ],
        [
            "inst",
            [
                "L. Rezvani"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.352 French II"
        ],
        [
            "prerec",
            "Subject meets with 21G.302"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.351\" title=\"21G.351\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.351');\">21G.351</a> "
            ]
        ],
        [
            "desc",
            "Continuation of introductory course to the French language and culture with emphasis on acquisition of vocabulary and grammatical concepts through active communication. Conducted entirely in French. Exposure to the language via a variety of authentic sources such as the Internet, audio, video and printed materials which help develop cultural awareness as well as linguistic proficiency. Coordinated language lab. Same as 21G.302, but for graduate credit. Limited to 18 per section."
        ],
        [
            "inst",
            [
                "L. Rezvani"
            ]
        ]
    ],
    [
        "head",
        "German"
    ],
    [
        "block",
        [
            "title",
            "21G.401 German I"
        ],
        [
            "prerec",
            "Subject meets with 21G.451"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Introduction to German language and culture. Acquisition of vocabulary and grammatical concepts through active communication. A variety of contemporary sources, including online as well as printed materials, audio, and video, provide direct exposure to German language and culture. Development of effective basic communication skills to participate in everyday conversation and cultural situations. For graduate credit, see 21G.451. Limited to 18 per section."
        ],
        [
            "inst",
            [
                "A. Nguyen"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.402 German II"
        ],
        [
            "prerec",
            "Subject meets with 21G.452"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.401\" title=\"21G.401\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.401');\">21G.401</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Expansion of basic communication skills and further development of linguistic and cultural competencies. Review and completion of basic grammar, building of vocabulary, and practice in writing short essays. Reading of short literary texts. Exposure to history and culture of the German-speaking world through contemporary online materials, audio, and video. For graduate credit see 21G.452. Limited to 18 per section."
        ],
        [
            "inst",
            [
                "D. Jaeger"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.403 German III"
        ],
        [
            "prerec",
            "Prereq: 21G.402 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Expands skills in speaking, reading, listening, and writing and cultural competency. Develops analytic and interpretative skills through media selections on contemporary issues in the German-speaking world. Discussions and compositions as well as review of grammar and development of vocabulary-building strategies. Recommended for students with two years of high school German. Limited to 18 per section."
        ],
        [
            "inst",
            [
                "D. Jaeger"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.404 German IV"
        ],
        [
            "prerec",
            "Prereq: 21G.403 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Discussion and exploration of topics in their current cultural, social, political, and historical contexts in the German-speaking world. Further refinement of oral and written expression and expansion of communicative competence in practical everyday situations. Development of interpretive skills, using literary texts and contemporary media texts (film, TV broadcasts, Web materials). Limited to 18 per section."
        ],
        [
            "inst",
            [
                "D. Jaeger"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.406 German: Communication Intensive I"
        ],
        [
            "prerec",
            "Prereq: None. Coreq: 21G.409, 21G.410, 21G.412, 21G.414, 21G.416, 21G.417, 21G.418, or 21G.420; permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Intensive tutorial in writing and speaking for majors. Provides students with enhanced linguistic and cultural fluency for academic or real-world purposes. 21G.407 builds on writing and speaking skills acquired in 21G.406. Conducted entirely in German. Preference to German majors."
        ],
        [
            "inst",
            [
                "Information: J. Scheib"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.407 German: Communication Intensive II"
        ],
        [
            "prerec",
            "Prereq: None. Coreq: 21G.409, 21G.410, 21G.412, 21G.414, 21G.416, 21G.417, 21G.418, or 21G.420; permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Intensive tutorial in writing and speaking for majors. Provides students with enhanced linguistic and cultural fluency for academic or real-world purposes. 21G.407 builds on writing and speaking skills acquired in 21G.406. Conducted entirely in German. Preference to German majors."
        ],
        [
            "inst",
            [
                "Information: J. Scheib"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.408 German Conversation Practice: Online Immersion (New)"
        ],
        [
            "prerec",
            "Prereq: 21G.403 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (IAP)"
            ]
        ],
        [
            "desc",
            "Focuses on conversational German. Practices communication strategies for a variety of every day conversational situations as well as specific strategies as to how to keep \"things going\" in a conversation and take turns in a conversation. Also practices on how to present oneself in a professional and academic setting in German. There is plenty of opportunity to converse and present themes and topics relevant and current to the German-speaking world. There is one individual student-instructor conference during the term. Taught via live Zoom sessions. Offered during IAP only. Limited to 18 for pedagogical reasons."
        ],
        [
            "inst",
            [
                "D. Jaeger"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.409 Advanced German: Visual Arts, Media, Creative Expression"
        ],
        [
            "prerec",
            "Prereq: 21G.404"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: U (Spring)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Students develop their spoken and written language skills via storytelling, drama, interpretative speaking, poetry slam, writing short, creative texts; and by reading contemporary prose, plays, and poetry. Explores different art forms such as short film, photography, installation and digital art, and commercials. Discusses works by Yoko Tawada, Ernst Jandl, and Babak Saed, among others. Students create their own mini-film, commercial, or multimedia work. Taught in German."
        ],
        [
            "inst",
            [
                "D. Jaeger"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.410 Advanced German: Communication for Professionals"
        ],
        [
            "prerec",
            "Prereq: 21G.404"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Exposes students to current issues and language use in German technology, business, and international industrial relations; discusses ramifications of these issues in a larger social and cultural context. Prepares students who wish to work or study in a German-speaking country. Focuses on specialized vocabulary and systematic training in speaking and writing skills to improve fluency and style. Emphasizes communicative strategies that are crucial in a working environment. Includes discussion and analysis of newspaper and magazine articles, modern expository prose, and extensive use of online material. Taught in German."
        ],
        [
            "inst",
            [
                "R. Sondermann"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.411 Conflict, Contest, Controversy: A Literary Investigation of German Politics (New)"
        ],
        [
            "prerec",
            "Prereq: 21G.404 or permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: U (Fall)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Investigates political and historical happenings in German-speaking countries through an examination of politically informed literature and art from the past 120 years. Moves topically, analyzing a wide range of genres and literary movements through lenses such as propaganda, religion, art and extremism, immigration and language, and imaginaries of both the past and the future. Focuses on exploring the dialogues and points of contact between creators and historic- political moments from the early 1900s to the present day, unearthing answers to questions about the past, present, and future of German identity. Taught in German. 18 for pedagogical reasons."
        ],
        [
            "inst",
            [
                "E. Goodling"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.412 Advanced German: Literature and Culture"
        ],
        [
            "prerec",
            "Prereq: 21G.404 or permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Spring)"
            ]
        ],
        [
            "desc",
            "Explores representative and influential works from the 19th century to the present, through literary texts (short prose, drama, poetry), radio plays, art, animated short film, and architecture. Discusses the construction and social function of these works. Provides students with ample opportunity to enhance their German orally and in writing. Topics include questions of how Germany is shaped by its history, debates about identity and identity formation, technology and the human as machine, science and ethics in the context of the present climate emergency. Includes works by E.T.A. Hoffmann, Kafka, Dürrenmatt, and Herta Müller. Taught in German."
        ],
        [
            "inst",
            [
                "D. Jaeger"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.414 German Culture, Media, and Society"
        ],
        [
            "prerec",
            "Prereq: 21G.404"
        ],
        [
            "terms",
            [
                "U (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Investigates current trends and topics in German literature, theater, film, television, radio, and other media arts productions. Analyzes media texts in the context of their production, reception, and distribution as well as the public debates initiated by these works. Students have the opportunity to discuss topics with a writer, filmmaker, and/or media artist from Germany. Taught in German. Topics vary from term to term."
        ],
        [
            "inst",
            [
                "K. Fendt"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.416 20th- and 21st-Century German Literature"
        ],
        [
            "prerec",
            "Prereq: 21G.404"
        ],
        [
            "terms",
            [
                "U (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Introduces students to important 20th- and 21st-century literary texts and connects them to the often dramatic course of German history in the last century. Surveys German literature from the beginning of the 20th century to the most recent post-unification texts. Each term focuses on a different broader theme. May be repeated for credit with permission of instructor. Taught in German."
        ],
        [
            "inst",
            [
                "Consult Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.417 Cultural Geographies of Germany: Nature, Culture, and Politics"
        ],
        [
            "prerec",
            "Prereq: 21G.404 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Examines the relationship between nature, geography, and power in 20th- and 21st-century German culture. Familiarizes students with a series of themes in literature, science, engineering, urban planning and everyday life that have played a central role in German national imaginaries and concepts of citizenship. Engaging specific examples and historical, ethnographic, literary and visual material, students explore how human-environment relations have figured prominently in German national identity, its economic power, and global connections. Taught in German."
        ],
        [
            "inst",
            [
                "B. Stoetzer"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.418 Race and Migration in Europe"
        ],
        [
            "prerec",
            "Subject meets with 21A.132[J], 21G.058[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.404\" title=\"21G.404\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.404');\">21G.404</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Addresses the shifting politics of nation, ethnicity, and race in the context of migration and globalization in Germany and Europe. Provides students with analytical tools to approach global concerns and consider Europe and Germany from cross-cultural and interdisciplinary perspectives. Familiarizes students with the ways in which histories of migration, travel, and colonial encounters shape contemporary Europe. Introduces the concepts of transnationalism, diasporic cultures, racism, ethnicity, asylum, and mobility via case studies and materials, including film, ethnography, fiction, and autobiography. Taught in English with a project that requires research and writing in German. Limited to 18."
        ],
        [
            "inst",
            [
                "B. Stoetzer"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.419 City Living: Ethnographies of Urban Worlds"
        ],
        [
            "prerec",
            "Subject meets with 21A.402[J], 21G.029[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.404\" title=\"21G.404\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.404');\">21G.404</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Introduces the ways in which anthropologists have studied cities. Addressing the question of what constitutes the boundaries of life in the city, students familiarize themselves with key themes - such as the relation between city and countryside, space and place, urban economies, science, globalization, migration, nature/culture, kinship, and race, gender, class and memory - that have guided anthropological analyses of cities across the world. Via engagement with case studies and their own small fieldwork projects, students gain experience with different ethnographic strategies for documenting urban life. Taught in English with a project that requires research and writing in German. Limited to 25 across 21A.402[J] and 21G.419."
        ],
        [
            "inst",
            [
                "B. Stoetzer"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.420 Visual Histories: German Cinema 1945 to Present"
        ],
        [
            "prerec",
            "Prereq: 21G.404 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Studies the history, aesthetics, and cultural contexts of German film since the end of World War II. Explores films of the \"New German Cinema\" by filmmakers Fassbinder, Wenders, Herzog, and others. Investigates and compares different film traditions of East and West Germany, new aesthetic styles of the \"Berlin School\" after the fall of the Berlin wall, and new filmic concepts in contemporary productions, including films from filmmakers with migration backgrounds. Special focuses on the analysis of the language of film, different genres, and aesthetic traditions in their historical and societal contexts. Taught in German.  Limited to 18."
        ],
        [
            "inst",
            [
                "K. Fendt"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.451 German I"
        ],
        [
            "prerec",
            "Subject meets with 21G.401"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.451\" title=\"21G.451\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.451');\">21G.451</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Introduction to German language and culture. Acquisition of vocabulary and grammatical concepts through active communication. A variety of contemporary sources, such as online as well as printed materials, audio, and video, provide direct exposure to German language and culture. Development of effective basic communication skills to participate in everyday conversation and cultural situations. For undergraduate credit, see 21G.401. Limited to 18 per section."
        ],
        [
            "inst",
            [
                "A. Nguyen"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.452 German II"
        ],
        [
            "prerec",
            "Subject meets with 21G.402"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.451\" title=\"21G.451\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.451');\">21G.451</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Expansion of basic communication skills and further development of linguistic and cultural competencies. Review and completion of basic grammar, building of vocabulary, and practice in writing short essays. Reading of short literary texts. Exposure to history and culture of the German-speaking world through contemporary online materials, audio, and video. For undergraduate credit, see 21G.402. Limited to 18 per section."
        ],
        [
            "inst",
            [
                "D. Jaeger"
            ]
        ]
    ],
    [
        "head",
        "Japanese"
    ],
    [
        "block",
        [
            "title",
            "21G.501 Japanese I"
        ],
        [
            "prerec",
            "Subject meets with 21G.551"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Introduction to modern standard Japanese. Emphasis on developing proficiency in speaking and listening, using basic grammar and vocabulary. Basic skills in reading and writing are also taught. Lab work required. For graduate credit see 21G.551. Limited to 16 per section."
        ],
        [
            "inst",
            [
                "Consult M. Ikeda"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.502 Japanese II"
        ],
        [
            "prerec",
            "Subject meets with 21G.552"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.501\" title=\"21G.501\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.501');\">21G.501</a> or (placement test and permission of instructor) "
            ]
        ],
        [
            "desc",
            "Enhancement of the four basic skills. Extension of basic grammar. Vocabulary and kanji (Chinese characters) building. Lab work required. For graduate credit see 21G.552. Limited to 16 per section."
        ],
        [
            "inst",
            [
                "Consult M. Ikeda"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.503 Japanese III"
        ],
        [
            "prerec",
            "Prereq: 21G.502 or (placement test and permission of instructor)"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Students further develop their skills in speaking, listening, reading and writing. Involves continued vocabulary and kanji building. Coordinated language lab. Limited to 16 per section."
        ],
        [
            "inst",
            [
                "Consult T. Aikawa"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.504 Japanese IV"
        ],
        [
            "prerec",
            "Prereq: 21G.503 or (placement test and permission of instructor)"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Review and expansion of basic skills. Emphasis on application of basic grammar and vocabulary in various situations. Lab work required. Limited to 16 per section."
        ],
        [
            "inst",
            [
                "Consult M. Ikeda"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.505 Japanese V"
        ],
        [
            "prerec",
            "Prereq: 21G.504 or (Placement test and permission of instructor)"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Fall)"
            ]
        ],
        [
            "desc",
            "Systematic development of reading, writing, and oral communication skills. Introduction to advanced grammar that deepens the understanding of Japanese culture and society through reading and discussion. Lab work required. Limited to 16 per section."
        ],
        [
            "inst",
            [
                "Consult T. Aikawa"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.S55 Special Subject: Japanese V"
        ],
        [
            "prerec",
            "Prereq: 21G.504 or (Placement test and permission of instructor)"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Experimental version of 21G.505, which offers a combination of in-person and synchronous remote instruction. Aims to achieve simultaneous progression of four skills — listening, speaking, reading, and writing. Immerses students in various aspects of Japanese culture through authentic everyday Japanese media. Licensed for Fall 2023 by the Committee on Curricula. Limited to 16 for pedagogical reasons."
        ],
        [
            "inst",
            [
                "T. Aikawa"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.506 Japanese VI"
        ],
        [
            "prerec",
            "Prereq: 21G.505 or (Placement test and permission of instructor)"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Spring)"
            ]
        ],
        [
            "desc",
            "Continuation of 21G.505. Further development of reading, writing, and oral communication skills. Extension of advanced grammar and further enhancement of advanced vocabulary. Variety of cultural elements studied through readings, video, and discussion. Lab work required."
        ],
        [
            "inst",
            [
                "Consult T. Aikawa"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.S56 Special Subject: Japanese VI"
        ],
        [
            "prerec",
            "Prereq: 21G.505 or (Placement test and permission of instructor)"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Experimental version of 21G.506, which offers a combination of in-person and remote instruction. Aims to achieve simultaneous progression of four skills — listening, speaking, reading, and writing. Immerses students in various aspects of Japanese culture through authentic everyday Japanese media and engaging in multiple task or project-based activities. Licensed for Spring 2024 by the Committee on Curricula. Limited to 16 for pedagogical reasons."
        ],
        [
            "inst",
            [
                "T. Aikawa"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.510 Project-based Japanese Learning with Multimedia"
        ],
        [
            "prerec",
            "Prereq: 21G.506 or (Placement test and permission of instructor)"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Builds advanced Japanese skills that can be applied to real-life issues and/or problems through project-based learning. Focuses on topics in technology, science, and society, such as AI, robotics, environment issues, social justice, the global pandemic, etc. Develops communicative skills (e.g., explaining, expressing opinions, describing) and expands vocabularies and expressions through class debates and discussions. Students conduct two projects (individual and group) to create quality end-products, using digital technologies (e.g., video, 360 images, VR). In-class time devoted to project progress reports and tangible outcomes; Zoom sessions are used for questions and individualized feedback about the projects. Taught entirely in Japanese. Limited to 16 for pedagogical reasons."
        ],
        [
            "inst",
            [
                "T. Aikawa"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.551 Japanese I"
        ],
        [
            "prerec",
            "Subject meets with 21G.501"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Introduction to modern standard Japanese. Emphasis on developing proficiency in speaking and listening, using basic grammar and vocabulary. Basic skills in reading and writing are also taught. Lab work required. Same as 21G.501, but for graduate credit.  Limited to 16 per section."
        ],
        [
            "inst",
            [
                "Consult M. Ikeda"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.552 Japanese II"
        ],
        [
            "prerec",
            "Subject meets with 21G.502"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.551\" title=\"21G.551\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.551');\">21G.551</a> or (placement test and permission of instructor) "
            ]
        ],
        [
            "desc",
            "Enhancement of the four basic skills. Extension of basic grammar. Vocabulary and kanji (Chinese characters) building. Lab work required. Same as 21G.502, but for graduate credit. Limited to 16 per section."
        ],
        [
            "inst",
            [
                "Consult W. Maekawa"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.554 Inventing the Samurai"
        ],
        [
            "prerec",
            "Subject meets with 21H.154"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.504\" title=\"21G.504\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.504');\">21G.504</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Explores the historical origins of the Japanese warrior class as well as its reinvention throughout the archipelago's history. Special focus on the pre-modern era (200-1600 CE). Highlights key historical contexts including the rise of the imperial court, interactions with the broader world, and the establishment of a warrior-dominated state. Also considers the modern imaginations and uses of the warrior figure. Taught in English with a project that requires research in Japanese. Preference to Japanese minors."
        ],
        [
            "inst",
            [
                "H. Nagahara"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.555 Modern Japan: 1600 to the Present"
        ],
        [
            "prerec",
            "Subject meets with 21H.155"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.504\" title=\"21G.504\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.504');\">21G.504</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Surveys Japanese history from the establishment of the Tokugawa shogunate in 1603 to the present and explores the local and global nature of modernity in Japan. Highlights key themes, including the emergence of a modern nation-state, the rise and fall of the Japanese Empire, the development of mass consumer culture and the middle class, and the continued importance of historical memory in Japan today. Taught in English with a project that requires research in Japanese. Preference to Japanese minors."
        ],
        [
            "inst",
            [
                "H. Nagahara"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.556 World War II in Asia"
        ],
        [
            "prerec",
            "Subject meets with 21H.354"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.504\" title=\"21G.504\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.504');\">21G.504</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Examines World War II in the Asia-Pacific region, starting with the rise of the Japanese Empire after World War I and ending with the Allied occupation of Japan from 1945 to 1952. Highlights the diverse and, at times, contradictory forces in politics, society, and culture that shaped the wartime experiences of the empire's inhabitants. Taught in English with a project that requires research in Japanese. Preference to Japanese minors."
        ],
        [
            "inst",
            [
                "H. Nagahara"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.562 Gateway to Japanese Literature and Culture (New)"
        ],
        [
            "prerec",
            "Subject meets with 21G.062[J], 21L.493[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.504\" title=\"21G.504\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.504');\">21G.504</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Surveys the nature, history, and distinctive features of Japanese literature and cultural history from the beginnings through the threshold of modernity. Examines various genres of poetry, historiography and mythological lore, prose tales and fiction, diaries, essays, Noh and puppet plays, short stories and novels; and helps students appreciate the texts' relevance in the historical and cultural context in which authors wrote them, in the broader context of literary traditions from around the world, and for the humanistic and aesthetic power that make them poignant to us today. Showcases how authors increasingly enjoyed adapting, redoing, and satirizing earlier models, while constantly developing new expressive forms suited to the urgent needs of their time. Includes an eco-literature lab, a creative writing lab, and a history-writing lab for collaborative experimentation. Taught in English with a project in Japanese. "
        ],
        [
            "inst",
            [
                "W. Denecke"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.591 Gender and Japanese Popular Culture"
        ],
        [
            "prerec",
            "Subject meets with 21A.143[J], 21G.039[J], WGS.154[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.504\" title=\"21G.504\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.504');\">21G.504</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Examines relationships between identity and participation in Japanese popular culture as a way of understanding the changing character of media, capitalism, fan communities, and culture. Emphasizes contemporary popular culture and theories of gender, sexuality, race, and the workings of power and value in global culture industries. Topics include manga (comic books), hip-hop and other popular music, anime and feature films, video games, contemporary literature, and online communication. Students present analyses of materials during in-class discussions and develop a final project based on a particular aspect of gender and popular culture. Several films screened outside of regular class meeting times. Taught in English with a project that requires research in Japanese. Preference to Japanese minors."
        ],
        [
            "inst",
            [
                "I. Condry"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.592 Introduction to Japanese Culture"
        ],
        [
            "prerec",
            "Subject meets with 21G.064"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.504\" title=\"21G.504\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.504');\">21G.504</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Examines the major aesthetic, social, and political elements that have shaped modern Japanese culture and society. Includes readings on contemporary Japan and the historical evolution of the culture. Students study literary texts, film and art, and analyze everyday life and leisure activities. Taught in English with a project that requires research in Japanese. Limited to 18; preference to Japanese minors."
        ],
        [
            "inst",
            [
                "Consult P. Roquet"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.593 Japanese Media Cultures"
        ],
        [
            "prerec",
            "Subject meets with 21G.065[J], CMS.354[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.504\" title=\"21G.504\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.504');\">21G.504</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Examines storytelling media in twentieth and twenty-first century Japan, situating emerging media aesthetics and practices alongside broader shifts in cultural and social life. Engages with pivotal works in a wide range of media including film, literature, anime, manga, and video games, as well as critical concepts in Japanese media studies. Taught in English with a project that requires research in Japanese. Preference to Japanese minors."
        ],
        [
            "inst",
            [
                "Consult P. Roquet"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.594 Cinema in Japan and Korea"
        ],
        [
            "prerec",
            "Subject meets with 21G.094[J], CMS.352[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.504\" title=\"21G.504\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.504');\">21G.504</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Focuses on landmark art cinema from both countries while providing a thorough introduction to film style. Each week examines a different component of film form, using the close analysis of specific films in their cultural and historical context. Explores the use of video essays as a form of critical analysis. Taught in English with a project that requires research in Japanese. Preference to Japanese minors. Limited to 18."
        ],
        [
            "inst",
            [
                "P. Roquet"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.595 Cultures of Popular Music in East Asia: Japan, Korea, China"
        ],
        [
            "prerec",
            "Subject meets with 21G.095[J], 21M.297[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.504\" title=\"21G.504\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.504');\">21G.504</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Explores a variety of music cultures in contemporary East Asia. Emphasizes examples from Japan, but forays elsewhere, including South Korea and China. Uses writings, videos, and recordings of musical performances, events, and objects in a variety of contexts to better understand how the concept of culture gives insight into gender, class, sexuality, race, ethnicity, nationhood, and individual identities. Explores ethnographic approaches to musical cultures with a focus on the last thirty years. Topics include Japanese hip-hop, K-Pop idols, Vocaloids (virtual idols), Chinese popular music and protest, street music, streaming and online distribution for global music, and experimental music. Students conduct ethnographic fieldwork and produce sonic presentations. No music experience nor technical expertise required. Taught in English with a project that requires research in Japanese."
        ],
        [
            "inst",
            [
                "I. Condry"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.596 Anime: Transnational Media and Culture"
        ],
        [
            "prerec",
            "Subject meets with 21G.063"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.504\" title=\"21G.504\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.504');\">21G.504</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Explores anime (Japanese animated films and TV shows) as a study in flows among media and cultures. Discusses Japan's substantial share of the TV cartoon market and the reasons for anime's worldwide success. Focuses on cultural production and the ways anime cultures are created through the interactive efforts of studios, sponsors, fans, broadcasters, and distributors. Uses anime scholarship and media examples as a means to examine leading theories in media and cultural studies, gender and sexuality, technology and identity, and post-industrial globalization. Taught in English with a project that requires research in Japanese. Preference to Japanese minors."
        ],
        [
            "inst",
            [
                "I. Condry"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.597 Digital Media in Japan and Korea"
        ],
        [
            "prerec",
            "Subject meets with 21G.067[J], CMS.351[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.504\" title=\"21G.504\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.504');\">21G.504</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Examines the social, cultural, and political stakes of digital culture in Japan and Korea. Focuses on digital media use (and abuse), including the internet, streaming and mobile media, gaming, robots, and augmented realities; the digital remediation of older media; and methods for the study of online life. By considering how digital media use has developed in each country and reshaped identity, politics, public space, and creative practice, students build a conceptual and critical vocabulary for the comparative study of algorithmic cultures. Taught in English with a project that requires research in Japanese. Preference to Japanese minors."
        ],
        [
            "inst",
            [
                "P. Roquet"
            ]
        ]
    ],
    [
        "head",
        "Italian"
    ],
    [
        "block",
        [
            "title",
            "21G.601 Italian I"
        ],
        [
            "prerec",
            "Subject meets with 21G.651"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Focus on basic oral expression, listening comprehension, and elementary reading and writing. Emphasis on the acquisition of vocabulary and grammatical concepts through active communication. Designed for students with no knowledge of Italian. Audio, video, and printed materials provide direct exposure to authentic Italian language and culture."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.651 Italian I"
        ],
        [
            "prerec",
            "Subject meets with 21G.601"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Focus on basic oral expression, listening comprehension, and elementary reading and writing. Emphasis on the acquisition of vocabulary and grammatical concepts through active communication. Designed for students with no knowledge of Italian. Audio, video, and printed materials provide direct exposure to authentic Italian language and culture."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "head",
        "Portuguese"
    ],
    [
        "block",
        [
            "title",
            "21G.800 Accelerated Introductory Portuguese"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Accelerated introduction to the language and culture of the Portuguese-speaking world, with special attention to Brazilian Portuguese. For students with little or no previous knowledge of Portuguese. Introduction to understanding, speaking, reading, and writing Portuguese. Covers essential content of complete first-year Portuguese in one semester. Maximal use of fundamentals of grammar in active communication. Audio and video based language laboratory program coordinated with and supplemented to class work. Conducted in Portuguese. Limited to 18."
        ],
        [
            "inst",
            [
                "N. Dominique"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.801 Portuguese I"
        ],
        [
            "prerec",
            "Subject meets with 21G.S81, 21G.S85"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Introduction to the language and culture of the Portuguese-speaking world, with special attention to Brazilian Portuguese. Focuses on basic oral expression, listening comprehension, and elementary reading and writing. Students develop their vocabulary and understanding of grammatical concepts through active communication. Designed for students with no knowledge/proficiency in Portuguese. For graduate credit, see 21G.851. Limited to 18."
        ],
        [
            "inst",
            [
                "Consult N. Dominique"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.S81 Special Subject: Portuguese I"
        ],
        [
            "prerec",
            "Subject meets with 21G.801, 21G.S85"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Experimental version of Portuguese I, which offers a combination of in-person and remote instruction. An introduction for students with little or no previous knowledge of Portuguese. Aims to achieve simultaneous progression of four skills — listening, speaking, reading, and writing. Licensed for Fall 2023 by the Committee on Curricula. Limited to 18 for pedagogical reasons."
        ],
        [
            "inst",
            [
                "N. Dominique"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.802 Portuguese II"
        ],
        [
            "prerec",
            "Subject meets with 21G.852"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.801\" title=\"21G.801\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.801');\">21G.801</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Continuation of 21G.801. Focuses on expanding communication skills and further development of linguistic competency. Uses a variety of authentic materials, such as the audio, video, web, and printed materials, to help develop cultural awareness and linguistic proficiency.  For graduate credit, see 21G.852. Limited to 18."
        ],
        [
            "inst",
            [
                "N. Dominique"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.S82 Special Subject: Portuguese II"
        ],
        [
            "prerec",
            "Subject meets with 21G.S86"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.801\" title=\"21G.801\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.801');\">21G.801</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Experimental version of Portuguese II, which offers a combination of in-person and remote instruction. Focus on communication with emphasis on basic oral expression. Aims to help students master the core grammar and basic vocabulary of Portuguese, fostering their engagement in everyday conversation with native speakers, as well as reading simple texts, both fiction and non-fiction, with relative ease. Licensed for Spring 2024 by the Committee on Curricula. Limited to 18 for pedagogical reasons."
        ],
        [
            "inst",
            [
                "N. Dominique"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.880 Accelerated Introductory Portuguese for Spanish Speakers"
        ],
        [
            "prerec",
            "Subject meets with 21G.855"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.704\" title=\"21G.704\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.704');\">21G.704</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Accelerated introduction to the language and culture of the Portuguese-speaking world, with special attention to Brazilian Portuguese. Designed for speakers of Spanish (native or bilingual, or those who have completed two college years or the equivalent). Covers essential content of first-year Portuguese in one semester. Builds on the similarities and differences between both languages in grammar, vocabulary and pronunciation for speaking, listening, reading and writing skills. For graduate credit, see 21G.855. Limited to 18."
        ],
        [
            "inst",
            [
                "N. Dominique"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.803 Portuguese III"
        ],
        [
            "prerec",
            "Prereq: 21G.802, 21G.880, or permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Fall)"
            ]
        ],
        [
            "desc",
            "Expands the breadth and depth of students' skills in understanding, speaking, reading, and writing Portuguese while continuing to provide exposure to the history and cultures of the Portuguese-speaking world. Uses short stories, films and music to study issues of historical and current interest. Conducted entirely in Portuguese. Limited to 18."
        ],
        [
            "inst",
            [
                "N. Dominique"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.S83 Special Subject: Portuguese III"
        ],
        [
            "prerec",
            "Prereq: 21G.802, 21G.880, or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Experimental version of Portuguese III, which offers a combination of in-person and remote instruction. A beginning intermediate language class that aims to expand and consolidate the student's basic linguistic skills, as well as several relevant cultural aspects of the Portuguese-speaking world. Includes a thorough review of grammar through exposure to input from various sources: written texts, movies, multi-media and discussions in Portuguese. Licensed for Fall 2023 by the Committee on Curricula. Limited to 18 for pedagogical reasons."
        ],
        [
            "inst",
            [
                "N. Dominique"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.804 Portuguese IV"
        ],
        [
            "prerec",
            "Prereq: 21G.803 or permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Spring)"
            ]
        ],
        [
            "desc",
            "Continued study of the language and culture to improve fluency, accuracy and style in both oral and written communication. Students discuss current news articles, short literary texts, films, music and web-based materials dealing with issues relevant to the Portuguese-speaking world. Coursework also includes grammar review. Conducted entirely in Portuguese. Limited to 18."
        ],
        [
            "inst",
            [
                "N. Dominique"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.S84 Special Subject: Portuguese IV"
        ],
        [
            "prerec",
            "Prereq: 21G.803 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Experimental version of Portuguese IV, which offers a combination of in-person and remote instruction. Develops linguistic competence and expands students' background knowledge of the history and cultures of the Portuguese-speaking world. Aims to promote cross-cultural understanding through the use of authentic materials such as literary or historical readings, film, music, photography and excerpts from the press. Licensed for Spring 2024 by the Committee on Curricula. Limited to 18 for pedagogical reasons."
        ],
        [
            "inst",
            [
                "N. Dominique"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.811 Conversational Portuguese"
        ],
        [
            "prerec",
            "Prereq: 21G.804 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Intermediate-level subject designed to build the student's vocabulary and improve oral communication through discussion of topics related to cultural and social aspects of Portuguese-speaking societies. Provides extensive listening and speaking practice in oral discourse, including dialogues, narrative and description, with great emphasis on everyday-life situations. Conducted entirely in Portuguese. Limited to 18."
        ],
        [
            "inst",
            [
                "N. Dominique"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.820 Topics in Modern Portuguese Literature and Culture"
        ],
        [
            "prerec",
            "Prereq: 21G.804 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Close study of history and criticism of Portuguese literature, focusing on a specific group of writers, a movement, a theme, a critical or theoretical issue, or an analytic approach. May be repeated for credit with permission of instructor. Taught in Portuguese."
        ],
        [
            "inst",
            [
                "N. Dominique"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.821 The Beat of Brazil: Portuguese Language and Brazilian Society Through its Music"
        ],
        [
            "prerec",
            "Prereq: 21G.804 or permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Fall)"
            ]
        ],
        [
            "desc",
            "Presents an overview of Brazilian history, art, and culture from the late 19th century to the present day. Topics covered are woven into the larger theme of popular Brazilian music, and include the Modern Art Week of 1922, Cândido Portinari's paintings, the Tropicalist art movement, and the role of artists and intellectuals during and after the military dictatorship. Identifies and distinguishes the main Brazilian musical styles, connecting them to specific historical periods and events, discussing how they reflect different notions of identity, and analyzing cultural production from a transnational perspective. Practice in listening, speaking, reading, and writing is provided, with strong emphasis on developing critical thinking. Taught in Portuguese. Limited to 18."
        ],
        [
            "inst",
            [
                "N. Dominique"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.822 Portuguese Language through Brazilian Film (New)"
        ],
        [
            "prerec",
            "Prereq: 21G.804 or permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: U (Fall)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Focuses on some of the most representative contemporary Brazilian film productions of the past half century. Topics covered examine their historical, social, political, and social context. Selected films explore aspects such as social inequality, migration, race relations, the role of women in society, as well as major political and historical events that have impacted Brazilian society. Identifies the main Brazilian characteristics and themes in contemporary film production, connecting them to specific historical periods and events, discussing how they reflect different notions of identity, and analyzing cultural production from a transnational perspective. Practice in listening, speaking, reading and writing is provided, with strong emphasis on developing critical thinking. Taught in Portuguese. 18 for pedagogical reasons."
        ],
        [
            "inst",
            [
                "N. Dominique"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.851 Portuguese I"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: G (IAP)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Introduction to the language and culture of the Portuguese-speaking world, with special attention to Brazilian Portuguese. Focuses on basic oral expression, listening comprehension, and elementary reading and writing. Students develop their vocabulary and understanding of grammatical concepts through active communication. Designed for students with no knowledge/proficiency in Portuguese. For undergraduate credit, see 21G.801. Enrollment limited."
        ],
        [
            "inst",
            [
                "Consult N. Dominique"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.S85 Special Subject: Portuguese I"
        ],
        [
            "prerec",
            "Subject meets with 21G.801, 21G.S81"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Experimental version of Portuguese I, which offers a combination of in-person and remote instruction. An introduction for students with little or no previous knowledge of Portuguese. Aims to achieve simultaneous progression of four skills: listening, speaking, reading, and writing. Licensed for Fall 2023 by the Committee on Graduate Programs. Limited to 18 for pedagogical reasons."
        ],
        [
            "inst",
            [
                "N. Dominique"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.852 Portuguese II"
        ],
        [
            "prerec",
            "Subject meets with 21G.802"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.851\" title=\"21G.851\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.851');\">21G.851</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Continuation of 21G.851. Focuses on expanding communication skills and further development of linguistic competency. Uses a variety of authentic materials, such as the audio, video, web, and printed materials, to help develop cultural awareness and linguistic proficiency. For undergraduate credit, see 21G.802. Enrollment limited."
        ],
        [
            "inst",
            [
                "N. Dominique"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.S86 Special Subject: Portuguese II"
        ],
        [
            "prerec",
            "Subject meets with 21G.S82"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.851\" title=\"21G.851\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.851');\">21G.851</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Experimental version of Portuguese II, which offers a combination of in-person and remote instruction. Focus on communication with emphasis on basic oral expression. Aims to help students master the core grammar and basic vocabulary of Portuguese, fostering their engagement in everyday conversation with native speakers, as well as reading simple texts, both fiction and non-fiction, with relative ease. Licensed for Spring 2024 by the Committee on Graduate Programs. Limited to 18 for pedagogical reasons."
        ],
        [
            "inst",
            [
                "N. Dominique"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.855 Accelerated Introductory Portuguese for Spanish Speakers"
        ],
        [
            "prerec",
            "Subject meets with 21G.880"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.704\" title=\"21G.704\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.704');\">21G.704</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Accelerated introduction to the language and culture of the Portuguese-speaking world, with special attention to Brazilian Portuguese. Designed for speakers of Spanish (native or bilingual, or those who have completed two college years or the equivalent). Covers essential content of first-year Portuguese in one semester. Builds on the similarities and differences between both languages in grammar, vocabulary and pronunciation for speaking, listening, reading and writing skills. For undergraduate credit, see 21G.880. Limited to 18."
        ],
        [
            "inst",
            [
                "N. Dominique"
            ]
        ]
    ],
    [
        "head",
        "Russian"
    ],
    [
        "block",
        [
            "title",
            "21G.611 Russian I (Regular)"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (IAP)"
            ]
        ],
        [
            "desc",
            "Emphasizes the development of communicative and cultural competence, as well as mastery of the foundations of Russian grammar and vocabulary. Using video, internet resources, and varied cultural materials, students work on developing speaking, reading, and writing skills. Conducted in both Russian and English. Designed for students with no knowledge of Russian. Limited to 18."
        ],
        [
            "inst",
            [
                "M. Khotimsky"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.S61 Special Subject: Russian I"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: U (Fall)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Experimental version of 21G.611, which offers a combination of in-person and remote instruction. Aims to achieve simultaneous progression of four skills — listening, speaking, reading, and writing. Emphasizes the development of communicative and cultural competence, as well as mastering the foundations of Russian grammar and vocabulary. Conducted in both Russian and English. Designed for students with no knowledge of Russian. Licensed for Fall 2023 by the Committee on Curricula. Limited to 18 for pedagogical reasons."
        ],
        [
            "inst",
            [
                "M. Khotimsky"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.612 Russian II (Regular)"
        ],
        [
            "prerec",
            "Prereq: 21G.611 or permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Spring)"
            ]
        ],
        [
            "desc",
            "Continuing instruction in Russian language and culture with emphasis on acquisition of vocabulary and grammatical concepts through active communication. Conducted in both Russian and English. Provides exposure to the language via a video program, internet resources, and literary texts that are integrated in grammar instruction and conversation tasks. Limited to 18."
        ],
        [
            "inst",
            [
                "M. Khotimsky"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.S62 Special Subject: Russian II"
        ],
        [
            "prerec",
            "Prereq: 21G.611 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Experimental version of 21G.612, which offers a combination of in-person and remote instruction. Aims to achieve simultaneous progression of four skills — listening, speaking, reading, and writing. Continuing instruction in Russian language and culture with emphasis on acquisition of vocabulary and grammatical concepts through active communication. Provides exposure to the language via a video program, internet resources, and literary texts that are integrated in grammar instruction and conversation tasks. Licensed for Spring 2024 by the Committee on Curricula. Limited to 18 for pedagogical reasons."
        ],
        [
            "inst",
            [
                "M. Khotimsky"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.613 Russian III (Regular)"
        ],
        [
            "prerec",
            "Prereq: 21G.612 and permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Fall)"
            ]
        ],
        [
            "desc",
            "Includes comprehensive review and expansion of grammar and vocabulary. Emphasizes the development of speaking, reading, and writing skills. Examines adapted and authentic literary texts, media resources, and film. Develops communicative skills necessary for personal and professional interaction in a Russian-language environment. Limited to 18."
        ],
        [
            "inst",
            [
                "M. Khotimsky"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.S63 Special Subject: Russian III"
        ],
        [
            "prerec",
            "Prereq: 21G.612 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Experimental version of 21G.613, which offers a combination of in-person and remote instruction. Aims to achieve simultaneous progression of four skills — listening, speaking, reading, and writing. Includes comprehensive review and expansion of grammar and vocabulary. Examines adapted and authentic literary texts, media resources, and film. Develops communicative skills necessary for personal and professional interaction in a Russian-language environment. Licensed for Fall 2023 by the Committee on Curricula. Limited to 18 for pedagogical reasons."
        ],
        [
            "inst",
            [
                "M. Khotimsky"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.614 Russian IV (Regular)"
        ],
        [
            "prerec",
            "Prereq: 21G.613 and permission of instructor"
        ],
        [
            "terms",
            [
                "U (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Features intermediate to advanced study of Russian with a comprehensive review of grammar, and emphasis on more complex communicative topics. Reading and writing skills developed through study of various topics in Russian culture and society. Uses a variety of authentic literary and non-fiction texts, media resources, and film. Limited to 18."
        ],
        [
            "inst",
            [
                "M. Khotimsky"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.S64 Special Subject: Russian IV"
        ],
        [
            "prerec",
            "Prereq: 21G.613 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Experimental version of 21G.614, which offers a combination of in-person and remote instruction. Aims to achieve simultaneous progression of four skills — listening, speaking, reading, and writing. Includes a comprehensive review of grammar with an emphasis on more complex communicative topics in personal and professional contexts. Reading and writing skills developed through study of various topics in Russian culture and society. Uses a variety of authentic literary and non-fiction texts, media resources, and film. Licensed for Spring 2024 by the Committee on Curricula. Limited to 18 for pedagogical reasons."
        ],
        [
            "inst",
            [
                "M. Khotimsky"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.615 Russian V: Russian for STEM"
        ],
        [
            "prerec",
            "Prereq: 21G.614 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Explores historical contributions of Russian scientists and inventors in a global perspective. Focuses on developing advanced-level reading, speaking, and writing skills through discussing problems in technology and society, such as the history of the space race, development of internet technologies, environmental issues, and the global pandemic. Students participate in class debates and discussions and create a final presentation on a topic of professional interest. Course materials combine articles, book excerpts, films, interviews, and project-based tasks. Taught in Russian. Open to advanced students of Russian and heritage speakers. Limited to 18."
        ],
        [
            "inst",
            [
                "M. Khotimsky"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.616 Advanced Russian: Explorations in Russian Culture, Society, and Media"
        ],
        [
            "prerec",
            "Prereq: 21G.614 or permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Spring)"
            ]
        ],
        [
            "desc",
            "Explores various topics in contemporary Russian culture and society, such as the major cultural centers and regions of the country; contemporary music, film, and visual arts; food and culture of hospitality; and ways of behavior and cultural traditions. Engages students in cross-cultural comparisons and offers an opportunity to interact with Russian-speaking professionals of the Boston area.  Focuses on developing higher-level vocabulary, listening, speaking, and writing skills. Taught in Russian. Open to advanced students of Russian and heritage speakers. Limited to 18."
        ],
        [
            "inst",
            [
                "M. Khotimsky"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.618 Introduction to the Classics of Russian Literature - Russian Language Option"
        ],
        [
            "prerec",
            "Subject meets with 21G.077[J], 21L.490[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.614\" title=\"21G.614\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.614');\">21G.614</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Explores the works of classical Russian writers of the 19th and 20th centuries, including stories and novels by Pushkin, Gogol, Dostoevsky, Tolstoy, Chekhov, Bunin, Nabokov, Platonov, and others. Focuses on their approaches to portraying self and society, and on literary responses to fundamental ethical and philosophical questions about justice, freedom, free will, fate, love, loyalty, betrayal, and forgiveness.  Taught in English with additional readings and a short writing project in Russian."
        ],
        [
            "inst",
            [
                "M. Khotimsky"
            ]
        ]
    ],
    [
        "head",
        "Korean"
    ],
    [
        "block",
        [
            "title",
            "21G.901 Korean I (Regular)"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, IAP)"
            ]
        ],
        [
            "desc",
            "Introduction to modern standard Korean with emphasis on developing conversational skills by using fundamental grammatical patterns and vocabulary in functional and culturally suitable contexts. Basic reading and writing are also taught. Placement interview with instructors on or before Registration Day required of students who have had prior exposure to Korean elsewhere. Limited to 16 per section. No listeners."
        ],
        [
            "inst",
            [
                "H. Jeong"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.902 Korean II (Regular)"
        ],
        [
            "prerec",
            "Prereq: 21G.901 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Continuation of 21G.901. For full description, see 21G.901. Placement interview with instructors on or before Registration Day required of students who have had prior exposure to Korean elsewhere. Limited to 16 per section. No listeners."
        ],
        [
            "inst",
            [
                "H. Jeong"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.903 Korean III (Regular)"
        ],
        [
            "prerec",
            "Prereq: 21G.902 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Continuing instruction in spoken and written Korean, with particular emphasis on consolidating basic conversational skills and improving reading confidence and depth. Lab work required. Placement interview with instructors on or before Registration Day required of students who have had prior exposure to Korean elsewhere. Limited to 16 per section. No listeners."
        ],
        [
            "inst",
            [
                "H. Jeong"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.904 Korean IV (Regular)"
        ],
        [
            "prerec",
            "Prereq: 21G.903 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Continuation of 21G.903. For full description, see 21G.903. Placement interview with instructors on or before Registration Day required of students who have had prior exposure to Korean elsewhere. Limited to 16 per section. No listeners."
        ],
        [
            "inst",
            [
                "H. Jeong"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.905 Korean V"
        ],
        [
            "prerec",
            "Prereq: 21G.904 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Designed to improve students' skills in listening, reading, speaking, and writing in Korean. Explores various topics such as Korean contemporary culture, traditional holidays, humor, history, cultural heritage, daily life, and other related subjects. Students compare, in writing and speaking, the Korean context with their own backgrounds. Placement interview with instructors on or before Registration Day required of students who have had prior exposure to Korean elsewhere. Conducted entirely in Korean. Limited to 16 per section."
        ],
        [
            "inst",
            [
                "H. Jeong"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.906 Korean VI"
        ],
        [
            "prerec",
            "Prereq: 21G.905 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Enables students to understand current social trends in Korea and to develop cross-cultural insights by comparing Korean society with the students' own societies. Students deal more extensively with a variety of topics, such as Korean proverbs, traditional and contemporary lifestyles of Korean people, contemporary pop culture, and other related topics, in order to gain greater knowledge of Korean culture and a deeper awareness of the role that culture and social behavior play in effective communication. Enables development of a high level of fluency and accuracy in students' linguistic/pragmatic competence and performance. Placement interview with instructors on or before Registration Day required of students who have had prior exposure to Korean elsewhere. Conducted entirely in Korean. Limited to 16 per section."
        ],
        [
            "inst",
            [
                "H. Jeong"
            ]
        ]
    ],
    [
        "head",
        "Arabic"
    ],
    [
        "block",
        [
            "title",
            "21G.951 Arabic I"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, IAP)"
            ]
        ],
        [
            "desc",
            "Introduces students to the fundamentals of Modern Standard Arabic (MSA) using an integrated approach to develop skills in formal and colloquial Arabic and establish basic proficiency. With an overview of basic phonemes, vocabulary, grammatical structures, and the Arabic writing system, provides opportunities to practice the four skills of reading, writing, listening, and speaking. Introduces students to some of the diverse cultures of the Arabic-speaking world, in order to develop intercultural, communicative, and linguistic competencies. Limited to 18."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.952 Arabic II"
        ],
        [
            "prerec",
            "Prereq: 21G.951 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Enables students to continue developing skills in basic Modern Standard Arabic (MSA) using an integrated approach to develop skills in formal and colloquial Arabic. Provides opportunities to practice the four skills of reading, writing, listening, and speaking to develop proficiency. Extends student knowledge of some of the diverse cultures of the Arabic-speaking world in order to develop intercultural, communicative, and linguistic competencies. Limited to 18."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "head",
        "Spanish"
    ],
    [
        "block",
        [
            "title",
            "21G.701 Spanish I"
        ],
        [
            "prerec",
            "Subject meets with 21G.751"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "For students with no previous knowledge of Spanish. Introduction to understanding, speaking, reading, and writing Spanish. Maximal use of fundamentals of grammar in active communication. Audio- and video-based language laboratory program coordinated with and supplemented to class work. For graduate credit see 21G.751. Limited to 18 per section."
        ],
        [
            "inst",
            [
                "Consult J. Barroso"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.702 Spanish II"
        ],
        [
            "prerec",
            "Subject meets with 21G.752"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.701\" title=\"21G.701\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.701');\">21G.701</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Continues the study of Spanish language and culture using audio, video and print materials, feature films and popular music from Latin America and Spain. Emphasizes writing, vocabulary acquisition, and the study of more complex grammatical structures. Students develop oral skills through group interaction and short presentations. For graduate credit see 21G.752. Limited to 18 per section."
        ],
        [
            "inst",
            [
                "Consult M. San Martin"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.700 Introductory Spanish for Heritage Learners"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Designed for students who have had previous contact with the language, commonly from interactions with their parents or guardians, and who have some degree of speaking and listening skills. Offers an intensive introduction and review of fundamental grammatical and orthographic forms, with an emphasis on those that can be challenging to Heritage Learners. Provides a space for students to validate their bilingual skills and develop their confidence when using Spanish. Limited to 18; placement interview required."
        ],
        [
            "inst",
            [
                "J. Barroso"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.703 Spanish III"
        ],
        [
            "prerec",
            "Prereq: 21G.702 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Aims at consolidation and expansion of skills in listening comprehension, speaking, reading, and writing. Uses short stories and other readings, films, music, and Web projects (including a multimedia exchange with students in Spain) to study issues of historical and current interest in Hispanic culture. Limited to 18 per section."
        ],
        [
            "inst",
            [
                "Consult J. Barroso",
                "A. Yáñez Rodríguez"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.793 Spanish III in Madrid"
        ],
        [
            "prerec",
            "Prereq: 21G.702 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (IAP)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Mastery of oral expression, reading, writing, and listening while experiencing life and culture in Spain's capital, Madrid. Students use language strategically to accomplish objectives and to resolve conflicts, in culturally accurate circumstances utilizing appropriate vocabulary. Limited to 18."
        ],
        [
            "inst",
            [
                "J. Barroso"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.704 Spanish IV"
        ],
        [
            "prerec",
            "Prereq: 21G.703 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Continued study of the language, literature, and culture of Spanish-speaking countries to improve oral and written communication. Materials include contemporary Spanish and Latin American films, literary texts (short stories, poetry and a novel), online video interviews with a variety of Spanish-speakers and other Web resources. Limited to 18 per section."
        ],
        [
            "inst",
            [
                "Consult A. Yáñez Rodríguez"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.706 Spanish for Medicine and Health"
        ],
        [
            "prerec",
            "Prereq: 21G.703"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Develops the linguistic skills needed and builds specialized medical terminology to effectively communicate with, assess and care for Spanish-speaking patients in clinical settings. Develops cross-cultural competence and awareness by considering relevant cultural differences and their impact on the doctor-patient relationship. Also discusses major health issues that affect Latinx communities in the United States. Offers extensive practice in listening, speaking, reading and writing using authentic materials (news articles, public health information sites, videos, etc.) and communicative activities (group work, simulations, debates, oral presentations) to develop the proficiency needed to pursue further language study at the advanced level. Limited to 18."
        ],
        [
            "inst",
            [
                "M. San Martin"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.708 Spanish: Communication Intensive I"
        ],
        [
            "prerec",
            "Prereq: None. Coreq: 21G.735, 21L.636[J], 21L.637[J], 21L.638[J], 21L.639[J], 21L.640[J], or CMS.357[J]; permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring)"
            ]
        ],
        [
            "desc",
            "Intensive tutorial in writing and speaking for majors. Provides students with enhanced linguistic and cultural fluency for academic or real-world purposes. Conducted entirely in Spanish. Preference to Spanish majors."
        ],
        [
            "inst",
            [
                "M. Resnick"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.709 Spanish: Communication Intensive II"
        ],
        [
            "prerec",
            "Prereq: 21G.708; Coreq: 21G.735, 21L.636[J], 21L.637[J], 21L.638[J], 21L.639[J], 21L.640[J], or CMS.357[J]; permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Intensive tutorial in writing and speaking for majors. Provides students with enhanced linguistic and cultural fluency for academic or real-world purposes. Conducted entirely in Spanish. Preference to Spanish majors."
        ],
        [
            "inst",
            [
                "M. Resnick"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.707 Graphic Stories: Spanish and Latin American Comics (New)"
        ],
        [
            "prerec",
            "Prereq: 21G.704 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Fosters development of spoken and written skills to improve fluency and style in Spanish while exploring graphic novels, comics, or sequential art, of the Spanish-Speaking world (Mexico, Puerto Rico, Argentina, Chile, Spain, and the USA). Special attention given to: autobiographical memory, gender identity, multiculturalism, transatlantic crossings, and science fiction. Small group work, class discussions, debates, and games will be used in order to expand students' vocabulary in a wide range of topics, as well as to improve command of the more problematic grammatical structures in Spanish. Taught in Spanish. Limited to 18 for pedagogical reasons."
        ],
        [
            "inst",
            [
                "A. Yáñez Rodríguez"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.710 Advanced Communication in Spanish: Topics in Language and Culture"
        ],
        [
            "prerec",
            "Prereq: 21G.704 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Advanced work to further develop oral and written skills in Spanish. Emphasizes communicative tasks and the consolidation of grammatical structures. Discussion, oral presentations, essay writing and group projects improve proficiency and prepare students to pursue advanced subjects and/or professional activities in a Spanish-speaking environment. Topics vary from term to term. Taught in Spanish. Limited to 18."
        ],
        [
            "inst",
            [
                "A. Yáñez Rodríguez"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.711 Advanced Spanish Conversation and Composition: Perspectives on Technology and Culture"
        ],
        [
            "prerec",
            "Prereq: 21G.704 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Develops language proficiency through the discussion of the social and cultural impact of science and technology on Hispanic societies. Topics considered are: how STEM innovations affect and benefit communities, relationships, education, work-life, and the environment; ethical implications of technological decision-making; and the role technology plays in art, literature, and film. Improves oral and writing skills working with journalistic and literary selections, films, videos, and guided essays offering diverse perspectives. Taught in Spanish. Enrollment limited."
        ],
        [
            "inst",
            [
                "H. Belio-Apaolaza"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.712 Spanish Conversation and Composition"
        ],
        [
            "prerec",
            "Prereq: 21G.704 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Further development of spoken and written skills to improve fluency and style. Oral reports by participants on individual topics and group Web-based and video projects. Analyses of selected literary texts, films and popular music. Taught in Spanish. Enrollment limited."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.795 Advanced Spanish Communication in Spain"
        ],
        [
            "prerec",
            "Prereq: 21G.704 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (IAP)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Improves fluency and oral proficiency through the study of Spanish culture, history and society in an immersive environment. Class discussions, debates and oral presentations broaden vocabulary and idiomatic usage, and help mastery of complex grammatical structures. Provides background on Spanish cultural practices, history, and current developments. Assignments and in-class activities include oral reports based on interviews with locals. Guided cultural activities further appreciation and understanding of Spanish culture, art and history and provide topics for oral and written presentations. Conducted entirely in Spanish. Limited to 18."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.713 Spanish through Film: Mexico, Chile, Argentina, and Spain"
        ],
        [
            "prerec",
            "Prereq: 21G.704 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Aims to increase oral and written communication, grammar, and vocabulary usage in Spanish while exploring a number of contemporary Hispanic films. Covers major films from Mexico, Chile, Argentina, and Spain. Discussion, oral presentations, essay writing and group projects improve proficiency and prepare students to pursue advanced subjects and/or professional activities in a Spanish-speaking environment. Taught in Spanish. Limited to 18."
        ],
        [
            "inst",
            [
                "A. Yáñez Rodríguez"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.714 Spanish for Heritage Learners"
        ],
        [
            "prerec",
            "Prereq: Fluency in a Spanish dialect or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Designed for students who have conversational skills (typically gained from growing up in a Spanish speaking environment) without a corresponding level of literacy. Builds upon students' existing linguistic and cultural knowledge to develop competence and confidence in using the language in more formal contexts. Examines a variety of texts and genres, music, films and visual arts, in order to enrich vocabulary, improve grammatical accuracy, and gain a greater social, cultural, political, and historical understanding of the Spanish-speaking world. Taught in Spanish. Limited to 18."
        ],
        [
            "inst",
            [
                "J. Barroso"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.715 Topics in Medicine and Public Health in the Hispanic World"
        ],
        [
            "prerec",
            "Prereq: 21G.704 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Strengthens oral and written communication skills in Spanish by examining current topics in medicine and public health. Explores medical and health challenges in various Hispanic nations and among Spanish-speaking communities in the US. Topics include cultural narratives of illness, bioethical considerations of genetic research, women's reproductive rights, Cuba's export of healthcare workers, the ethical implications of medical decision-making, and euthanasia. Draws on sources from the humanities, social sciences and the arts that incorporate diverse perspectives on these issues. Focuses on the use of language in the construction of cultural metaphors and representations of illness and healing. Taught in Spanish. Limited to 18."
        ],
        [
            "inst",
            [
                "M. San Martín"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.716[J] Introduction to Contemporary Hispanic Literature and Film"
        ],
        [
            "prerec",
            "Same subject as 21L.636[J]"
        ],
        [
            "terms",
            [
                "Prereq: One intermediate subject in Spanish or permission of instructor "
            ]
        ],
        [
            "desc",
            "See description under subject 21L.636[J]."
        ],
        [
            "inst",
            [
                "M. Resnick"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.717[J] Power and Culture: Utopias and Dystopias in Spain and Latin America"
        ],
        [
            "prerec",
            "Same subject as 21L.637[J]"
        ],
        [
            "terms",
            [
                "Prereq: One intermediate subject in Spanish or permission of instructor "
            ]
        ],
        [
            "desc",
            "See description under subject 21L.637[J]. Limited to 18."
        ],
        [
            "inst",
            [
                "M. Resnick"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.731[J] Creation of a Continent: Media Representations of Hispanic America, 1492 to present"
        ],
        [
            "prerec",
            "Same subject as 21H.274[J], CMS.357[J]"
        ],
        [
            "terms",
            [
                "Prereq: One intermediate Spanish subject or permission of instructor "
            ]
        ],
        [
            "desc",
            "See description under subject CMS.357[J]."
        ],
        [
            "inst",
            [
                "P. Duong"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.732 The Making of the Latin American City: Culture, Gender, and Citizenship"
        ],
        [
            "prerec",
            "Prereq: One intermediate subject in Spanish or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Explores paradigms of Latin American modernity, gender, and urban cultures through primary texts and media. Examines a range of materials (literature, films, visual arts, music, and advertising) to reflect on the region's urbanization processes of the 20th and 21st centuries. Focuses on the production and representation of gender - and women, in particular - as key subjects of urbanization, mass media, and consumer culture. Discussions travel through urban centers as different as Buenos Aires, Mexico DF, Lima, Havana, Miami and New York, but are organized around four critical categories: urban spaces, labor, leisure, and citizenship. Taught in Spanish."
        ],
        [
            "inst",
            [
                "P. Duong"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.735 Advanced Topics in Hispanic Literature and Film"
        ],
        [
            "prerec",
            "Prereq: One intermediate Spanish subject or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Close study of a theme, a grouping of authors, or a historical period not covered in depth in other subjects. May be repeated for credit with permission of instructor. Taught in Spanish. Limited to 18."
        ],
        [
            "inst",
            [
                "P. Duong"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.736[J] The Short Form: Literature and New Media Cultures in the Hispanic World"
        ],
        [
            "prerec",
            "Same subject as CMS.358[J]"
        ],
        [
            "terms",
            [
                "Prereq: One intermediate subject in Spanish or permission of instructor "
            ]
        ],
        [
            "desc",
            "See description under subject CMS.358[J]. Limited to 18."
        ],
        [
            "inst",
            [
                "P. Duong"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.738[J] Literature and Social Conflict: Perspectives on the Hispanic World"
        ],
        [
            "prerec",
            "Same subject as 21L.638[J]"
        ],
        [
            "terms",
            [
                "Prereq: One intermediate subject in Spanish or permission of instructor "
            ]
        ],
        [
            "desc",
            "See description under subject 21L.638[J]."
        ],
        [
            "inst",
            [
                "J. Terrones"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.739[J] Globalization and its Discontents: Spanish-speaking Nations"
        ],
        [
            "prerec",
            "Same subject as 21L.639[J]"
        ],
        [
            "terms",
            [
                "Prereq: One intermediate subject in Spanish or permission of instructor "
            ]
        ],
        [
            "desc",
            "See description under subject 21L.639[J]."
        ],
        [
            "inst",
            [
                "M. Resnick"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.740[J] The New Spain: 1977-Present"
        ],
        [
            "prerec",
            "Same subject as 21L.640[J]"
        ],
        [
            "terms",
            [
                "Prereq: One intermediate subject in Spanish or permission of instructor "
            ]
        ],
        [
            "desc",
            "See description under subject 21L.640[J]."
        ],
        [
            "inst",
            [
                "M. Resnick"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.784 Introduction to Latin American Studies"
        ],
        [
            "prerec",
            "Subject meets with 17.55[J], 21A.130[J], 21G.084[J], 21H.170[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.704\" title=\"21G.704\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.704');\">21G.704</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Examines contemporary Latin American culture, politics, and history. Surveys geography, economic development, and race, religion, and gender in Latin America. Special emphasis on the Salvadoran civil war, human rights and military rule in Argentina and Chile, and migration from Central America and Mexico to the United States. Students analyze films, literature, visual art, journalism, historical documents, and social scientific research. Taught in English with a project that requires research and writing in Spanish."
        ],
        [
            "inst",
            [
                "T. Padilla"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.751 Spanish I"
        ],
        [
            "prerec",
            "Subject meets with 21G.701"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "For students with no previous knowledge of Spanish. Introduction to understanding, speaking, reading, and writing Spanish. Maximal use of fundamentals of grammar in active communication. Audio- and video-based language laboratory program coordinated with and supplementary to class work. Same as 21G.701, but for graduate credit. Limited to 18 per section."
        ],
        [
            "inst",
            [
                "Consult J. Barroso"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.752 Spanish II"
        ],
        [
            "prerec",
            "Subject meets with 21G.702"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.751\" title=\"21G.751\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.751');\">21G.751</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Introductory subject that continues the study of Spanish language and culture using audio, video and print materials, feature films and popular music from Latin America and Spain. Emphasizes writing, vocabulary acquisition, and the study of more complex grammatical structures. Group interaction and short oral presentations develop students' oral skills. Limited to 18 per section."
        ],
        [
            "inst",
            [
                "Consult M. San Martin"
            ]
        ]
    ],
    [
        "head",
        "Independent Study and Special Subjects"
    ],
    [
        "block",
        [
            "title",
            "21G.911 Independent Study"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring)"
            ]
        ],
        [
            "desc",
            "Advanced work in languages and literatures for students wishing to pursue topics or projects not provided by regular subject offerings. Before registering, student must plan course of study with appropriate instructor in the section and secure the approval of the Section Head. Normal maximum is 6 units."
        ],
        [
            "inst",
            [
                "Consult Global Studies and Languages Headquarters"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.S01 Special Subject: Global Studies and Languages"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: U (Fall)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Opportunity for undergraduate study of subject matter that is not covered in the regular curriculum."
        ],
        [
            "inst",
            [
                "Consult Global Studies and Languages Headquarters"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.S02 Special Subject: Global Studies and Languages"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Opportunity for undergraduate study of subject matter that is not covered in the regular curriculum."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.S03 Special Subject: Global Studies and Languages"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: U (Fall)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Opportunity for undergraduate study of subject matter that is not covered in the regular curriculum."
        ],
        [
            "inst",
            [
                "Consult Global Studies and Languages Headquarters"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.S04 Special Subject: Global Studies and Languages"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (IAP)"
            ]
        ],
        [
            "desc",
            "Opportunity for undergraduate study of subject matter that is not covered in the regular curriculum."
        ],
        [
            "inst",
            [
                "Consult Global Studies and Languages Headquarters"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.S05 Special Subject: Global Studies and Languages"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (IAP)"
            ]
        ],
        [
            "desc",
            "Opportunity for undergraduate study of subject matter that is not covered in the regular curriculum."
        ],
        [
            "inst",
            [
                "Consult Global Studies and Languages Headquarters"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.S06 Special Subject: Global Studies and Languages"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Spring)"
            ]
        ],
        [
            "desc",
            "Opportunity for undergraduate study of subject matter that is not covered in the regular curriculum."
        ],
        [
            "inst",
            [
                "F. Heberer"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.S07 Special Subject: Global Studies and Languages"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (IAP)"
            ]
        ],
        [
            "desc",
            "Opportunity for undergraduate study of subject matter that is not covered in the regular curriculum."
        ],
        [
            "inst",
            [
                "Consult Global Studies and Languages Headquarters"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.S08 Special Subject: Global Studies and Languages"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: U (IAP)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Opportunity for undergraduate study of subject matter that is not covered in the regular curriculum."
        ],
        [
            "inst",
            [
                "Consult Global Studies and Languages Headquarters"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.THT Pre-Thesis Tutorial: Global Studies and Languages"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring)"
            ]
        ],
        [
            "desc",
            "Definition of and early-stage work on thesis project leading to 21G.THU Undergraduate Thesis in Global Studies and Languages. Taken during the first term of the student's two-term commitment to the thesis project. Student works closely with an individual faculty tutor."
        ],
        [
            "inst",
            [
                "Consult Global Studies and Languages Headquarters"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.THU Global Studies and Languages Thesis"
        ],
        [
            "prerec",
            "Prereq: 21G.THT"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Completion of work on the senior major thesis under supervision of a faculty thesis advisor. Includes oral presentation of thesis progress early in the term, assembling and revising the final text, and a final meeting with a committee of faculty evaluators to discuss the successes and limitations of the project."
        ],
        [
            "inst",
            [
                "Consult Global Studies and Languages Headquarters"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.UR Undergraduate Research"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Individual participation in an ongoing research project. For students in the Undergraduate Research Opportunities Program."
        ],
        [
            "inst",
            [
                "Consult Global Studies and Languages Headquarters"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21G.URG Undergraduate Research"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Individual participation in an ongoing research project. For students in the Undergraduate Research Opportunities Program."
        ],
        [
            "inst",
            [
                "Consult Global Studies and Languages Headquarters"
            ]
        ]
    ]
]