[
    "Literature (Course 21L)",
    [
        "head",
        "Introductory Subjects"
    ],
    [
        "block",
        [
            "title",
            "21L.000[J] Writing About Literature"
        ],
        [
            "prerec",
            "Same subject as 21W.041[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Intensive focus on the reading and writing skills used to analyze literary texts such as poems by Emily Dickinson, Shakespeare or Langston Hughes; short stories by Chekhov, Joyce, or Alice Walker; and a short novel by Melville or Toni Morrison. Designed not only to prepare students for further work in writing and literary and media study, but also to provide increased confidence and pleasure in their reading, writing, and analytical skills. Students write or revise essays weekly. Enrollment limited."
        ],
        [
            "inst",
            [
                "W. Kelley",
                "I. Lipkowitz"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.001 Foundations of Western Literature: Homer to Dante"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Studies a broad range of texts essential to understanding the two great sources of Western conceptions of the world and humanity's place within it: the ancient world of Greece and Rome and the Judeo-Christian world that challenged and absorbed it. Readings vary but usually include works by Homer, Sophocles, Aristotle, Plato, Virgil, St. Augustine, and Dante. Enrollment limited."
        ],
        [
            "inst",
            [
                "S. Frampton"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.002 Foundations of Western Literature: From Shakespeare to the Present"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Fall)"
            ]
        ],
        [
            "desc",
            "A broad survey of texts, literary, philosophical, and sociological, studied to trace the growth of secular humanism, the loss of a supernatural perspective upon human events, and changing conceptions of individual, social, and communal purpose. Stresses appreciation and analysis of texts that came to represent the common cultural possession of our time. Enrollment limited."
        ],
        [
            "inst",
            [
                "J. Buzard"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.003 Reading Fiction"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Samples prose narrative from different traditions, examining texts that feature distinctive styles and formal rhythms in their social and historical contexts. May include European and US classics, alongside global and contemporary authors. Considers writing and reading as forms of social engagement, with special attention to the ways that authors borrow from and innovate on the past. Enrollment limited."
        ],
        [
            "inst",
            [
                "J. Buzard",
                "W. Kelley",
                "D. Thorburn"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.004 Reading Poetry"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Concentrates on close analysis of poems written in English in various forms (lyric, epic, dramatic). Syllabus varies from term to term but typically includes Shakespeare, Milton, Wordsworth, Blake, Keats, Whitman, Dickinson, Frost, Eliot, Langston Hughes, Lowell, and Plath. Enrollment limited."
        ],
        [
            "inst",
            [
                "A. Bahr",
                "S. Tapscott",
                "M. Fuller",
                "N. Jackson"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.005[J] Introduction to Drama"
        ],
        [
            "prerec",
            "Same subject as 21M.609[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "A study of the history of theater art and practice from its origins to the modern period, including its roles in non-Western cultures. Special attention to the relationship between the literary and performative dimensions of drama, and the relationship between drama and its cultural context. Enrollment limited."
        ],
        [
            "inst",
            [
                "A. Fleche",
                "D. Henderson"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.008[J] Black Matters: Introduction to Black Studies"
        ],
        [
            "prerec",
            "Same subject as 24.912[J], 21H.106[J], 21W.741[J], CMS.150[J], WGS.190[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 24.912[J]."
        ],
        [
            "inst",
            [
                "D. Wood"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.009 Shakespeare"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Focuses on the close reading of six to eight of Shakespeare plays, as well as their adaptation for stage and/or film. Selected texts cover the range of genres in which Shakespeare wrote (i.e., history, comedy, tragedy, and romance). Special emphasis in some terms on performances and adaptions of Shakespearean drama around the world. Plays studied vary across sections and from term to term, and have recently included Henry IV Part 1, Hamlet, A Midsummer Night's Dream, King Lear, Othello, and The Tempest. Enrollment limited."
        ],
        [
            "inst",
            [
                "S. Raman",
                "P. Donaldson"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.010[J] Writing with Shakespeare"
        ],
        [
            "prerec",
            "Same subject as 21W.042[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Focuses on writing and speaking using Shakespeare as a model and means for mastery of English language skills. Emphasizes the development of students' ability to write clearly and effectively in a range of genres with an awareness of audience. Designed to increase students' confidence and pleasure in verbal communication and analysis of language. Students write frequently, give and receive feedback, improve their work through revision, and participate actively in class discussions and presentations. Enrollment limited."
        ],
        [
            "inst",
            [
                "D. Henderson"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.011 Introduction to Film Studies"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Concentrates on close analysis and criticism of a wide range of films, including works from the early silent period, documentary and avant-garde films, European art cinema, and contemporary Hollywood fare. Through comparative reading of films from different eras and countries, students develop the skills to turn their in-depth analyses into interpretations and explore theoretical issues related to spectatorship. Syllabus varies from term to term, but usually includes such directors as Eisenstein, Fellini, Godard, Griffith, Hawks, Hitchcock, Kubrick, Kurosawa, Tarantino, Welles, and Wiseman."
        ],
        [
            "inst",
            [
                "E. Brinkema"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.012 Forms of Western Narrative"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: U (Fall)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Examines a wide assortment of narrative forms, from Homer to the present, and considers why and how stories are told. Focuses on the close reading of literary and cultural issues, the emergence of different narrative genres, and how different media affect the construction and interpretation of narratives. Syllabus varies by term, but usually includes materials such as epics, novels, tales, short stories, films, television programs, graphic novels, and interactive games. Enrollment limited."
        ],
        [
            "inst",
            [
                "S. Frampton"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.013[J] The Supernatural in Music, Literature and Culture"
        ],
        [
            "prerec",
            "Same subject as 21M.013[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21M.013[J]. Limited to 36."
        ],
        [
            "inst",
            [
                "C. Shadle",
                "M. Fuller"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.014[J] Introduction to Ancient and Medieval Studies"
        ],
        [
            "prerec",
            "Same subject as 21H.007[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21H.007[J]."
        ],
        [
            "inst",
            [
                "S. Frampton",
                "E. Goldberg"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.015 Children's Literature"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Analyzes children's literature from a variety of eras and genres, taking even the most playful texts seriously as works of art and powerful cultural influences. Considers the types of stories adults consider appropriate for children, and why; how opinions about this subject have changed over time and across cultures; and the complex interplay of words and images in children's books. Enrollment limited."
        ],
        [
            "inst",
            [
                "M. Gubar"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.017 The Art of the Probable"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Examines literary texts and/or films in relation to the history of the idea of probability. Traces the growing importance of probability as a basic property of things and the world, as well as a measure of the reliability of our ideas and beliefs. Connects the development and use of probabilistic reasoning (e.g., in the lottery and in statistics) with literary and cultural concerns regarding the rationality of belief, risk and uncertainty, free will and determinism, chance and fate. Discussion of the work of scientific and philosophical pioneers of probabilistic thought (e.g., Pascal, Leibniz, Bernoulli, Laplace) in conjunction with works by Shakespeare, Voltaire, H. G. Wells, Pynchon and Stoppard, among others. Enrollment limited."
        ],
        [
            "inst",
            [
                "S. Raman"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.018 Introduction to English Literature"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Examines the rich heritage of English literature across genre and historical period. Designed for students who want to know more about English literature or about English culture and history. Studies the relationships between literary themes, forms, and conventions and the times in which they were produced. Explores (for instance) Renaissance lyrics and drama, Enlightenment satires in word image, the 19th-century novel, and modern and contemporary stories, poems and film."
        ],
        [
            "inst",
            [
                "S. Tapscott"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.019 Introduction to European and Latin American Fiction"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Studies great works of European and Latin American fiction. Attention to a variety of forms including: the picaresque, epistolary, realist, naturalist, and magical realist fiction. Emphasizes ways in which the unique history of each country shaped the imaginative responses of its writers. Authors include Cervantes, Laclos, Goethe, Mann, Dostoevsky, Flaubert, Zola, Unamuno, Wolf, García Márquez, and Allende. Taught in English."
        ],
        [
            "inst",
            [
                "M. Resnick"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.021 Comedy"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Spring)"
            ]
        ],
        [
            "desc",
            "Surveys a range of comic texts in different media, the cultures that produced them, and various theories of comedy. Authors and directors studied may include Aristophanes, Shakespeare, Moliere, Austen, Wilde and Chaplin."
        ],
        [
            "inst",
            [
                "P. Donaldson"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.024 Literature and Existentialism"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Spring)"
            ]
        ],
        [
            "desc",
            "Studies major literary works associated with the 19th- and 20-century philosophical movement known as existentialism. Through close reading of these works, students explore how existentialist writers grappled with the question of death; the nature of free will; emotions like boredom, disgust, and radical doubt; and the fate of the individual in a modernity marked by war, illogic, and absurdity. Includes novels, short stories, and aphorisms by Sartre, Camus, Dostoevsky, Kafka, Hesse, Chopin, and Nietzsche; plays by Beckett and Stoppard; and films by Bergman, Tarkovsky, and others. Enrollment limited."
        ],
        [
            "inst",
            [
                "E. Brinkema"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.025 A History of the Book from Papyrus to Pixel"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Studies a broad range of texts and artifacts related to the history of writing and reading across cultures. Introduces students to the history and theory of media, to literary topics such as metafiction and narratology, and to the study of rare books and distinctive collections. Readings vary but may include literary works by authors such as Miguel Cervantes, Emily Dickinson, and Italo Calvino and theoretical writing by scholars including Marshall McLuhan and Roland Barthes. Regular sessions in MIT Libraries lead to capstone research projects on objects in MIT Archives and Special Collections. Students present on their readings and research in a variety of forms."
        ],
        [
            "inst",
            [
                "S. Frampton"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.032 Afrofuturism, Magical Realism, and Other Otherwise Worlds (New)"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: U (Fall)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Examines Afrofuturism, magical realism, and other forms of the fantastic in literary texts, film, and other media. Through close reading and attention to historical, cultural, and sociopolitical context, students consider how these works reinterpret the past, diagnose modernity, and posit alternative futures. Particular attention given to the roles race, gender, class, and sexuality play within these radically imaginative worlds. Topics vary from term to term but might include work by Octavia Butler, Gabriel García Márquez, Samuel Delany, Toni Morrison, N.K. Jemisin, José María Arguedas, and Janelle Monáe. Limited to 18."
        ],
        [
            "inst",
            [
                "J. Terrones"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.040[J] Foundations of East Asian Literature and Culture: From Confucius to the Beats"
        ],
        [
            "prerec",
            "Same subject as 21G.041[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Studies foundational works from East Asia (China, Japan, Korea, Vietnam) with a focus on their cultural context and contemporary relevance and asks how \"Literature\" looks different when conceived through some of the world's oldest literatures beyond the West. Explores philosophical texts, history writing, poetry, stories and diaries, tales, and novels. Hones skills of reading, writing, and speaking with a sense of cultural sensitivity, historical depth, and comparative contemplation. Students who have taken this topic under 21L.007 cannot also receive credit for 21L.040[J]."
        ],
        [
            "inst",
            [
                "W. Denecke"
            ]
        ]
    ],
    [
        "head",
        "Samplings"
    ],
    [
        "block",
        [
            "title",
            "21L.310 Bestsellers"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, Spring; second half of term)"
            ]
        ],
        [
            "desc",
            "Focuses on works that caught the popular imagination in the past or present. Emphasizes texts that are related by genre, theme or style. Books studied vary from term to term. May be repeated once for credit if content differs. Enrollment limited."
        ],
        [
            "inst",
            [
                "W. Kelley"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.315 Prizewinners and Laureates"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Examines particular texts and authors as having special merit and significance. Considers modern authors and filmmakers who have received such accolades as a Nobel Prize, a Pulitzer Prize, or an Oscar, as well as older authors who have been named as poets laureate, or honored by traditions of commentary, interpretation, and translation. Specific topics vary from term to term. May be repeated once for credit if the specific works studied differ. Enrollment limited."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.320 Big Books"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall; second half of term)"
            ]
        ],
        [
            "desc",
            "Intensive study of a single major literary work or a very small set of related literary works. Emphasizes texts that encourage close analysis in a way that cannot easily be integrated into the regular literature curriculum. The Big Books taught in previous terms include Moby-Dick, Canterbury Tales, and the Faerie Queene. May be repeated once for credit if the works studied differ. Enrollment limited."
        ],
        [
            "inst",
            [
                "N. Jackson"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.325 Small Wonders"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Spring; first half of term)"
            ]
        ],
        [
            "desc",
            "Close examination of a coherent set of short texts and/or visual works. The selections may be the shorter works of one or more authors (poems, short stories or novellas), or short films and other visual media. Content varies from term to term. May be repeated once for credit if the works studied differ."
        ],
        [
            "inst",
            [
                "W. Kelley"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.338 Reading in the Original"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Fall)"
            ]
        ],
        [
            "desc",
            "Close examination of literary texts in their original languages. Language and texts studied vary from term to term. May be repeated once for credit if content differs."
        ],
        [
            "inst",
            [
                "S. Frampton"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.340 Pleasures of Poetry"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "U (IAP)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Strengthens writing and reading comprehension skills. Students attend all public sessions of the Pleasures of Poetry readings and discussions as well as several additional classes. The poems chosen by the various moderators range across the history of literature, from ancient Chinese lyrics to contemporary texts. May be repeated for credit with permission of instructor."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.345 On the Screen"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "U (Spring; first half of term)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Examines works of film, television or other screen-based media, with emphasis on texts that are related by genre, time period, style, or director. Works studied vary from term to term. May be repeated for credit once with permission of instructor."
        ],
        [
            "inst",
            [
                "S. Tapscott"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.350 Science and Literature"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Fall; second half of term)"
            ]
        ],
        [
            "desc",
            "Examines intersections and channels of influence between the sciences and forms of imaginative literature. Addresses topics such as depictions of scientific experimentation in imaginative works, the history of scientific experimentation, and experimentation in literary works; the emergence of science fiction; and depictions of scientific practice in literature. May be repeated once for credit if content differs."
        ],
        [
            "inst",
            [
                "N. Jackson",
                "S. Raman"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.355 Literature in the Digital Age"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Spring; second half of term)"
            ]
        ],
        [
            "desc",
            "Examines how emerging computational methods and tools are transforming practices of reading and writing in the present. Topics may include the exploration of experimental literary forms and digital media practices (hypertext, Twitter fiction, etc.) or focus on the use of digital tools for analyzing literature (GIS mapping, data mining, etc.). May be repeated once for credit if content differs."
        ],
        [
            "inst",
            [
                "W. Kelley"
            ]
        ]
    ],
    [
        "head",
        "Intermediate Subjects"
    ],
    [
        "block",
        [
            "title",
            "21L.400 Medical Narratives: Compelling Accounts from Antiquity to Grey's Anatomy"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Explores fundamental questions about the experience of illness from the points of view of the patient, the physician, and the caretaker.  Examines the ways in which these narratives have changed across centuries and across cultures.  Asks about the physician's role in determining treatment; whether storytelling leads to more ethical life and death decisions; what special insights patient narratives provide; and what new awareness physicians derive from narrating illness. Materials include essays, fiction, poetry, memoir, blogs, film and television.  As a capstone project, students develop their own medical narratives that emerge in interaction with a mentor from the greater-Boston medical community."
        ],
        [
            "inst",
            [
                "M. Resnick"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.430 Popular Culture and Narrative"
        ],
        [
            "prerec",
            "Subject meets with CMS.920"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines relationships between popular culture and art, focusing on problems of evaluation and audience, and the uses of different media within a broader social context. Typically treats a range of narrative and dramatic works as well as films. Previously taught topics include Elements of Style; Gender, Sexuality and Popular Narrative. Students taking graduate version complete additional assignments. Approved for credit in Women's and Gender Studies when content meets the requirements for subjects in that program. May be repeated for credit with permission of instructor."
        ],
        [
            "inst",
            [
                "W. Donaldson"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.431 Shakespeare on Film and Media"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Spring)"
            ]
        ],
        [
            "desc",
            "Examines the adaptation, performance and interpretation of Shakespearean plays on film and video. Focus varies from term to term, to include films such as the Olivier and Almereyda versions of Hamlet and Baz Luhrmann's Romeo + Juliet; \"spin-offs\" such as Kurosawa's Throne of Blood and Shakespeare in Love; or theatrical videos of English language and international productions."
        ],
        [
            "inst",
            [
                "P. Donaldson"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.432[J] Understanding Television"
        ],
        [
            "prerec",
            "Same subject as CMS.315[J]\nSubject meets with CMS.915"
        ],
        [
            "terms",
            [
                "Prereq: One subject in Literature or Comparative Media Studies "
            ]
        ],
        [
            "desc",
            "A cultural approach to television's evolution as a technology and system of representation. Considers television as a system of storytelling and mythmaking, and as a cultural practice studied from anthropological, literary, and cinematic perspectives. Focuses on prime-time commercial broadcasting, the medium's technological and economic history, and theoretical perspectives. Considerable television viewing and readings in media theory and cultural interpretation are required. Previously taught topics include American Television: A Cultural History. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "D. Thorburn"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.433 Film Styles and Genres"
        ],
        [
            "prerec",
            "Prereq: 21L.011 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Close study of one or more directors, genres, periods, artistic movements, or national cinemas which have been of major significance in the history of film. Previously taught topics include Hollywood and Hong Kong, and Movie Realists: Chaplin, Renoir, Neorealism, Truffaut. May be repeated for credit by permission of instructor."
        ],
        [
            "inst",
            [
                "A. Fleche"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.434 Science Fiction and Fantasy"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Traces the history of science fiction as a generic tradition in literature, media, and popular culture. Considers formal ideological and cultural approaches to the analysis and interpretation of science fiction and fantasy texts. May be repeated for credit with permission of instructor if content differs."
        ],
        [
            "inst",
            [
                "M. Gubar"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.435 Literature and Film"
        ],
        [
            "prerec",
            "Subject meets with CMS.840"
        ],
        [
            "terms",
            [
                "Prereq: One subject in Literature or Comparative Media Studies "
            ]
        ],
        [
            "desc",
            "Investigates relationships between the two media, including film adaptations as well as works linked by genre, topic, and style. Explores how artworks challenge and cross cultural, political, and aesthetic boundaries. Students taking graduate version complete additional assignments. May be repeated for credit with permission of instructor if content differs."
        ],
        [
            "inst",
            [
                "A. Fleche"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.449 The Wilds of Literature"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: U (Spring)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Immerses students in literature that represents the interaction between humans and nature as joyous, sublime, revelatory, and mutually sustaining. Without denying the damage humans have wreaked on the environment, explores the role that pleasure, resilience, wonder, and hope might play in helping us to envision new modes of engagement with one another in an ever-changing environment. Students are enjoined to follow the example of authors — such as Henry David Thoreau, Annie Dillard, and Lauret Savoy — by selecting and visiting a local natural site, and writing about the experience. May be repeated for credit with permission of instructor if content differs."
        ],
        [
            "inst",
            [
                "M. Gubar",
                "J. Bennett",
                "S. Tapscott"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.451 Literary Theory"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: U (Spring)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Examines how we read texts and the questions that we, as readers, ask of them. Introduces different critical approaches to literature by examining the relationship between readers and text, between different texts, and between text and context. Topics vary but usually include reader-response theory, structuralism and semiotics, post-structuralism and post-modernism, historicism, psychoanalysis, intertextuality, cultural criticism, and media theory."
        ],
        [
            "inst",
            [
                "S. Raman"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.452[J] Literature and Philosophy"
        ],
        [
            "prerec",
            "Same subject as 24.240[J]"
        ],
        [
            "terms",
            [
                "Prereq: One philosophy subject "
            ]
        ],
        [
            "desc",
            "See description under subject 24.240[J]. Enrollment limited."
        ],
        [
            "inst",
            [
                "M. Gubar",
                "K. Setiya"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.455 Ancient Authors"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Spring)"
            ]
        ],
        [
            "desc",
            "Close examination of major works of classical Greek and Roman literature in translation. Topics may include epic, history, lyric poetry, or drama and the works of authors such as Thucydides, Homer, Virgil, and Cicero. Texts vary from term to term. May be repeated once for credit if content differs. Enrollment limited."
        ],
        [
            "inst",
            [
                "S. Frampton"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.456 The Bible: Old Testament"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Introduces students to the three divisions of the Old Testament: Pentateuch, Prophets, Writings. Particular attention to literary techniques, the historical periods that produced and are reflected in the various books, issues resulting from translation, and the difference between Old Testament and Hebrew Bible. Students cannot also receive credit for 21L.458."
        ],
        [
            "inst",
            [
                "I. Lipkowitz"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.457 The Bible: New Testament"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Spring)"
            ]
        ],
        [
            "desc",
            "Introduces students to the genres that comprise the New Testament: gospels, history, letters, apocalypse. Particular attention to historical context, canonicity, translation, and the transformation of Hebrew Bible into Old Testament. Students cannot also receive credit for 21L.458."
        ],
        [
            "inst",
            [
                "I. Lipkowitz"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.458 The Bible"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "An introduction to major books from both the Hebrew Bible and the New Testament. Particular attention given to literary techniques, issues resulting from translation from the original Hebrew and Greek, and the different historical periods that produced and are reflected in the Bible. Students cannot also receive credit for 21L.456 or 21L.457."
        ],
        [
            "inst",
            [
                "I. Lipkowitz"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.460 Arthurian Literature"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Fall)"
            ]
        ],
        [
            "desc",
            "Tracing the evolution of King Arthur (and principal knights), students consider what underlies the appeal of this figure whose consistent reappearance in western culture has performed the medieval prophecy that he would be rex quondam et futurus: the once and future king. Examines how Arthur's persona has been reinvented and rewritten throughout history, including portrayals as Christian hero and war-leader, ineffective king and pathetic cuckold, and as a tragic figure of noble but doomed intentions. Enrollment limited."
        ],
        [
            "inst",
            [
                "A. Bahr"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.471 Major Novels"
        ],
        [
            "prerec",
            "Prereq: One subject in Literature"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Fall)"
            ]
        ],
        [
            "desc",
            "Studies important examples of the literary form that, from the beginning of the 18th century to the present day, has become an indispensable instrument for representing modern life, in the hands of such writers as Cervantes, Defoe, Richardson, Sterne, Burney, Austen, Scott, Dickens, the Brontes, Eliot, Balzac, Stendhal, Flaubert, Hardy, Conrad, Woolf, Dostoevsky, Tolstoy, Proust, and others. May be repeated for credit with permission of instructor."
        ],
        [
            "inst",
            [
                "I. Lipkowitz"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.473[J] Jane Austen"
        ],
        [
            "prerec",
            "Same subject as WGS.240[J]"
        ],
        [
            "terms",
            [
                "Prereq: One subject in Literature "
            ]
        ],
        [
            "desc",
            "An examination of Jane Austen's satire in her seven complete novels, several fragments, and juvenilia. Students read these texts in relation to her letters and other biographical and historical information."
        ],
        [
            "inst",
            [
                "R. Perry"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.475 Enlightenment and Modernity"
        ],
        [
            "prerec",
            "Prereq: One subject in Literature"
        ],
        [
            "terms",
            [
                "U (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Examines selected topics in 18th- and 19th-century English/European literature and culture from the restoration of the English monarchy in 1660 to the end of Queen Victoria's reign in 1901. Topics vary by term; authors may include Jonathan Swift, Laurence Sterne, William Blake, William Wordsworth, Jane Austen, Charles Dickens, George Eliot, Lewis Carroll, Oscar Wilde, and Arthur Conan Doyle, among others. May be repeated for credit with permission of instructor."
        ],
        [
            "inst",
            [
                "J. Buzard"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.480[J] Identities and Intersections: Queer Literatures"
        ],
        [
            "prerec",
            "Same subject as WGS.245[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject WGS.245[J]."
        ],
        [
            "inst",
            [
                "J. Terrones"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.481[J] HIV/AIDS in American Culture"
        ],
        [
            "prerec",
            "Same subject as WGS.250[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject WGS.250[J]."
        ],
        [
            "inst",
            [
                "J. Terrones"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.485 Modern Fiction"
        ],
        [
            "prerec",
            "Prereq: One subject in Literature"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Spring)"
            ]
        ],
        [
            "desc",
            "Tradition and innovation in representative fiction of the early modern period. Recurring themes include the role of the artist in the modern period; the representation of psychological and sexual experience; and the virtues (and defects) of the aggressively experimental character. Works by Conrad, Kipling, Babel, Kafka, James, Lawrence, Mann, Ford Madox Ford, Joyce, Woolf, Faulkner, and Nabokov.  May be repeated for credit with permission of instructor if content differs."
        ],
        [
            "inst",
            [
                "D. Thorburn"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.486[J] Modern Drama"
        ],
        [
            "prerec",
            "Same subject as 21M.709[J]"
        ],
        [
            "terms",
            [
                "Prereq: One subject in Literature "
            ]
        ],
        [
            "desc",
            "Explores major modern plays with special attention to performance, sociopolitical and aesthetic contexts, and the role of theater in the contemporary multimedial landscape. Includes analysis of class, gender, and race as modes of performance. Typically features Beckett and Brecht, as well as some of the following playwrights: Chekov, Churchill, Deavere Smith, Ibsen, Fornes, Friel, Kushner, O'Neill, Shaw, Stoppard, Soyinka, Williams, Wilson. May be repeated for credit with permission of instructor if content differs."
        ],
        [
            "inst",
            [
                "D. Henderson"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.487 Modern Poetry"
        ],
        [
            "prerec",
            "Prereq: One subject in Literature"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Spring)"
            ]
        ],
        [
            "desc",
            "Study of major poems and manifestos from the late 19th century through the early 21st century. Examines works written in English, with some attention to Modernist texts from other cultures and other languages as well. Poems by T. S. Eliot, W. C. Williams, Langston Hughes, Robert Frost, Pablo Neruda, Hilda Doolittle, Charles Baudelaire, Anna Akhmatova, Bertolt Brecht, Rabindranath Tagore, and others. Comprised primarily of discussions, short papers, and a final project. May be repeated for credit with permission of instructor if content differs. "
        ],
        [
            "inst",
            [
                "S. Tapscott"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.488 Contemporary Literature"
        ],
        [
            "prerec",
            "Prereq: One subject in Literature"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Spring)"
            ]
        ],
        [
            "desc",
            "Study of key themes and techniques in prose, poetry, and drama since the 1970s. Recent topics include postmodernism, globalization, new British and Irish writing, and literature and development. May be repeated for credit with permission of instructor if content differs."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.489[J] Interactive Narrative"
        ],
        [
            "prerec",
            "Same subject as 21W.765[J], CMS.618[J]\nSubject meets with CMS.845"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21W.765[J]."
        ],
        [
            "inst",
            [
                "N. Montfort"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.490[J] Introduction to the Classics of Russian Literature"
        ],
        [
            "prerec",
            "Same subject as 21G.077[J]\nSubject meets with 21G.618"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21G.077[J]."
        ],
        [
            "inst",
            [
                "M. Khotimsky"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.491[J] Gateway to Korean Literature and Culture"
        ],
        [
            "prerec",
            "Same subject as 21G.066[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Introduction to two millennia of Korean literature and culture. Discusses texts, artifacts, and films in their cultural context and from a comparative global perspective. Explores poetry; historiography, story-telling, drama and fiction; philosophical and religious texts and practices; and visual materials. Includes creative exercises to help students develop their own Korean wave and K-drama passions with a critically informed eye."
        ],
        [
            "inst",
            [
                "W. Denecke"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.492[J] Three Kingdoms: From History to Fiction, Comic, Film, and Game (New)"
        ],
        [
            "prerec",
            "Same subject as 21G.042[J], 21H.352[J], CMS.359[J]\nSubject meets with 21G.133"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21G.042[J]."
        ],
        [
            "inst",
            [
                "E. Teng"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.493[J] Gateway to Japanese Literature and Culture (New)"
        ],
        [
            "prerec",
            "Same subject as 21G.062[J]\nSubject meets with 21G.562"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Surveys the nature, history, and distinctive features of Japanese literature and cultural history from the beginnings through the threshold of modernity. Examines various genres of poetry, historiography and mythological lore, prose tales and fiction, diaries, essays, Noh and puppet plays, short stories and novels; and helps students appreciate the texts' relevance in the historical and cultural context in which authors wrote them, in the broader context of literary traditions from around the world, and for the humanistic and aesthetic powers that make them poignant to us today. Showcases how authors increasingly enjoyed adapting, redoing, and satirizing earlier models, while constantly developing new expressive forms suited to the urgent needs of their time. Includes an eco-literature lab, a creative writing lab, and a history-writing lab for collaborative experimentation."
        ],
        [
            "inst",
            [
                "W. Denecke"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.494[J] Classics of Chinese Literature in Translation (21L.044)"
        ],
        [
            "prerec",
            "Same subject as 21G.044[J], WGS.235[J]\nSubject meets with 21G.195"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21G.044[J]."
        ],
        [
            "inst",
            [
                "E. Teng",
                "W. Denecke"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.006 American Literature"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Studies the national literature of the United States since the early 19th century. Considers a range of texts - including, novels, essays, films, and electronic media - and their efforts to define the notion of American identity. Readings usually include works by such authors as Nathaniel Hawthorne, Henry David Thoreau, Frederick Douglass, Emily Dickinson, Flannery O'Connor, William Faulkner, Sherman Alexie, and Toni Morrison. Enrollment limited."
        ],
        [
            "inst",
            [
                "W. Kelley"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.500[J] How We Got to Hamilton"
        ],
        [
            "prerec",
            "Same subject as 21M.729[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Traces the evolution of the American musical from minstrelsy to Hamilton. Equips students with terms, tools, and techniques to enrich their analysis of how individual songs, scenes, and dances — as well as whole shows — are structured. Recovers the groundbreaking yet often forgotten or appropriated achievements of artists of color to Broadway and Hollywood musicals. Features a mix of creative and critical assignments, some of which may be linked to field trips to local theaters, dance studios, and archives. Limited to 20."
        ],
        [
            "inst",
            [
                "M. Gubar"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.501 The American Novel"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Fall)"
            ]
        ],
        [
            "desc",
            "Works by major American novelists, beginning with the late 18th century and concluding with a contemporary novelist. Major emphasis on reading novels as literary texts, but attention paid to historical, intellectual, and political contexts as well. Syllabus varies from term to term, but many of the following writers are represented: Rowson, Hawthorne, Melville, Twain, Wharton, James, and Toni Morrison. Previously taught topics include The American Revolution and Makeovers (i.e. adaptations and reinterpretation of novels traditionally considered as American \"Classics\"). May be repeated for credit with instructor's permission so long as the content differs."
        ],
        [
            "inst",
            [
                "J. Terrones"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.504[J] Race and Identity in American Literature"
        ],
        [
            "prerec",
            "Same subject as WGS.140[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Questions posed by the literature of the Americas about the relationship of race and gender to authorship, audience, culture, ethnicity, and aesthetics. Social conditions and literary histories that shape the politics of identity in American literature. Specific focus varies each term. Previously taught topics include Immigrant Stories, African American Literature, and Asian American Literature. May be repeated for credit with permission of instructor if the content differs."
        ],
        [
            "inst",
            [
                "S. Alexandre"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.512 American Authors"
        ],
        [
            "prerec",
            "Prereq: One subject in Literature and permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Spring)"
            ]
        ],
        [
            "desc",
            "Examines in detail the works of several American authors selected according to a theme, period, genre, or set of issues. Through close readings of poetry, novels, or plays, subject addresses such issues as literary influence, cultural diversity, and the writer's career. Previously taught topics include American Women Writers, American Autobiography, American Political Writing, and American Short Fiction. Approved for credit in Women's and Gender Studies when content meets the requirements for subjects in that program. May be repeated for credit with instructor's permission so long as the content differs."
        ],
        [
            "inst",
            [
                "J. Terrones"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.007 World Literatures"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Spring)"
            ]
        ],
        [
            "desc",
            "Introduces students to a coherent set of textual and visual materials drawn from different geographical regions, languages, artistic genres, and historical periods. The focus may vary but usually cuts across national boundaries. Includes non-English works read in translation and examines different kinds of writing, both fiction and nonfiction. Pays special attention to such issues as identity formation, cultural contact, exploration, and exile. Previously taught topics include contemporary writing from Africa and South Asia, the impact of the discovery of the New World, and Caribbean literature.  May be repeated for credit with permission of instructor if content differs. Enrollment limited."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.020[J] Globalization: The Good, the Bad and the In-Between"
        ],
        [
            "prerec",
            "Same subject as WGS.145[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines the cultural paradoxes of contemporary globalization. Studies the cultural, artistic, social and political impact of globalization across international borders. Students analyze contending definitions of globalization and principal agents of change, and why some of them engender backlash; identify the agents, costs and benefits of global networks; and explore how world citizens preserve cultural specificity. Case studies on global health, human trafficking and labor migration illuminate the shaping influence of contemporary globalization on gender, race, ethnicity, and class. Develops cultural literacy through analysis of fiction and film. Enrollment limited."
        ],
        [
            "inst",
            [
                "M. Resnick"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.522[J] International Women's Voices"
        ],
        [
            "prerec",
            "Same subject as 21G.022[J], WGS.141[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Introduces students to a variety of fictional works by contemporary women writers. International perspective emphasizes the extent to which each author's work reflects her distinct cultural heritage and to what extent, if any, there is an identifiable female voice that transcends national boundaries. Uses a variety of interpretive perspectives, including sociohistorical, psychoanalytic, and feminist criticism, to examine texts. Authors include Mariama Ba, Isabel Allende, Anita Desai, Maxine Hong Kingston, Toni Morrison, Doris Lessing, Alifa Riyaat, Yang Jiang, Nawal Al-Saadawi, and Sawako Ariyoshi. Taught in English."
        ],
        [
            "inst",
            [
                "M. Resnick"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.580 Translations"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: U (Fall)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Students study theories of translation, compare examples of multiple renderings of the same work, and work on translation projects. Supplementary assignments focus on adaptation of works from one genre to another, and on transmission of information from one mode to another (visual to verbal changes, American Sign Language, etc.). Students write essays about relative theories of translation and about comparisons of variant versions, and also work on translation projects of their own in workshop-format. Includes texts such as the King James Bible, and writers such as Walter Benjamin, George Steiner, Wislawa Szymborska, Czeslaw Milosz, Pablo Neruda, Gabriela Mistral, Rainer Maria Rilke, William Gass, and Robert Pinsky. Limited to 18."
        ],
        [
            "inst",
            [
                "S. Tapscott"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.590[J] The Spanish Incubator"
        ],
        [
            "prerec",
            "Same subject as 21G.073[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Students travel to Spain to explore the country's influence on our understanding of contemporary culture, from its role as the crucible of the international avant-garde, to its genesis of political art and writing, to its Civil War that ignited the artistic passion of authors around the world, to the exuberant liberation after 40 years of dictatorship. Readings include Hemingway, Lorca, Orwell, Neruda, memoirs of Americans of the Abraham Lincoln Brigade, Spanish poetry of the war and repression that followed, and the films of Saura and Almodovar. Films, readings, field trips to museums, and cultural events enable students to understand the full context in which today's vibrant Spanish democracy emerged. Contact Literature about travel fee and possible funding opportunities. Enrollment limited. Application required; contact Literature Headquarters for details."
        ],
        [
            "inst",
            [
                "M. Resnick"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.591 Literary London"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (IAP)"
            ]
        ],
        [
            "desc",
            "Based in London, explores the specific locations, history and artistic institutions that have made London a world cultural hub, deepening students' knowledge gained on site through guided readings, theater performances, visits to homes associated with major authors, guest experts, and independent \"author mapping\" projects with reports back to the class.  Sharpens students' understanding of the complexities of international exchange and identity formation in a global age. Contact Literature about travel fee and possible funding opportunities. Enrollment limited. Application required; contact Literature Headquarters for details."
        ],
        [
            "inst",
            [
                "D. Henderson"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.592[J] Race, Place, and Modernity in the Americas"
        ],
        [
            "prerec",
            "Same subject as 21W.781[J], WGS.247[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject WGS.247[J]. Enrollment limited to 20. Application required."
        ],
        [
            "inst",
            [
                "J. Terrones"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.601[J] Old English and Beowulf"
        ],
        [
            "prerec",
            "Same subject as 24.916[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Intensive introduction to Old English (also called Anglo-Saxon), the ancestor of modern English that was spoken in England ca. 600-1100. In the first half of the term, students use short prose texts to study the basics of Old English grammar. They go on to read short poems, and conclude by tackling portions of the epic Beowulf in the last third of the term. Assessment based upon translation work, daily vocabulary quizzes, and three exams. Limited to 16."
        ],
        [
            "inst",
            [
                "A. Bahr"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.607 Greek I"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall; first half of term)"
            ]
        ],
        [
            "desc",
            "Introduces rudiments of ancient Greek - the language of Plato, Sophocles, Thucydides, and Euclid, and the basis for that of the New Testament - to students with little or no prior knowledge of the subject. Aimed at laying a foundation to begin reading ancient and/or medieval texts. Greek I and Greek II may be combined (after completion of both) to count as a single HASS-H. Limited to 20."
        ],
        [
            "inst",
            [
                "S. Frampton"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.608 Greek II"
        ],
        [
            "prerec",
            "Prereq: 21L.607 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall; second half of term)"
            ]
        ],
        [
            "desc",
            "Introductory Greek subject for students with some prior knowledge of basic grammar and vocabulary. Intended to refresh and enrich ability to read ancient and/or medieval literary and historical texts. May be taken independently of Greek I with permission of instructor. Greek I and Greek II may be combined (after completion of both) to count as a single HASS-H. Limited to 20."
        ],
        [
            "inst",
            [
                "S. Frampton"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.609 Greek Readings"
        ],
        [
            "prerec",
            "Prereq: 21L.608 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Spring; first half of term)"
            ]
        ],
        [
            "desc",
            "Introduction to reading ancient Greek literature in the original language. Provides a bridge between the study of Greek grammar and the reading of Greek authors. Improves knowledge of the language through careful examination of literary texts, both prose and poetry. Builds proficiency in reading Greek and develops appreciation for basic features of style and genre. Texts vary from term to term. May be repeated once for credit if content differs. 21L.609 and 21L.610, or two terms of 21L.609, may be combined by petition (after completion of both) to count as a single HASS-H."
        ],
        [
            "inst",
            [
                "S. Frampton"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.610 Advanced Greek Readings"
        ],
        [
            "prerec",
            "Prereq: 21L.609 or (placement exam and permission of instructor)"
        ],
        [
            "terms",
            [
                "U (Spring; second half of term)"
            ]
        ],
        [
            "desc",
            "Building on 21L.609, develops the ability to read and analyze ancient Greek literary texts, both prose and poetry. Focuses on increasing fluency in reading comprehension and recognition of stylistic, generic, and grammatical features. Texts vary from term to term. May be repeated once for credit if content differs. 21L.610 and 21L.609, or two terms of 21L.610, may be combined by petition (after completion of both) to count as a single HASS-H."
        ],
        [
            "inst",
            [
                "S. Frampton"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.611 Latin I"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Spring; first half of term)"
            ]
        ],
        [
            "desc",
            "Introduces rudiments of Latin to students with little or no prior knowledge of the subject. Aimed at laying a foundation to begin reading ancient and/or medieval literary and historical texts. Latin I and Latin II may be combined by petition (after completion of both) to count as a single HASS-H. Limited to 20."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.612 Latin II"
        ],
        [
            "prerec",
            "Prereq: 21L.611 or permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Spring; second half of term)"
            ]
        ],
        [
            "desc",
            "Introductory Latin subject for students with some prior knowledge of basic grammar and vocabulary. Intended to refresh and enrich ability to read ancient and/or medieval literary and historical texts. May be taken independently of Latin I with permission of instructor. Latin I and Latin II may be combined by petition (after completion of both) to count as a single HASS-H. Limited to 20."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.613 Latin Readings"
        ],
        [
            "prerec",
            "Prereq: 21L.611 or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall; first half of term)"
            ]
        ],
        [
            "desc",
            "Introduction to reading Latin literature in the original language. Provides a bridge between the study of Latin grammar and the reading of Latin authors. Improves knowledge of the language through careful examination of literary texts, focusing on prose and poetry in alternate years. Builds proficiency in reading Latin and develops appreciation for basic features of style and genre. Texts vary from term to term. May be repeated once for credit if content differs. 21L.613 and 21L.614, or two terms of 21L.613, may be combined by petition (after completion of both) to count as a single HASS-H."
        ],
        [
            "inst",
            [
                "S. Frampton"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.614 Advanced Latin Readings"
        ],
        [
            "prerec",
            "Prereq: 21L.613 or (placement exam and permission of instructor)"
        ],
        [
            "terms",
            [
                "U (Fall; first half of term)"
            ]
        ],
        [
            "desc",
            "Building on 21L.613, develops the ability to read and analyze Latin literary texts, focusing on prose and poetry in alternate years. Increases fluency in reading comprehension and recognition of stylistic, generic, and grammatical features. Texts vary from term to term. May be repeated once for credit if content differs. 21L.613 and 21L.614, or two terms of 21L.614, may be combined by petition (after completion of both) to count as a single HASS-H."
        ],
        [
            "inst",
            [
                "S. Frampton"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.620[J] Introduction to French Literature"
        ],
        [
            "prerec",
            "Same subject as 21G.320[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21G.304\" title=\"21G.304\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21G.304');\">21G.304</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "See description under subject 21G.320[J]."
        ],
        [
            "inst",
            [
                "B. Perreau"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.621[J] French Feminist Literature: Yesterday and Today"
        ],
        [
            "prerec",
            "Same subject as 21G.344[J], WGS.321[J]"
        ],
        [
            "terms",
            [
                "Prereq: One intermediate subject in French or permission of instructor "
            ]
        ],
        [
            "desc",
            "See description under subject 21G.344[J]. Limited to 18."
        ],
        [
            "inst",
            [
                "B. Perreau"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.636[J] Introduction to Contemporary Hispanic Literature and Film"
        ],
        [
            "prerec",
            "Same subject as 21G.716[J]"
        ],
        [
            "terms",
            [
                "Prereq: One intermediate subject in Spanish or permission of instructor "
            ]
        ],
        [
            "desc",
            "Focuses on literary and cinematic production in 20th- and 21st-century Spain and Latin America with a particular emphasis on how social, cultural, political, and technological changes led to aesthetic innovations. Topics include the literature of politics, the avant-garde and subsequent literary boom, the radical aesthetic of the post-Franco era, and post-modern film and art. Materials include short stories, novels, poetry, song, and film. Conducted in Spanish."
        ],
        [
            "inst",
            [
                "M. Resnick"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.637[J] Power and Culture: Utopias and Dystopias in Spain and Latin America"
        ],
        [
            "prerec",
            "Same subject as 21G.717[J]"
        ],
        [
            "terms",
            [
                "Prereq: One intermediate subject in Spanish or permission of instructor "
            ]
        ],
        [
            "desc",
            "Studies how new literary, artistic and musical forms have emerged in response to tensions and contradictions in Hispanic culture, from the eighth century to the present. Examines distinctively Hispanic artistic movements and modes from Al-Andalus' vibrant heterogeneity to the enforced homogeneity of the Spanish Inquisition; from a rich plurality of pre-Colombian civilizations to the imposed conversions by conquistadors; from the revolutionary zeal of Latin America's liberators to the crushing dictatorships that followed; from the promise of globalization to the struggle against US cultural imperialism. Taught in Spanish. Limited to 18."
        ],
        [
            "inst",
            [
                "M. Resnick"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.638[J] Literature and Social Conflict: Perspectives on the Hispanic World"
        ],
        [
            "prerec",
            "Same subject as 21G.738[J]"
        ],
        [
            "terms",
            [
                "Prereq: One intermediate subject in Spanish or permission of instructor "
            ]
        ],
        [
            "desc",
            "Considers how major literary texts illuminate principal issues in the evolution of modern Spanish society. Emphasizes the treatment of such major questions as the exile of liberals in 1820, the concept of progress, the place of religion, urbanization, rural conservatism and changing gender roles, and the Spanish Civil War. Authors include Perez Galdos, Pardo Bazan, Unamuno, Ortega y Gasset, Salinas, Lorca, La Pasionaria, and Falcon. Taught in Spanish."
        ],
        [
            "inst",
            [
                "J. Terrones"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.639[J] Globalization and its Discontents: Spanish-speaking Nations"
        ],
        [
            "prerec",
            "Same subject as 21G.739[J]"
        ],
        [
            "terms",
            [
                "Prereq: One intermediate subject in Spanish or permission of instructor "
            ]
        ],
        [
            "desc",
            "Studies new paradigms of cultural exchange that have shaped Latin America in the 20th and 21st centuries. Examines how globalization is rapidly changing the identity of peoples and cultures in Spanish-speaking nations. Spotlights debates about human rights. Materials studied include film, fiction, essay, architectural archives, music and art. Students complete a research project about a specific aspect of Hispanic culture that has been shaped by contemporary forces in the global economy. Taught in Spanish with required readings and writing in Spanish."
        ],
        [
            "inst",
            [
                "M. Resnick"
            ]
        ]
    ],
    [
        "head",
        "Seminars"
    ],
    [
        "block",
        [
            "title",
            "21L.640[J] The New Spain: 1977-Present"
        ],
        [
            "prerec",
            "Same subject as 21G.740[J]"
        ],
        [
            "terms",
            [
                "Prereq: One intermediate subject in Spanish or permission of instructor "
            ]
        ],
        [
            "desc",
            "Deals with the vast changes in Spanish social, political and cultural life that have taken place since the death of Franco. Topics include new freedom from censorship, the re-emergence of strong movements for regional autonomy (the Basque region and Catalonia), the new cinema including Almodovar and Saura, educational reforms instituted by the socialist government, and the fiction of Carme Riera and Terenci Moix. Special emphasis on the emergence of mass media as a vehicle for expression in Spain. Considers the changes wrought by Spain's acceptance into the European Community. Materials include magazines, newspapers, films, fiction, and Amando de Miguel's Los Españoles. Taught in Spanish."
        ],
        [
            "inst",
            [
                "M. Resnick"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.701 Literary Methods"
        ],
        [
            "prerec",
            "Prereq: Two subjects in Literature"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Introduces practice and theory of literary criticism. Seminar focuses on topics such as the history of critical methods and techniques, and the continuity of certain subjects in literary history. Instruction and practice in oral and written communication. Previously taught topics include Virginia Woolf's Shakespeare, Theory and Use of Figurative Language, and Text, Context, Subtext, Pretext. Approved for credit in the Women's and Gender Studies when content meets requirements for subjects in that program. May be repeated for credit with permission of instructor if content differs. Limited to 12."
        ],
        [
            "inst",
            [
                "W. Kelley"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.702 Studies in Fiction"
        ],
        [
            "prerec",
            "Prereq: Two subjects in Literature"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Intensive study of a range of texts by a single author or by a limited group of authors whose achievements are mutually illuminating. Some attention to narrative theory and biographical and cultural backgrounds. Instruction and practice in oral and written communication. Previously taught topics include Stowe, Twain, and the Transformation of 19th-century America, and Joyce and the Legacy of Modernism. Approved for credit in Women's and Gender Studies when content meets the requirements for subjects in that program. May be repeated for credit with permission of instructor if content differs. Limited to 12."
        ],
        [
            "inst",
            [
                "J. Buzard"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.703[J] Studies in Drama"
        ],
        [
            "prerec",
            "Same subject as 21M.719[J]"
        ],
        [
            "terms",
            [
                "Prereq: Two subjects in Literature "
            ]
        ],
        [
            "desc",
            "Intensive study of an important topic or period in drama. Close analysis of major plays, enriched by critical readings and attention to historical and theatrical contexts. Instruction and practice in oral and written communication through student presentations and research essays. Previously taught topics include: Renaissance Drama; Shakespeare with his Contemporaries; Oscar Wilde; and Stoppard and Company. May be repeated for credit with permission of instructor if content differs. Limited to 12."
        ],
        [
            "inst",
            [
                "S. Raman"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.704 Studies in Poetry"
        ],
        [
            "prerec",
            "Prereq: Two subjects in Literature"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Intensive study of a body of poetry, raising questions of form, authorship, poetic influence, social context, and literary tradition. Instruction and practice in oral and written communication. Previously taught topics include: Does poetry Matter?, Poetry and the Science of Mind; Songs, Sonnets and the Story of English; Virgil, Spenser, Milton; and The Image: Poetry, Photography, and Technologies of Vision. Approved for credit in Women's and Gender Studies when content meets the requirements for subjects in that program. May be repeated for credit with permission of instructor if content differs. Limited to 12."
        ],
        [
            "inst",
            [
                "N. Jackson"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.705 Major Authors"
        ],
        [
            "prerec",
            "Prereq: Two subjects in Literature"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Close study of a limited group of writers. Instruction and practice in oral and written communication. Previously taught topics include John Milton and his Age, Chaucer, Herman Melville, Toni Morrison, and Oscar Wilde and the '90s. Approved for credit in Women's and Gender Studies when content meets the requirements for subjects in that program. May be repeated for credit with permission of instructor if content differs. Limited to 12."
        ],
        [
            "inst",
            [
                "M. Fuller"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.706 Studies in Film"
        ],
        [
            "prerec",
            "Subject meets with CMS.830"
        ],
        [
            "terms",
            [
                "Prereq: (<a href=\"/search/?P=21L.011\" title=\"21L.011\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21L.011');\">21L.011</a> and one subject in Literature or Comparative Media Studies) or permission of instructor "
            ]
        ],
        [
            "desc",
            "Intensive study of films from particular periods, genres, or directors, or films focusing on specific formal or theoretical problems. Instruction and practice in oral and written communication provided. Previous topics include The Contemporary Horror Film, Film Remixes, Film Narrative, Heroic Cinema, and Color in Film. Students taking graduate version complete different assignments. May be repeated for credit with permission of instructor if content differs. Limited to 12."
        ],
        [
            "inst",
            [
                "P. Donaldson",
                "E. Brinkema"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.707 Problems in Cultural Interpretation"
        ],
        [
            "prerec",
            "Prereq: Two subjects in Literature or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Studies the relation between imaginative texts and the culture surrounding them. Emphasizes ways in which imaginative works absorb, reflect, and conflict with reigning attitudes and world views. Instruction and practice in oral and written communication. Previously taught topics include Women Reading/Women Writing; Poetry, Passion, and the Self; and Race, Religion and Identity in Early Modern America. Approved for credit in Women's and Gender Studies when content meets the requirements for subjects in that program. May be repeated for credit with permission of instructor if content differs. Limited to 12."
        ],
        [
            "inst",
            [
                "I. Lipkowitz"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.709 Studies in Literary History"
        ],
        [
            "prerec",
            "Prereq: Two subjects in Literature or History"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Spring)"
            ]
        ],
        [
            "desc",
            "Close examination of the literature of a particular historical period. Instruction and practice in oral and written communication. Syllabi vary. Previous topics include Britons Abroad in the 18th Century; Modernism: From Nietzsche to Fellini; and Make it New: Manifestos and the Invention of the Modern.  May be repeated for credit with permission of instructor if content differs. Limited to 12."
        ],
        [
            "inst",
            [
                "W. Kelley"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.715 Media in Cultural Context"
        ],
        [
            "prerec",
            "Subject meets with CMS.871"
        ],
        [
            "terms",
            [
                "Prereq: Two subjects in Literature or Comparative Media Studies or permission of instructor "
            ]
        ],
        [
            "desc",
            "Seminar uses case studies to examine specific media or media configurations and the larger social, cultural, economic, political, or technological contexts within which they operate. Organized around recurring themes in media history, as well as specific genres, movements, media, or historical moments. Previously taught topics include Gendered Genres: Horror and Maternal Melodramas; Comics, Cartoons, and Graphic Storytelling; and Exploring Children's Culture. Students taking graduate version complete additional assignments. Approved for credit in Women's and Gender Studies when content meets the requirements for subjects in that program. May be repeated for credit with permission of instructor if content differs. Limited to 12."
        ],
        [
            "inst",
            [
                "M. Marks"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.720 Chaucer's Canterbury Tales"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Fall)"
            ]
        ],
        [
            "desc",
            "Intensive study of Geoffrey Chaucer's Canterbury Tales, with particular attention to formal analysis and cultural context. Students work closely with the linguistic nuances of Chaucer's Middle English, and examine scholarly research in the fields of both literary and medieval studies. Limited to 12."
        ],
        [
            "inst",
            [
                "A. Bahr"
            ]
        ]
    ],
    [
        "head",
        "Special Subjects, Research, and Thesis"
    ],
    [
        "block",
        [
            "title",
            "21L.900 Independent Study"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Open to qualified students who wish to pursue an independent study with members of the Literature faculty. Normal maximum is 6 units, though exceptional 9-unit projects are occasionally approved. May be repeated for credit with permission of instructor."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.901 Independent Study"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "U (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Open to qualified students who wish to pursue an independent study with members of the Literature faculty. Normal maximum is 6 units, though exceptional 9-unit projects are occasionally approved. May be repeated for credit with permission of instructor."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.S88 Special Subject in Literature"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: U (Spring)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Covers topics in Literature that are not provided in the regular subject offerings. Units vary depending on the number of class meetings, readings and assignments. May be repeated for credit if the subjects are different."
        ],
        [
            "inst",
            [
                "S. Frampton"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.S89 Special Subject in Literature"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Covers topics in Literature that are not provided in the regular subject offerings. Units vary depending on the number of class meetings, readings and assignments. May be repeated for credit if the subjects are different."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.S90 Special Subject in Literature"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "U (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Covers topics in Literature that are not provided in the regular subject offerings. Units vary depending on the number of class meetings, readings and assignments. May be repeated for credit if the subjects are different."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.S91 Special Subject in Literature"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Covers topics in Literature that are not provided in the regular subject offerings. Units vary depending on the number of class meetings, readings and assignments. May be repeated for credit if the subjects are different."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.S92 Special Subject in Literature"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Covers topics in Literature that are not provided in the regular subject offerings. Units vary depending on the number of class meetings, readings and assignments. May be repeated for credit if the subjects are different."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.S93 Special Subject in Literature"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "U (IAP)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Covers topics in Literature that are not provided in the regular subject offerings. Units vary depending on the number of class meetings, readings and assignments. May be repeated for credit if the subjects are different."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.S94 Special Subject in Literature"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Covers topics in Literature that are not provided in the regular subject offerings. Units vary depending on the number of class meetings, readings and assignments. May be repeated for credit if the subjects are different."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.S95 Special Subject in Literature"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Covers topics in Literature that are not provided in the regular subject offerings. Units vary depending on the number of class meetings, readings and assignments. May be repeated for credit if the subjects are different."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.S96 Special Subject in Film and Media"
        ],
        [
            "prerec",
            "Prereq: Two subjects in Film and Media and permission of the director of Comparative Media Studies"
        ],
        [
            "terms",
            [
                "U (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Open to qualified students who wish to pursue special projects with film and media studies faculty. Individual or small group projects encouraged. Usually limited to 6 credits. May be repeated for credit with additional permission of the instructor."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.S97 Special Subject in Film and Media"
        ],
        [
            "prerec",
            "Prereq: Two subjects in Film and Media and permission of director of Comparative Media Studies"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Open to qualified students who wish to pursue special projects with film and media studies faculty. Individual or small group projects encouraged. Usually limited to 6 credits. May be repeated for credit with additional permission of the instructor."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.THT Literature Pre-Thesis Tutorial"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Definition of and early-stage work on thesis project leading to 21L.THU. Taken during the first term of the student's two-term commitment to the thesis project. Student works closely with an individual faculty tutor. Required for students in Course 21L when the thesis is a degree requirement."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.THU Literature Thesis"
        ],
        [
            "prerec",
            "Prereq: 21L.THT"
        ],
        [
            "terms",
            [
                "U (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Completion of work on the senior major thesis under supervision of a faculty tutor. Includes oral presentation of thesis progress early in the term, assembling and revising the final text, and meeting at the close with a committee of faculty evaluators to discuss the successes and limitations of the project. Required for students in Course 21L when the thesis is a degree requirement."
        ],
        [
            "inst",
            [
                "S. Raman"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.UR Undergraduate Research"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Individual participation in an ongoing research project. For students in the Undergraduate Research Opportunities Program."
        ],
        [
            "inst",
            [
                "Consult with Section UROP Coordinator"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21L.URG Undergraduate Research"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Individual participation in an ongoing research project. For students in the Undergraduate Research Opportunities Program."
        ],
        [
            "inst",
            [
                "Consult with Section UROP Coordinator"
            ]
        ]
    ]
]