[
    "Comparative Media Studies / Writing (Course 21W)",
    [
        "head",
        "First-Year Writing Subjects"
    ],
    [
        "block",
        [
            "title",
            "21W.011 Writing and Rhetoric: Rhetoric and Contemporary Issues"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Provides the opportunity for students - as readers, viewers, writers, and speakers - to engage with social and ethical issues they care deeply about. Explores perspectives on a range of social issues, such as the responsibilities of citizens, freedom of expression, poverty and homelessness, mental illness, the challenges of an aging society, the politics of food, and racial and gender inequality. Discusses rhetorical strategies that aim to increase awareness of social problems; to educate the public about different perspectives on contemporary issues; and to persuade readers of the value of particular positions on, or solutions to, social problems. Students analyze selected texts and photographs, as well as documentary and feature films, that represent or dramatize social problems or issues. Students also write essays about social and ethical issues of their own choice. Limited to 15."
        ],
        [
            "inst",
            [
                "A. Walsh"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.012 Writing and Rhetoric: Food for Thought"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Explores many of the issues that surround food as both material fact and personal and cultural symbol. Includes non-fiction works on topics such as family meals, food's ability to awaken us to \"our own powers of enjoyment\" (M.F.K. Fisher), and eating as an \"agricultural act\" (W. Berry). Students read Michael Pollan's best-selling book In Defense of Food and discuss the issues it raises about America's food supply and eating habits, as well as the rhetorical strategies it employs. Assignments include narratives, analytical essays, and research-based essays. Limited to 15."
        ],
        [
            "inst",
            [
                "S. Carlisle"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.013 Writing and Rhetoric: Introduction to Contemporary Rhetoric"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Considers how rhetoric shapes current events in politics, science, and society. Students study rhetoric as a theoretical framework for developing persuasive arguments, as a method of analyzing written, oral, and visual texts, and as a mode of human inquiry. Assignments include analytical, persuasive, and research-based essays, as well as oral presentations, group discussions, and debates. Readings drawn from political speeches, scientific arguments, and popular media. Limited to 15."
        ],
        [
            "inst",
            [
                "L. Harrison-Lepera"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.014 Writing and Rhetoric: Exploring Visual Media"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Explores the rhetoric of visual media and the meaning of the digital revolution. Students analyze readings and films and discuss the power of media in defining social issues and shaping ideas of self, family, and community. They also write essays that sharpen skills in analyzing visual rhetoric, developing and supporting arguments, and using sources. Limited to 18."
        ],
        [
            "inst",
            [
                "A. Walsh"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.015 Writing and Rhetoric: Writing about Sports"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Examines the role of sports in our individual lives and American culture at large. Considers a broad range of issues, such as heroism and ethical conundrums, gender equality, steroids, and the proper role of sports in college life. Examples of high-quality, descriptive and analytic sports writing serve as the focus for class discussion and as models for student essays. Limited to 15."
        ],
        [
            "inst",
            [
                "A. Karatsolis"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.016 Writing and Rhetoric: Designing Meaning"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Explores how we use rhetoric in text, visuals, and other modes to make meaning. Uses analysis, composition, and debate about rhetorical strategies to develop theoretical and empirical knowledge of how design choices shape our texts and our understanding of the world. In lab, students experiment with rhetorical strategies and assess their effects. Limited to 15."
        ],
        [
            "inst",
            [
                "S. Lane"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.021 Writing and Experience: MIT Inside, Live"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Acting as participant-observers, students investigate MIT's history and culture through visits to the Institute's archives and museums, relevant readings, and depictions of MIT in popular culture. Students chronicle their experiences and insights through a variety of writing projects, culminating in the completion of a portfolio. Limited to 15."
        ],
        [
            "inst",
            [
                "J. Graziano"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.022 Writing and Experience: Reading and Writing Autobiography"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Draws on a range of autobiographical writing as examples for students to analyze. Students write essays that focus on their own experience, exploring topics such as intellectual growth and development, the childhood and high school years, life at MIT, the influence of place upon one's personality and character, and the role politics and religion play in one's life. Emphasizes clarity, specificity, and structure; investigates various modes of writing (narrative, analytical, expository) and their suitability for different purposes. Limited to 15."
        ],
        [
            "inst",
            [
                "L. Harrison Lepera",
                "N. Jackson",
                "S. Carlisle",
                "S. Carlisle",
                "L. Harrison Lepera",
                "A. Walsh"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.031 Science Writing and New Media: Explorations in Communicating about Science and Technology"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Examines principles of good writing, focusing on those associated with scientific and technical writing. Considers the effects of new media as an avenue for communicating about science. Students discuss scientific articles and essays and work in small groups to critique each other's writing. Assignments include a critical review, a science essay for the general public, and a research or service project proposal. Students choose topics that reflect their background and interests. Formal and informal presentations and group discussions develop oral communication skills. Limited to 15."
        ],
        [
            "inst",
            [
                "J. Melvold"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.034 Science Writing and New Media: Perspectives on Medicine and Public Health"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Public health topics, such as AIDS, asthma, malaria control, obesity, and sleep deprivation, provide a unifying focus as students explore diverse modes of science writing. Readings include essays by such writers as Atul Gawande, Danielle Ofri, Jerome Groopman, and William Carlos Williams, as well as peer-reviewed journal articles. Assignments include a critical review, a scientific literature review, a brochure suitable for general distribution, an autobiographical narrative, a resume, a job application letter, and oral presentations. Limited to 18."
        ],
        [
            "inst",
            [
                "C. Taft"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.035 Science Writing and New Media: Elements of Science Writing for the Public"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Introduces ways of communicating scientific information meaningfully to public audiences, and teaches features that distinguish science writing for the public from scientific writing aimed at experts. Discussions analyze various forms of popular science communication to identify rhetorical strategies that engage and educate readers of varying backgrounds and identities. Students write about topics they are genuinely interested in related to science, medicine, technology, and/or engineering. Assignments incorporate primary and secondary background research, drafting, presentations, peer review, and revision. Limited to 15."
        ],
        [
            "inst",
            [
                "A. Carleton",
                "E. Kallestinova, J. Berezin"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.036 Science Writing and New Media: Writing and the Environment"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Spring)"
            ]
        ],
        [
            "desc",
            "Develops written and oral communication skills through the study and practice of environmental science writing. Covers a wide range of genres, including such standard forms as the scientific literature review. Students adapt the content of their papers and oral presentations to the distinctive needs of specific audiences. Assignments provide thematic coherence and a basis for independent student research. Limited to 15."
        ],
        [
            "inst",
            [
                "C. Taft"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.041[J] Writing About Literature"
        ],
        [
            "prerec",
            "Same subject as 21L.000[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21L.000[J]. Enrollment limited."
        ],
        [
            "inst",
            [
                "W. Kelley",
                "I. Lipkowitz"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.042[J] Writing with Shakespeare"
        ],
        [
            "prerec",
            "Same subject as 21L.010[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21L.010[J]."
        ],
        [
            "inst",
            [
                "D. Henderson"
            ]
        ]
    ],
    [
        "head",
        "English Language Studies (ELS)"
    ],
    [
        "block",
        [
            "title",
            "21W.217 Workshop in Strategies for Effective Teaching (ELS)"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (IAP; partial term)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "A mini-module for international teaching assistants. Covers special problems in teaching when English is a second language and the US a second culture. Videotaping of practice sessions for feedback. Individualized programs to meet different needs. Graduate TAs have priority. Limited to 18."
        ],
        [
            "inst",
            [
                "A. C. Kemp"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.218 Workshop in Strategies for Effective Teaching (ELS)"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (IAP; partial term)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "A mini-module for international teaching assistants. Covers special problems in teaching when English is a second language and the US a second culture. Videotaping of practice sessions for feedback. Individualized programs to meet different needs. Limited to 18."
        ],
        [
            "inst",
            [
                "A. C. Kemp"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.219 Foundations of Academic and Professional Writing (ELS)"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Writing module for high-intermediate ELS students who wish to review and practice accurate grammar, effective sentence and paragraph structure, punctuation, and word choice. Short weekly writing assignments with extensive editing required. Meets with 21W.220 when offered concurrently. Limited to 18."
        ],
        [
            "inst",
            [
                "E. Grunwald"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.220 Foundations of Academic and Professional Writing (ELS)"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Writing module for high intermediate ELS students who wish to review and practice accurate grammar, effective sentence and paragraph structure, punctuation, and word choice. Short weekly writing assignments with extensive editing required. Meets with 21W.219 when offered concurrently. Limited to 18."
        ],
        [
            "inst",
            [
                "E. Grunwald"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.221 Communicating in American Culture (ELS)"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Designed for international students who wish to refine their academic communication skills through the study of mainstream American culture. Using a variety of materials in different media, students explore how the country's history, geography, institutions, traditions and values have shaped contemporary communication styles and responses to critical events in the world. Students examine and practice principles of effective communication in genres common to the humanities and social sciences. Explores how discourse practices vary within and across cultures. Assignments include an educational memoir, project proposal, annotated bibliography, research-based cultural analysis of a current event of choice, and presentation. Limited to 18."
        ],
        [
            "inst",
            [
                "E. Grunwald"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.222 Expository Writing for Bilingual Students"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Formulating, organizing, and presenting ideas clearly in writing. Reviews basic principles of rhetoric. Focuses on development of a topic, thesis, choice of appropriate vocabulary, and sentence structure to achieve purpose. Develops idiomatic prose style. Gives attention to grammar and vocabulary usage. Special focus on strengthening skills of bilingual students. Intended to be taken during the student's first year at MIT. Priority given to students recommended for 21W.222 based on summer FEE results. Limited to 15; undergraduates only."
        ],
        [
            "inst",
            [
                "E. Grunwald",
                "A. C. Kemp"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.223 Listening, Speaking, and Pronunciation (ELS)"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Designed for high intermediate ELS students who need to develop better listening comprehension and oral skills. Involves short speaking and listening assignments with extensive exercises in accurate comprehension, pronunciation, stress and intonation, and expression of ideas. Includes frequent video- and audio-recording for analysis and feedback. Meets with 21W.224 when offered concurrently. Limited to 18 per section."
        ],
        [
            "inst",
            [
                "A. Kemp",
                "E. Grunwald"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.224 Listening, Speaking, and Pronunciation (ELS)"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Designed for high-intermediate ELS students who need to develop better listening comprehension and oral skills. Involves short speaking and listening assignments with extensive exercises in accurate comprehension, pronunciation, stress and intonation, and expression of ideas. Includes frequent video- and audio-recording for analysis and feedback. Meets with 21W.223 when offered concurrently. Limited to 18 per section."
        ],
        [
            "inst",
            [
                "E. Grunwald"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.225 Advanced Workshop in Writing for Science and Engineering (ELS)"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Analysis and practice of various forms of scientific and technical writing, from memos to journal articles. Strategies for conveying technical information to specialist and non-specialist audiences. The goal of the workshop is to develop effective writing skills for academic and professional contexts. Models, materials, topics, and assignments vary from term to term. Meets with 21W.226 when offered concurrently. Limited to 18 per section."
        ],
        [
            "inst",
            [
                "E. Grunwald"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.226 Advanced Workshop in Writing for Science and Engineering (ELS)"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Analysis and practice of various forms of scientific and technical writing, from memos to journal articles. Strategies for conveying technical information to specialist and non-specialist audiences. The goal of the workshop is to develop effective writing skills for academic and professional contexts. Models, materials, topics, and assignments vary from term to term. Meets with 21W.225 when offered concurrently. Limited to 18 per section."
        ],
        [
            "inst",
            [
                "E. Grunwald",
                "A. C. Kemp"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.227 Advanced Workshop in Writing for Social Sciences and Architecture (ELS)"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Spring)"
            ]
        ],
        [
            "desc",
            "Focuses on techniques, format, and prose used in academic and professional life. Emphasis on writing required in fields such as economics, political science, and architecture. Short assignments include business letters, memos, and proposals that lead toward a written term project. Methods designed to accommodate those whose first language is not English. Develops effective writing skills for academic and professional contexts. Models, materials, topics, and assignments vary from term to term. May be repeated for credit with permission of instructor. Limited to 18 per section."
        ],
        [
            "inst",
            [
                "A. C. Kemp"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.228 Advanced Workshop in Writing for Social Sciences and Architecture (ELS)"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Focuses on techniques, format, and prose used in academic and professional life. Emphasis on writing required in fields such as economics, political science, and architecture. Short assignments include business letters, memos, and proposals that lead toward a written term project. Methods designed to accommodate those whose first language is not English. Develops effective writing skills for academic and professional contexts. Models, materials, topics and assignments vary from term to term. May be repeated for credit with permission of instructor. Limited to 18."
        ],
        [
            "inst",
            [
                "A. C. Kemp"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.232 Advanced Speaking and Critical Listening Skills (ELS)"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "For advanced students who wish to build confidence and skills in spoken English. Focuses on the appropriate oral presentation of material in a variety of professional contexts: group discussions, classroom explanations and interactions, and theses/research proposals. Valuable for those who intend to teach or lecture in English. Includes frequent video- and audio-recording for analysis and feedback. Develops effective speaking and listening skills for academic and professional contexts. Models, materials, topics and assignments vary from term to term. May be repeated for credit with permission of the instructor. Meets with 21W.233 when offered concurrently. Limited to 15 per section."
        ],
        [
            "inst",
            [
                "A. C. Kemp"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.233 Advanced Speaking and Critical Listening Skills (ELS)"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "For advanced students who wish to build confidence and skills in spoken English. Focuses on the appropriate oral presentation of material in a variety of professional contexts: group discussions, classroom explanations and interactions, and theses/research proposals. Valuable for those who intend to teach or lecture in English. Includes frequent video- and audio-recording for analysis and feedback. Develops effective speaking and listening skills for academic and professional contexts. Models, materials, topics and assignments vary from term to term. May be repeated for credit with permission of the instructor. Meets with 21W.232 when offered concurrently.  Limited to 15 per section."
        ],
        [
            "inst",
            [
                "A. C. Kemp"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.237 MIT Out Loud: Public Speaking for Bilingual Students"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: U (Spring)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Develops oral communication skills for bilingual students through the lens of the MIT experience. Speaking assignments in informative and persuasive speech forms draw on examples of popular culture and MIT touchstones, such as \"alternative\" campus tours, interviews, MIT 100K pitches, and TED talks. Explores the role of voice and body language through improvisation and impromptus. Focuses on spoken accuracy and vocabulary through oral exercises designed for bilingual students. Frequent video-recording will be used for self-evaluation. Limited to 15."
        ],
        [
            "inst",
            [
                "A. C. Kemp"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.240 Imagining English: Creative Writing for Bilingual Students"
        ],
        [
            "prerec",
            "Prereq: 21W.222 or other CI-H/CI-HW subject"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Instruction for bilingual students in writing short stories and poems in English. Involves the study of craft, revision, and creativity, as well as close reading of important works by American, British, and non-native writers' writing in English. Analyzes \"the limits of English\" through group discussions of student writing to distinguish linguistic freshness from grammatical incorrectness, with review of relevant rules. Includes academic and non-academic vocabulary building, a formal writing process, literary analysis essays, short translations to and from students' native languages, and the workshopping (peer reviewing) of creative work. Limited to 18."
        ],
        [
            "inst",
            [
                "E. Grunwald"
            ]
        ]
    ],
    [
        "head",
        "Undergraduate Subjects"
    ],
    [
        "block",
        [
            "title",
            "21W.729[J] Engineering Communication in Context"
        ],
        [
            "prerec",
            "Same subject as ES.729[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject ES.729[J]. Limited to 18; preference to ESG students."
        ],
        [
            "inst",
            [
                "D. Custer"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.733[J] Debating About Society and Engineering"
        ],
        [
            "prerec",
            "Same subject as 10.07[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 10.07[J]. Limited to 18."
        ],
        [
            "inst",
            [
                "E. Schiappa",
                "B. L. Trout"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.735 Writing and Reading the Essay"
        ],
        [
            "prerec",
            "Prereq: Writing sample and permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Exploration of formal and informal modes of writing nonfiction prose. Extensive practice in composition, revision, and editing. Reading in the literature of the essay from the Renaissance to the present, with an emphasis on modern writers. Classes alternate between discussion of published readings and workshops on student work. Individual conferences. Limited to 18."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.738[J] Intersectional Feminist Memoir"
        ],
        [
            "prerec",
            "Same subject as WGS.238[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject WGS.238[J]."
        ],
        [
            "inst",
            [
                "K. Ragusa"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.740 Writing Autobiography and Biography"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Writing an autobiography is a vehicle for improving one's style while studying the nuances of the language. Literary works are read with an emphasis on different forms of autobiography. Students examine various stages of life, significant transitions, personal struggles, and memories translated into narrative prose, and discuss: what it means for autobiographer and biographer to develop a personal voice; and the problems of reality and fiction in autobiography and biography."
        ],
        [
            "inst",
            [
                "K. Manning"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.741[J] Black Matters: Introduction to Black Studies"
        ],
        [
            "prerec",
            "Same subject as 24.912[J], 21H.106[J], 21L.008[J], CMS.150[J], WGS.190[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 24.912[J]."
        ],
        [
            "inst",
            [
                "D. Wood"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.742[J] Writing about Race"
        ],
        [
            "prerec",
            "Same subject as WGS.231[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "The issue of race and racial identity have preoccupied many writers throughout the history of the US. Students read Jessica Abel, Diana Abu-Jaber, Lynda Barry, Felicia Luna Lemus, James McBride, Sigrid Nunez, Ruth Ozeki, Danzy Senna, Gloria Anzaldua, Judith Ortiz Cofer, Carmit Delman, Stefanie Dunning, Cherrie Moraga, Hiram Perez and others, and consider the story of race in its peculiarly American dimensions. The reading, along with the writing of members of the class, is the focus of class discussions. Oral presentations on subjects of individual interest are also part of the class activities. Students explore race and ethnicity in personal essays, pieces of cultural criticism or analysis, or (with permission of instructor) fiction. All written work is read and responded to in class workshops and subsequently revised. Enrollment limited."
        ],
        [
            "inst",
            [
                "K. Ragusa"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.743 Voice and Meaning: Speaking to Readers through Memoir"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Explores the memoir genre with particular attention to the relationships between form and content, fact and truth, self and community, art and \"healing,\" coming to voice and breaking silence. Readings include works by Nick Flynn, Meena Alexander, Art Spigelman, James McBride, Ruth Ozeki, and Cheryl Strayed, with a focus on the ways in which these writers make meaning out of specific events or moments in their own lives as a way of engaging with larger questions of family, race, history, loss, and survivorship. Drawing on lessons taken from these works, students write a short memoir of their own. Limited to 18."
        ],
        [
            "inst",
            [
                "K. Ragusa"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.744 The Art of Comic Book Writing"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: U (Fall)"
            ]
        ],
        [
            "desc",
            "Students create short scripts and full-length comic book narratives across a variety of genres, while analyzing a wide range of comics (corporate and independent, print and web). Focuses on scripts; drawing skills not required, but illustrations or storyboards are welcome. Special attention to questions of gender, race, ethnicity, and sexuality in both critical and creative work. Limited to 13."
        ],
        [
            "inst",
            [
                "M. Liu"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.745 Advanced Essay Workshop"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "U (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "For students with experience in writing essays and nonfiction prose. Focuses on negotiating and representing identities grounded in gender, race, class, nationality, and sexuality in prose that is expository, exploratory, investigative, persuasive, lyrical, or incantatory. Authors include James Baldwin, Minnie Bruce Pratt, Audre Lorde, Richard Rodriguez, Alice Walker, John Edgar Wideman, Diana Hume George, bell hooks, Margaret Atwood, Patricia J. Williams, and others. Designed to help students build upon their strengths as writers and to expand their repertoire of styles and approaches in essay writing. Approved for credit in Women's and Gender Studies when content meets the requirements for subjects in that program. Limited to 18."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.747 Rhetoric"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "For students with a special interest in learning how to make forceful arguments in oral and written form. Studies the forms and structures of argumentation, including organization of ideas, awareness of audience, methods of persuasion, evidence, factual vs. emotional argument, figures of speech, and historical forms and uses of arguments. Limited to 18 per section."
        ],
        [
            "inst",
            [
                "S. Strang",
                "A. Karatsolis"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.748 Apocalyptic Storytelling"
        ],
        [
            "prerec",
            "Subject meets with CMS.848"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Focuses on the critical making of apocalyptic, post-apocalyptic and dystopian stories across various narrative media. Considers the long history of Western apocalypticism as well as the uses and abuses of apocalypticism across time. Examines a wide variety of influential texts in order to enhance students' creative and theoretical repertoires. Students create their own apocalyptic stories and present on selected texts. Investigates conventions such as plague, zombies, nuclear destruction, robot uprising, alien invasion, environmental collapse, and supernatural calamities. Considers questions of race, gender, sexuality, colonialism, trauma, memory, witness, and genocide. Intended for students with prior creative writing experience. Students taking graduate version complete additional assignments. Limited to 15."
        ],
        [
            "inst",
            [
                "J. Diaz"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.750 Experimental Writing"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: U (Fall)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Students use innovative compositional techniques, focusing on new writing methods rather than on traditional lyrical or narrative concerns. Writing experiments, conducted individually, collaboratively and during class meetings, culminate in chapbook-sized projects. Students read, listen to, and create different types of work, including sound poetry, cut-ups, constrained and Oulipian writing, uncreative writing, sticker literature, false translations, artists' books, and digital projects."
        ],
        [
            "inst",
            [
                "N. Montfort"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.752 Making Documentary: Audio, Video, and More"
        ],
        [
            "prerec",
            "Prereq: 21A.550[J], 21W.786[J], or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Focuses on the technical demands of long-form storytelling in sound and picture. Students build practical writing and production skills through a series of assignments: still photo-text works, audio-only documentaries, short video projects (4-6 minutes), and a semester-long, team-produced video science documentary (12-15 minutes). Readings, screenings and written work hone students' analytical capacity. Students taking the graduate version complete additional assignments. Students from the Graduate Program in Science Writing center their work on topics in science, technology, engineering, and/or medicine."
        ],
        [
            "inst",
            [
                "T. Levenson"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.753[J] Phantasmal Media: Computer-Based Art Theory and Practice"
        ],
        [
            "prerec",
            "Same subject as CMS.314[J]\nSubject meets with CMS.814"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject CMS.314[J]."
        ],
        [
            "inst",
            [
                "D. F. Harrell"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.754[J] Playwriting Fundamentals"
        ],
        [
            "prerec",
            "Same subject as 21M.604[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21M.604[J]."
        ],
        [
            "inst",
            [
                "K. Urban"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.755 Writing and Reading Short Stories"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "An introduction to writing fiction. Students write their own stories and study essays and short stories by contemporary authors from around the world. Discussion focuses on students' writing and on assigned works in their historical and social contexts. Limited to 15 per section."
        ],
        [
            "inst",
            [
                "S. Lewitt",
                "M. Nathan"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.756 Writing and Reading Poems"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Examination of the formal structural and textual variety in poetry. Extensive practice in the making of poems and the analysis of both students' manuscripts and texts from 16th- through 20th-century literature. Attempts to make relevant the traditional elements of poetry and their contemporary alternatives. Weekly writing assignments, including some exercises in prosody."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.757 Fiction Workshop"
        ],
        [
            "prerec",
            "Prereq: 21W.755"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Intermediate class for students with some experience in writing fiction. Students write short stories and complete other writing exercises. Readings include short story collections by contemporary writers such as Sandra Cisneros, Benjamin Percy, Leila Lalami, Laura Pritchett, Bret Anthony Johnston, and Edward P. Jones. Discussions focus on sources of story material, characterization, setting, architecture, point of view, narrative voice, and concrete detail."
        ],
        [
            "inst",
            [
                "J. Diaz"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.758 Genre Fiction Workshop"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Students read texts in genres such as fantasy, science fiction, historical fiction, noir, and horror, typically focusing on one genre exclusively in a given semester. Formats may include short stories, novels, films, TV shows and other narrative media. Considers genre protocols and how to write within the restrictions and freedoms associated with each genre. Students write fiction within a genre (or \"between\" genres) for roundtable workshopping. Intended for students with prior creative writing experience. Limited to 15."
        ],
        [
            "inst",
            [
                "S. Lewitt"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.759 Writing Science Fiction"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Students write and read science fiction and analyze and discuss stories written for the class. For the first eight weeks, readings in contemporary science fiction accompany lectures and formal writing assignments intended to illuminate various aspects of writing craft as well as the particular problems of writing science fiction. The rest of the term is given to roundtable workshops on students' stories."
        ],
        [
            "inst",
            [
                "S. Lewitt"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.762 Poetry Workshop"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "For students with some previous experience in poetry writing. Frequent assignments stress use of language, diction, word choice, line breaks, imagery, mood, and tone. Considers the functions of memory, imagination, dreams, poetic impulses. Throughout the term, students examine the work of published poets. Revision stressed."
        ],
        [
            "inst",
            [
                "E. Barrett"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.763[J] Transmedia Storytelling: Modern Science Fiction"
        ],
        [
            "prerec",
            "Same subject as CMS.309[J]\nSubject meets with CMS.809"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Explores transmedia storytelling by investigating how science fiction stories are told across different media, such as the short story, the novel, the screenplay, moving image, and games. Students consider issues of aesthetics, authorship, and genre, while also contextualizing discussion within the broader framework of the political issues raised by film, TV, and other kinds of science fiction texts. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "H. Hendershot"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.764[J] The Word Made Digital"
        ],
        [
            "prerec",
            "Same subject as CMS.609[J]\nSubject meets with CMS.846"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Video games, digital art and literature, online texts, and source code are analyzed in the contexts of history, culture, and computing platforms. Approaches from poetics and computer science are used to understand the non-narrative digital uses of text. Students undertake critical writing and creative computer projects to encounter digital writing through practice. This involves reading and modifying computer programs; therefore previous programming experience, although not required, will be helpful. Students taking graduate version complete additional assignments. Limited to 18."
        ],
        [
            "inst",
            [
                "N. Montfort"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.765[J] Interactive Narrative"
        ],
        [
            "prerec",
            "Same subject as 21L.489[J], CMS.618[J]\nSubject meets with CMS.845"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Provides a workshop environment for understanding interactive narrative (print and digital) through critical writing, narrative theory, and creative practice. Covers important multisequential books, hypertexts, and interactive fictions. Students write critically, and give presentations, about specific works; write a short multisequential fiction; and develop a digital narrative system, which involves significant writing and either programming or the structuring of text. Programming ability helpful."
        ],
        [
            "inst",
            [
                "N. Montfort"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.766 Writing Fantasy"
        ],
        [
            "prerec",
            "Prereq: One subject in Writing or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Explores the popularity and structure of Fantasy as a genre in films, games, and literature. Students read articles and novels and write exercises and stories in the genre. Intended for students with prior creative writing experience. Limited to 10."
        ],
        [
            "inst",
            [
                "S. Lewitt"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.768[J] Games and Culture"
        ],
        [
            "prerec",
            "Same subject as CMS.616[J], WGS.125[J]\nSubject meets with CMS.868"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject CMS.616[J]."
        ],
        [
            "inst",
            [
                "T. L. Taylor"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.770 Advanced Fiction Workshop"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "For students with some experience in writing fiction. Write longer works of fiction and short stories which are related or interconnected. Read short story collections by individual writers, such as Sandra Cisneros, Raymond Carver, Edward P. Jones, and Tillie Olsen, and discuss them critically and analytically, with attention to the ways in which the writers' choices about component parts contribute to meaning. In-class exercises and weekly workshops of student work focus on sources of story material, characterization, structure, narrative voice, point of view and concrete detail. Concentration on revision."
        ],
        [
            "inst",
            [
                "H. Lee"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.771 Advanced Poetry Workshop"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "For students experienced in writing poems. Regular reading of published contemporary poets and weekly submission of manuscripts for class review and criticism. Students expected to do a substantial amount of rewriting and revision. Classwork supplemented with individual conferences."
        ],
        [
            "inst",
            [
                "E. Funkhouser"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.773 Writing Longer Fiction"
        ],
        [
            "prerec",
            "Prereq: A fiction workshop or permission of instructor"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: U (Spring)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Designed for students who have some experience in writing fiction and want to try longer forms like the novella and novel. Students interested in writing a novel are expected to produce at least two chapters and an outline of the complete work. Readings include several novels from Fitzgerald to the present, and novellas from Gogol's The Overcoat to current examples. Students discuss one another's writing in a roundtable workshop, with a strong emphasis on revision."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.774[J] Playwriting Methods"
        ],
        [
            "prerec",
            "Same subject as 21M.607[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21M.607[J]. Enrollment limited."
        ],
        [
            "inst",
            [
                "K. Urban"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.775 Writing about Nature and Environmental Issues"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: U (Spring)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Focuses on traditional nature writing and the environmentalist essay. Students keep a web log as a journal. Writings are drawn from the tradition of nature writing and from contemporary forms of the environmentalist essay. Authors include Henry Thoreau, Loren Eiseley, Annie Dillard, Chet Raymo, Sue Hubbel, Rachel Carson, Bill McKibben, and Terry Tempest Williams. Limited to 18."
        ],
        [
            "inst",
            [
                "C. Taft"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.776[J] Screenwriting"
        ],
        [
            "prerec",
            "Same subject as 21M.608[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21M.608[J]. Enrollment limited."
        ],
        [
            "inst",
            [
                "K. Urban"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.777 Science Writing in Contemporary Society"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Drawing in part from their own interests and ideas, students write about science within various cultural contexts using an array of literary and reportorial tools. Studies the work of contemporary science writers, such as David Quammen and Atul Gawande, and examines the ways in which science and technology are treated in media and popular culture. Discussions focus on students' writing and address topics such as false equivalency, covering controversy, and the attenuation of initial observations. Emphasizes long-form narratives; also looks at blogs, social media, and other modes of communication. Not a technical writing class."
        ],
        [
            "inst",
            [
                "T. Levenson"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.778 Science Journalism"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "An introduction to print daily journalism and news writing, focusing on science news writing in general, and medical writing in particular. Emphasis is on writing clearly and accurately under deadline pressure. Class discussions involve the realities of modern journalism, how newsrooms function, and the science news coverage in daily publications. Discussions of, and practice in, interviewing and various modes of reporting. In class, students write numerous science news stories on deadline. There are additional longer writing assignments outside of class. Enrollment limited."
        ],
        [
            "inst",
            [
                "B. D. Colen"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.780[J] Writing the Full-Length Play"
        ],
        [
            "prerec",
            "Same subject as 21M.780J\nSubject meets with 21M.781"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21M.780J. Limited to 10."
        ],
        [
            "inst",
            [
                "K. Urban"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.781[J] Race, Place, and Modernity in the Americas"
        ],
        [
            "prerec",
            "Same subject as 21L.592[J], WGS.247[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject WGS.247[J]. Enrollment limited to 20. Application required."
        ],
        [
            "inst",
            [
                "J. Terrones"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.786[J] Social Justice and The Documentary Film"
        ],
        [
            "prerec",
            "Same subject as CMS.336[J]\nSubject meets with CMS.836"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Explores the history and current state of social-issue documentary. Examines how cultural and political upheaval and technological change have converged at different moments to bring about new waves of activist documentary film production. Particular focus on films and other non-fiction media of the present and recent past. Students screen and analyze a series of key films and work in groups to produce their own short documentary using digital video and computer-based editing. Students taking graduate version complete additional assignments. Limited to 18."
        ],
        [
            "inst",
            [
                "V. Bald"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.787 Film, Music, and Social Change: Intersections of Media and Society"
        ],
        [
            "prerec",
            "Subject meets with CMS.837"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines films from the 1950s onward that document music subcultures and moments of social upheaval. Combines screening films about free jazz, glam rock, punk, reggae, hip-hop, and other genres with an examination of critical/scholarly writings to illuminate the connections between film, popular music, and processes of social change. Students critique each film in terms of the social, political, and cultural world it documents, and the historical context and effects of the film's reception. Students taking graduate version complete additional assignments. Limited to 18."
        ],
        [
            "inst",
            [
                "V. Bald"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.788[J] South Asian America: Transnational Media, Culture, and History"
        ],
        [
            "prerec",
            "Same subject as CMS.334[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines the history of South Asian immigration, sojourning, and settlement from the 1880s to the present. Focuses on the US as one node in the global circulation, not only of people, but of media, culture and ideas, through a broader South Asian diaspora. Considers the concept of \"global media\" historically; emphasis on how ideas about, and self-representations of, South Asians have circulated via books, political pamphlets, performance, film, video/cassette tapes, and the internet. Students analyze and discuss scholarly writings, archival documents, memoirs, fiction, blogs and films, and write papers drawing on course materials, lectures, and discussions. Limited to 18."
        ],
        [
            "inst",
            [
                "V. Bald"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.790[J] Short Attention Span Documentary"
        ],
        [
            "prerec",
            "Same subject as CMS.335[J]\nSubject meets with 21W.890"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Focuses on the production of short (1- to 5-minute) digital video documentaries: a form of non-fiction filmmaking that has proliferated in recent years due to the ubiquity of palm-sized and mobile phone cameras and the rise of web-based platforms, such as YouTube. Students shoot, edit, workshop and revise a series of short videos meant to engage audiences in a topic, introduce them to new ideas, and/or persuade them. Screenings and discussions cover key principles of documentary film - narrative, style, pace, point of view, argument, character development - examining how they function and change in short format. Students taking graduate version complete additional assignments. Limited to 16."
        ],
        [
            "inst",
            [
                "V. Bald"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.791[J] Critical Internet Studies"
        ],
        [
            "prerec",
            "Same subject as CMS.614[J]\nSubject meets with CMS.867"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject CMS.614[J]."
        ],
        [
            "inst",
            [
                "T. L. Taylor"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.792 Science Writing Internship"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Students developing professional writing and publishing skills in part-time internships with Boston area media companies can apply to receive credit. Students planning to take this subject must contact the instructor by the end of November (if they are applying for spring semester) or the end of May (if they are applying for the fall semester)."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.794 Graduate Technical Writing Workshop"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (IAP)"
            ]
        ],
        [
            "desc",
            "Designed to improve the student's ability to communicate technical information. Covers central communication concepts and techniques, including audience, discourse, and genre analysis; strategies for effectively managing, integrating, and documenting information from sources; and methods of structuring information for coherence and credibility. Assignments include an abstract, a literature review, and an oral presentation; students provide feedback to each other. Limited to graduate engineering students based on results of the Graduate Writing Exam."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.798, 21W.799 Independent Study in Writing"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Primarily for students pursuing advanced writing projects with the assistance of a member of the Writing Program. Students electing this subject must secure the approval of the director of the Writing Program and its Committee on Curriculum. Normal maximum is 6 units; exceptional 9-unit projects occasionally approved. 21W.798 is P/D/F."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "head",
        "Graduate Subjects"
    ],
    [
        "block",
        [
            "title",
            "21W.820[J] Writing: Science, Technology, and Society"
        ],
        [
            "prerec",
            "Same subject as STS.477[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=21H.991\" title=\"21H.991\" class=\"bubblelink code\" onclick=\"return showCourse(this, '21H.991');\">21H.991</a> "
            ]
        ],
        [
            "desc",
            "Examination of different \"voices\" used to consider issues of scientific, technological, and social concern. Students write frequently and choose among a variety of non-fiction forms: historical writing, social analysis, political criticism, and policy reports. Instruction in expressing ideas clearly and in organizing a thesis-length work. Reading and writing on three case studies drawn from the history of science; the cultural study of technology and science; and policy issues."
        ],
        [
            "inst",
            [
                "K. Manning"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.822 Science Writing Thesis Development and Workshop"
        ],
        [
            "prerec",
            "Prereq: None. Coreq: 21W.THG"
        ],
        [
            "terms",
            [
                "G (Fall)"
            ]
        ],
        [
            "desc",
            "Develops abilities to produce long-form pieces of science-based journalism, with a focus on constructing multiple narratives, source building and interview techniques, rewriting and working with editors. Students also hone their ability to shape their classmates' work."
        ],
        [
            "inst",
            [
                "T. Levenson"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.823 Lab Experience for Science Writers"
        ],
        [
            "prerec",
            "Prereq: 21W.825"
        ],
        [
            "terms",
            [
                "G (Fall, IAP, Spring)"
            ]
        ],
        [
            "desc",
            "During the fall or IAP, students conduct 20 hours of observation in a lab of their choosing that is outside their previous scientific experience. Participation in the work of the lab encouraged. In the spring, students make an in-class presentation and submit a written report of publication quality. Preference to students in the Graduate Program in Science Writing."
        ],
        [
            "inst",
            [
                "T. Levenson",
                "M. Bartusiak"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.824 Making Documentary: Audio, Video, and More"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Focuses on the technical demands of long-form storytelling in sound and picture. Students build practical writing and production skills through a series of assignments: still photo-text works, audio-only documentaries, short video projects (4-6 minutes), and a semester-long, team-produced video science documentary (12-15 minutes). Readings, screenings and written work hone students' analytical capacity. Students taking the graduate version complete additional assignments. Students from the Graduate Program in Science Writing center their work on topics in science, technology, engineering, and/or medicine. Limited to 7."
        ],
        [
            "inst",
            [
                "T. Levenson"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.825 Advanced Science Writing Seminar I"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall)"
            ]
        ],
        [
            "desc",
            "First term of year-long graduate sequence in science writing offers students intensive workshops and critiques of their own writing, and that of published books, articles, and essays; discussions of ethical and professional issues; study of science and scientists in historical and social context; analysis of recent events in science and technology. Emphasis throughout on developing skills and habits of mind that enable the science writer to tackle scientifically formidable material and write about it for ordinary readers. Topics include the tools of research, conceived in its broadest sense- including interviewing, websites, archives, scientific journal articles; science journalism, including culture of the newsroom and magazine-style journalism; science essays. Considerable attention to science writing's audiences, markets, and publics and the special requirements of each."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.826 Advanced Science Writing Seminar II"
        ],
        [
            "prerec",
            "Prereq: 21W.825 or permission of instructor"
        ],
        [
            "terms",
            [
                "G (Spring)"
            ]
        ],
        [
            "desc",
            "Topics include research for writers, science journalism, and essays; literary science writing, and the social and historical context of science and technology. Includes seminars, lectures, and student writing workshops. Special emphasis on the science essay and on literary and imaginative science writing that employs traditionally fictive devices in nonfiction, including scene-setting and storytelling. Assignments cover science essays, writing on particular disciplines, and investigative and critical science journalism."
        ],
        [
            "inst",
            [
                "Graduate Program Faculty"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.890 Short Attention Span Documentary"
        ],
        [
            "prerec",
            "Subject meets with 21W.790[J], CMS.335[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Focuses on the production of short (1- to 5-minute) digital video documentaries: a form of non-fiction filmmaking that has proliferated in recent years due to the ubiquity of palm-sized and mobile phone cameras and the rise of web-based platforms, such as YouTube. Students shoot, edit, workshop and revise a series of short videos meant to engage audiences in a topic, introduce them to new ideas, and/or persuade them. Screenings and discussions cover key principles of documentary film - narrative, style, pace, point of view, argument, character development - examining how they function and change in short format. Students taking graduate version complete additional assignments. Limited to 16."
        ],
        [
            "inst",
            [
                "R. Adams"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.892 Science Writing Internship"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Field placements tailored to the individual backgrounds of the students enrolled, involving varying degrees of faculty participation and supervision."
        ],
        [
            "inst",
            [
                "Graduate Program Faculty"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.898 Graduate Independent Study in Writing"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall, IAP, Spring)"
            ]
        ],
        [
            "desc",
            "Opportunity for advanced independent study of  writing under regular supervision by a faculty member. Projects require prior approval, as well as a written proposal and a final report."
        ],
        [
            "inst",
            [
                "Consult Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.899 Graduate Independent Study in Writing"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall, IAP, Spring)"
            ]
        ],
        [
            "desc",
            "Opportunity for advanced independent study of  writing under regular supervision by a faculty member. Projects require prior approval, as well as a written proposal and a final report."
        ],
        [
            "inst",
            [
                "Consult Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.S60 Special Subject: Writing"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Seminar or lecture on a topic that is not covered in the regular curriculum."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.S61 Special Subject: Writing (New)"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Seminar or lecture on a topic that is not covered in the regular curriculum."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.S62 Special Subject: Writing (New)"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Seminar or lecture on a topic that is not covered in the regular curriculum."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.S63 Special Subject: Writing (New)"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Seminar or lecture on a topic that is not covered in the regular curriculum."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.S96 Special Subject: Writing"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Spring; partial term)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Seminar or lecture on a topic that is not covered in the regular curriculum."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.S97 Special Subject: Writing (New)"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Seminar or lecture on a topic that is not covered in the regular curriculum."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.S98 Special Subject: Writing (New)"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Seminar or lecture on a topic that is not covered in the regular curriculum."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.THT Writing Pre-Thesis Tutorial"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Definition of and early stage work on a thesis project leading to 21W.THU. Taken during the first term of a student's two-term commitment to the thesis project. Student works closely with an individual faculty tutor. Required of all students pursuing a full major in Course 21W. Joint majors register for 21.THT."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.THU Writing Program Thesis"
        ],
        [
            "prerec",
            "Prereq: 21W.THT"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Completion of work on the senior major thesis under the supervision of a faculty tutor. Includes oral presentation of the thesis progress early in the term, assembling and revising the final text, and a final meeting with a committee of faculty evaluators to discuss the successes and limitations of the project. Required of students pursuing a full major in Course 21W. Joint majors register for 21.THU."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.THG Graduate Thesis"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Research and writing of thesis in consultation with faculty, including individual meetings and group seminars, undertaken over the course of one year."
        ],
        [
            "inst",
            [
                "T. Levenson"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.UR Research in Writing"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Individual participation in an ongoing research project. For students in the Undergraduate Research Opportunities Program."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "21W.URG Research in Writing"
        ],
        [
            "prerec",
            "U (Fall, IAP, Spring, Summer)"
        ],
        [
            "terms",
            [
                "Units arranged"
            ]
        ],
        [
            "desc",
            "Individual participation in an ongoing research project. For students in the Undergraduate Research Opportunities Program."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ]
]