[
    "Comparative Media Studies / Writing (CMS)",
    [
        "head",
        "Undergraduate Subjects"
    ],
    [
        "block",
        [
            "title",
            "CMS.100 Introduction to Media Studies"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Offers an overview of the social, cultural, political, and economic impact of mediated communication on modern culture. Combines critical discussions with experiments working with different media. Media covered include radio, television, film, the printed word, and digital technologies. Topics include the nature and function of media, core media institutions, and media in transition. Enrollment limited."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.150[J] Black Matters: Introduction to Black Studies"
        ],
        [
            "prerec",
            "Same subject as 24.912[J], 21H.106[J], 21L.008[J], 21W.741[J], WGS.190[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 24.912[J]."
        ],
        [
            "inst",
            [
                "D. Wood"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.300 Game Studies"
        ],
        [
            "prerec",
            "Subject meets with CMS.841"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Introduction to the interdisciplinary study of videogames as texts through an examination of their cultural, educational, and social functions in contemporary settings. Students play and analyze videogames while reading current research and theory from a variety of sources in the sciences, social sciences, humanities, and industry. Assignments focus on game analysis in the context of the theories discussed in class. Includes regular reading, writing, and presentation exercises. No prior programming experience required. Students taking graduate version complete additional assignments. Limited to 20."
        ],
        [
            "inst",
            [
                "M. Jakobsson"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.301 Game Design Methods"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Provides an introduction to the process of designing games and playful experiences. Familiarizes students with concepts, methods, techniques and tools used in the design of a wide variety of games. Focuses on aspects of the process such as rapid prototyping, play testing, and design iteration using a player-centered approach. Students work in project groups where they engage with a series of confined exercises, practice communicating design ideas, and discuss their own and others work in a constructive manner. No prior programming experience required. Limited to 15."
        ],
        [
            "inst",
            [
                "S. Verrilli"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.306 Making Comics and Sequential Art"
        ],
        [
            "prerec",
            "Subject meets with CMS.806"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Applied introduction to comics and sequential art production. Builds skills in how to develop storylines; develop and draw characters, panels, and backgrounds; prepare for print production; and comprehend the basics of sequential language, composition, and layout. Students engage with crucial personal and political issues at stake across a range of comics genres: superhero, biographical, and countercultural. Addresses not just how we create comics, but why we create comics. Students taking graduate version complete additional assignments. Limited to 16."
        ],
        [
            "inst",
            [
                "M. Cordero"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.307 Critical Worldbuilding"
        ],
        [
            "prerec",
            "Subject meets with CMS.807"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Studies the design and analysis of invented (or constructed) worlds for narrative media, such as television, films, comics, and literary texts. Provides the practical, historical and critical tools with which to understand the function and structure of imagined worlds. Examines world-building strategies in the various media and genres in order to develop a critical and creative repertoire. Participants create their own invented worlds. Students taking graduate version complete additional assignments. Limited to 13."
        ],
        [
            "inst",
            [
                "J. Diaz"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.309[J] Transmedia Storytelling: Modern Science Fiction"
        ],
        [
            "prerec",
            "Same subject as 21W.763[J]\nSubject meets with CMS.809"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21W.763[J]."
        ],
        [
            "inst",
            [
                "H. Hendershot"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.311[J] Media in Weimar and Nazi Germany (New)"
        ],
        [
            "prerec",
            "Same subject as 21G.055[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Debates over national and media identity in Weimar and Nazi Germany. Production and use of media under extreme political and social conditions with a focus on films (such as Nosferatu, Berlin, M, and Triumph des Willens) and other media. Media approached as both texts and systems. Considers the legacy of the period, in terms of stylistic influence (e.g. film noir), techniques of persuasion, and media's relationship to social and economic conditions. Taught in English. Enrollment limited."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.313 Silent Film"
        ],
        [
            "prerec",
            "Subject meets with CMS.813"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines how the key elements of today's films - composition, continuity editing, lighting, narrative structure - were originally created. Studies the history of cinema, from its origins in the late 19th century to the transition to sound in the late 1920s and early 1930s. Students view a range of films (both mainstream and experimental) from all over the world, with a particular focus on US productions. Emphasis on how color, sound, and other developments paved the way for today's technological innovations. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "H. Hendershot"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.314[J] Phantasmal Media: Computer-Based Art Theory and Practice"
        ],
        [
            "prerec",
            "Same subject as 21W.753[J]\nSubject meets with CMS.814"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Engages students in theory and practice of using computational techniques for developing expressive digital media works. Surveys approaches to understanding human imaginative processes, such as constructing concepts, metaphors, and narratives, and applies them to producing and understanding socially, culturally, and critically meaningful works in digital media. Readings engage a variety of theoretical perspectives from cognitive linguistics, literary and cultural theory, semiotics, digital media arts, and computer science. Students produce interactive narratives, games, and related forms of software art. Some programming and/or interactive web scripting experience (e.g., Flash, Javascript) is desirable. Students taking the graduate version complete a project requiring more in-depth theoretical engagement."
        ],
        [
            "inst",
            [
                "D. F. Harrell"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.315[J] Understanding Television (New)"
        ],
        [
            "prerec",
            "Same subject as 21L.432[J]\nSubject meets with CMS.915"
        ],
        [
            "terms",
            [
                "Prereq: One subject in Literature or Comparative Media Studies "
            ]
        ],
        [
            "desc",
            "See description under subject 21L.432[J]."
        ],
        [
            "inst",
            [
                "D. Thorburn"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.334[J] South Asian America: Transnational Media, Culture, and History"
        ],
        [
            "prerec",
            "Same subject as 21W.788[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21W.788[J]. Limited to 18."
        ],
        [
            "inst",
            [
                "V. Bald"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.335[J] Short Attention Span Documentary"
        ],
        [
            "prerec",
            "Same subject as 21W.790[J]\nSubject meets with 21W.890"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21W.790[J]. Limited to 16."
        ],
        [
            "inst",
            [
                "V. Bald"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.336[J] Social Justice and The Documentary Film"
        ],
        [
            "prerec",
            "Same subject as 21W.786[J]\nSubject meets with CMS.836"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21W.786[J]. Limited to 18."
        ],
        [
            "inst",
            [
                "V. Bald"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.338 Innovation in Documentary: Technologies and Techniques"
        ],
        [
            "prerec",
            "Subject meets with CMS.838"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=CMS.100\" title=\"CMS.100\" class=\"bubblelink code\" onclick=\"return showCourse(this, 'CMS.100');\">CMS.100</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Discusses emerging technologies and techniques available to media-makers (e.g., location-based technologies, transmedia storytelling, crowdsourcing, and interactivity) and their implications on the film and television documentary. Studies the development of these tools and considers the many new directions in which they may take the genre. Includes screenings, meetings with documentary makers, and an experimental component in which students can explore new approaches to documentary production. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "W. Uricchio"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.339 Virtual Reality and Immersive Media Production"
        ],
        [
            "prerec",
            "Subject meets with CMS.839"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Provides an overview of historical developments and current innovations in virtual reality (e.g., gear, software, and storytelling techniques) and looks into new trends in augmented, mixed and holographic reality. Includes practical instruction and a step-by-step exploration of the fundamentals of virtual reality creation - from new visual languages and grammars, to storyboarding, scripting, sound design and editing, to new and innovative ways to capture, scan and reproduce 360-degree images. Students taking graduate version complete additional assignments. Limited to 18."
        ],
        [
            "inst",
            [
                "S. Rodriguez"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.340 Immersive Media Studies"
        ],
        [
            "prerec",
            "Subject meets with CMS.865"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Critical examination of the history, aesthetics, and politics of virtual reality and related media. Focuses on virtual space and embodiment; cultural reception and industry hype; accessibility, surveillance, and data privacy; and debates surrounding the use of immersive media in social, work, art, and entertainment contexts. Projects include experimentation with VR development tools and critical analysis of existing immersive works. Graduate version includes additional research. Enrollment limited to 15."
        ],
        [
            "inst",
            [
                "P. Roquet"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.341 Immersive Social Worlds (New)"
        ],
        [
            "prerec",
            "Subject meets with CMS.941"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Focuses on critical media sociology of immersive social worlds, from digital environments and avatar-based worlds to live action role-play (LARP) and theme parks. Draws on both historical and contemporary cases. Investigates key issues including communication and community; authorship and co-creativity; embodiment and identity; and ownership, governance, and management. Attention given to cultural and socio-technical nature of these environments and their ongoing construction within a broader media system. Students taking graduate version complete additional assignments. Enrollment limited to 15."
        ],
        [
            "inst",
            [
                "T. L. Taylor"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.342[J] Designing Virtual Worlds (New)"
        ],
        [
            "prerec",
            "Same subject as 2.177[J]\nSubject meets with 2.178[J], CMS.942[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 2.177[J]."
        ],
        [
            "inst",
            [
                "K. Zolot"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.343[J] The Art and Science of Time Travel (New)"
        ],
        [
            "prerec",
            "Same subject as 2.984[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=8.02\" title=\"8.02\" class=\"bubblelink code\" onclick=\"return showCourse(this, '8.02');\">8.02</a> and <a href=\"/search/?P=18.02\" title=\"18.02\" class=\"bubblelink code\" onclick=\"return showCourse(this, '18.02');\">18.02</a> "
            ]
        ],
        [
            "desc",
            "See description under subject 2.984[J]. Limited to 20."
        ],
        [
            "inst",
            [
                "S. Lloyd",
                "M. Reilly"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.351[J] Digital Media in Japan and Korea"
        ],
        [
            "prerec",
            "Same subject as 21G.067[J]\nSubject meets with 21G.597"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines the social, cultural, and political stakes of digital culture in Japan and Korea. Focuses on digital media use (and abuse), including the internet, streaming and mobile media, gaming, robots, and augmented realities; the digital remediation of older media; and methods for the study of online life. By considering how digital media use has developed in each country and reshaped identity, politics, public space, and creative practice, students build a conceptual and critical vocabulary for the comparative study of algorithmic cultures. Taught in English."
        ],
        [
            "inst",
            [
                "P. Roquet"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.352[J] Cinema in Japan and Korea"
        ],
        [
            "prerec",
            "Same subject as 21G.094[J]\nSubject meets with 21G.594"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Focuses on landmark art cinema from both countries while providing a thorough introduction to film style. Each week examines a different component of film form, using the close analysis of specific films in their cultural and historical context. Explores the use of video essays as a form of critical analysis. Taught in English."
        ],
        [
            "inst",
            [
                "P. Roquet"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.353[J] The New Latin American Novel"
        ],
        [
            "prerec",
            "Same subject as 21G.072[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Students read newly translated, recent fiction from Latin America and consider contemporary issues in, and approaches to, reading and writing literature in the 21st century. Debates the concept of contemporary in these texts and whether we can still talk about a Latin American novel. Reflects on issues of interpretation, authorship, gender, genre, media, ideology and theories of the novel, Latin American literary history, and translation. Authors may include César Aira, Mario Levrero, Samanta Schweblin, Yuri Herrera, Ena Lucía Portela, Valeria Luiselli, Roberto Bolaño, Marlon James, and J. P. Cuenca. Enrollment limited."
        ],
        [
            "inst",
            [
                "P. Duong"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.354[J] Japanese Media Cultures"
        ],
        [
            "prerec",
            "Same subject as 21G.065[J]\nSubject meets with 21G.593"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines storytelling media in twentieth and twenty-first century Japan, situating emerging media aesthetics and practices alongside broader shifts in cultural and social life. Engages with pivotal works in a wide range of media including film, literature, anime, manga, and video games, as well as critical concepts in Japanese media studies. Taught in English. 21G.593 includes additional work in Japanese. Enrollment limited."
        ],
        [
            "inst",
            [
                "Consult P. Roquet"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.355[J] Latin America and the Global Sixties: Counterculture and Revolution"
        ],
        [
            "prerec",
            "Same subject as 21G.070[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Close reading of political issues, cultural artifacts, and social actors of Latin America during and in the wake of the revolutionary 1960s. Examines how culture and politics addressed the need to conceptually organize a series of events that were equally momentous and confusing. Questions the established stereotypes and assumptions about Latin America and the sixties that are portrayed in its contemporary, often nostalgic, revivals. Focuses on the ideas that defined Latin America's participation in a global trend of political upheavals, emerging youth cultures, and demands for social justice. Taught in English. Enrollment limited."
        ],
        [
            "inst",
            [
                "P. Duong"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.356[J] Advertising and Media: Comparative Perspectives"
        ],
        [
            "prerec",
            "Same subject as 21G.036[J]\nSubject meets with 21G.190, CMS.888"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21G.036[J]."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.357[J] Creation of a Continent: Media Representations of Hispanic America, 1492 to present"
        ],
        [
            "prerec",
            "Same subject as 21G.731[J], 21H.274[J]"
        ],
        [
            "terms",
            [
                "Prereq: One intermediate Spanish subject or permission of instructor "
            ]
        ],
        [
            "desc",
            "Traces the creation of a new literature in Spanish to record and interpret New World experiences. Begins with excerpts from Columbus's diary and ends with writings on the late 19th-century Cuban and Puerto Rican independence movements. Pairs some of these pre-20th-century texts with more recent literary and film interpretations of the first 400 years of Hispanic American history. Conducted in Spanish."
        ],
        [
            "inst",
            [
                "P. Duong"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.358[J] The Short Form: Literature and New Media Cultures in the Hispanic World"
        ],
        [
            "prerec",
            "Same subject as 21G.736[J]"
        ],
        [
            "terms",
            [
                "Prereq: One intermediate subject in Spanish or permission of instructor "
            ]
        ],
        [
            "desc",
            "Examines the aesthetics of the brief form across a variety of media and genres in Latin America and Spain, from short stories and snapshots to newspapers and Twitter. Explores the history and social significance of four short genres in the Hispanic world: the short story, the crónica, the poem, and the song. Discusses the rich literary and critical tradition that relates narrative length and temporality to the prose and the lyric in Spanish speaking cultures. With an emphasis on the 20th- and 21st-century epistemologies of acceleration and the remediation of literary theories of brevity, analyzes the relationship between temporality, aesthetic form, and media technologies, and the way these topics have taken shape in the imagination of writers, artists, and audiences in historically specific and politically significant contexts. Taught in Spanish. Limited to 18."
        ],
        [
            "inst",
            [
                "P. Duong"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.359[J] Three Kingdoms: From History to Fiction, Comic, Film, and Game (New)"
        ],
        [
            "prerec",
            "Same subject as 21G.042[J], 21H.352[J], 21L.492[J]\nSubject meets with 21G.133"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21G.042[J]."
        ],
        [
            "inst",
            [
                "E. Teng"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.360 Introduction to Civic Media"
        ],
        [
            "prerec",
            "Subject meets with CMS.860"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines civic media in comparative, transnational and historical perspectives. Introduces various theoretical tools, research approaches, and project design methods. Students engage with multimedia texts on concepts such as citizen journalism, transmedia activism, media justice, and civic, public, radical, and tactical media. Case studies explore civic media across platforms (print, radio, broadcast, internet), contexts (from local to global, present-day to historical), and use (dialogic, contentious, hacktivist). As a final project, students develop a case study or project proposal. Students taking the graduate version complete additional assignments. Limited to 20."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.361 Networked Social Movements: Media and Mobilization"
        ],
        [
            "prerec",
            "Subject meets with CMS.861"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Provides an overview of social movement studies as a body of theoretical and empirical work, with an emphasis on understanding the relationship between social movements and the media. Explores multiple methods of social movement investigation, including textual and media analysis, surveys, interviews, focus groups, participant observation, and co-research. Covers recent innovations in social movement theory, as well as new data sources and tools for research and analysis. Includes short papers, a literature review, and a final research project. Students taking graduate version complete additional assignments. Limited to 16."
        ],
        [
            "inst",
            [
                "S. Costanza-Chock"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.362 Civic Media Collaborative Design Studio"
        ],
        [
            "prerec",
            "Subject meets with CMS.862"
        ],
        [
            "terms",
            [
                "Prereq: One subject in CMS or MAS "
            ]
        ],
        [
            "desc",
            "Project-based studio focusing on collaborative design of civic media provides a service-learning opportunity for students interested in working with community organizations. Multidisciplinary teams create civic media projects based on real-world community needs. Covers co-design methods and best practices to include the user community in iterative stages of project ideation, design, implementation, testing, and evaluation. Students taking graduate version complete additional assignments. Limited to 16."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.374[J] Transmedia Art, Extraction, and Environmental Justice"
        ],
        [
            "prerec",
            "Same subject as 4.376[J]\nSubject meets with CMS.877"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Exploration of today's extractive economies and the role that artists, media-makers, and transmedia producers play in shaping public perception, individual choices, and movement-building towards sustainability. Traces the contingent geological, material, community, and toxic histories of extracted materials used throughout our built environment, as well as civic resistance and reform that could alter extraction practices. Scaffolded workshops with artists and media producers support students' production of creative documentary and other media projects. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "J. Paradis",
                "J. Barry"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.375 Reading Climate Through Media"
        ],
        [
            "prerec",
            "Subject meets with CMS.875"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Explores how climate is construed in the contemporary media in order to gain a better understanding of how views of climate change are shaped and received in the public sphere. Studies the pathways that take us from climate science to media content, from the big data of global scale to the particulars and narratives of the human experience. Surveys a variety of media forms--reports, articles, comics, videos, films, photography, poetry and fiction--that reflect on the contemporary human challenges of dealing with a changing natural environment of our own making. Emphasizes the role of media in shaping public opinion, both in the US and globally, and its influence on public (and voter) perceptions on which a vast body of regulation and funding for environmental management is based. Students work individually and in teams to produce a selection of the media forms studied. Students taking graduate version complete additional assignments. Limited to 20."
        ],
        [
            "inst",
            [
                "J. Paradis"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.376 History of Media and Technology"
        ],
        [
            "prerec",
            "Subject meets with CMS.876"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Surveys the interrelated histories of communications media and technological development, from the emergence of 19th-century forms of mass print media and telegraphy, to sound capture and image-based forms (e.g., film, radio, and television), to the shift from analog to digital cultures. Examines how new forms of communication exert social, political, and cultural influences in the global context. Explores how technological innovation and accelerating media affect social values and behaviors in the popular and global adoption of a media device. Includes two papers and a research project on aspects of media history. Students taking graduate version complete additional assignments. Enrollment limited."
        ],
        [
            "inst",
            [
                "J. Paradis"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.400 Media Systems and Texts"
        ],
        [
            "prerec",
            "Prereq: One subject in Comparative Media Studies or permission of instructor"
        ],
        [
            "terms",
            [
                "U (Spring)"
            ]
        ],
        [
            "desc",
            "Explores theoretical, historical and critical approaches to the comparative study of media. Examines media from three perspectives: the historical evolution of particular media forms (media in transition); the migration of particular narratives across different media forms (trans-media texts); and the ways in which media texts and systems cross cultural and national boundaries (global crossings). Instruction and practice in written and oral communication provided."
        ],
        [
            "inst",
            [
                "J. Picker"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.405 Visual Design"
        ],
        [
            "prerec",
            "Prereq: 21L.011 or CMS.100"
        ],
        [
            "terms",
            [
                "U (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Examines the process of making and sharing visual artifacts using a trans-cultural, trans-historical, constructionist approach. Explores the relationship between perceived reality and the narrative imagination, how an author's choice of medium and method constrains the work, how desire is integrated into the structure of a work, and how the cultural/economic opportunity for exhibition/distribution affects the realization of a work. Instruction and practice in written and oral communication provided. Limited to 20."
        ],
        [
            "inst",
            [
                "D. F. Harrell"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.407 Sound Studies"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Explores the ways in which humans experience the realm of sound and how perceptions and technologies of sound emerge from cultural, economic, and historical worlds. Examines how environmental, linguistic, and musical sounds are construed cross-culturally. Describes the rise of telephony, architectural acoustics, and sound recording, and the globalized travel of these technologies. Addresses questions of ownership, property, authorship, and copyright in the age of digital file sharing. Particular focus on how the sound/noise boundary is imagined, created and modeled across diverse sociocultural and scientific contexts. Auditory examples--sound art, environmental recordings, music--will be provided and invited. Instruction and practice in written and oral communication provided. Limited to 20."
        ],
        [
            "inst",
            [
                "J. Picker"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.586[J] Introduction to Education: Looking Forward and Looking Back on Education"
        ],
        [
            "prerec",
            "Same subject as 11.124[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "One of two introductory subjects on teaching and learning science and mathematics in a variety of K-12 settings. Topics include education and media, education reform, the history of education, simulations, games, and the digital divide. Students gain practical experience through weekly visits to schools, classroom discussions, selected readings, and activities to develop a critical and broad understanding of past and current forces that shape the goals and processes of education, and explores the challenges and opportunities of teaching. Students work collaboratively and individually on papers, projects, and in-class presentations. Limited to 25."
        ],
        [
            "inst",
            [
                "E. Klopfer"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.587[J] Introduction to Education: Understanding and Evaluating Education"
        ],
        [
            "prerec",
            "Same subject as 11.125[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "One of two introductory subjects on teaching and learning science and mathematics in a variety of K-12 settings. Topics include student misconceptions, formative assessment, standards and standardized testing, multiple intelligences, and educational technology. Students gain practical experience through weekly visits to schools, classroom discussions, selected readings, and activities to develop a critical and broad understanding of past and current forces that shape the goals and processes of education, and explores the challenges and opportunities of teaching. Students work collaboratively and individually on papers, projects, and in-class presentations. Limited to 25."
        ],
        [
            "inst",
            [
                "E. Klopfer"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.590[J] Design and Development of Games for Learning"
        ],
        [
            "prerec",
            "Same subject as 11.127[J]\nSubject meets with 11.252[J], CMS.863[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Immerses students in the process of building and testing their own digital and board games in order to better understand how we learn from games. Explores the design and use of games in the classroom in addition to research and development issues associated with computer-based (desktop and handheld) and non-computer-based media. In developing their own games, students examine what and how people learn from them (including field testing of products), as well as how games can be implemented in educational settings. All levels of computer experience welcome. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "E. Klopfer"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.591[J] Educational Theory and Practice I"
        ],
        [
            "prerec",
            "Same subject as 11.129[J]"
        ],
        [
            "terms",
            [
                "Prereq: None. <i>Coreq: <a href=\"/search/?P=CMS.586\" title=\"CMS.586[J]\" class=\"bubblelink code\" onclick=\"return showCourse(this, 'CMS.586');\">CMS.586[J]</a></i> "
            ]
        ],
        [
            "desc",
            "Concentrates on core set of skills and knowledge necessary for teaching in secondary schools. Topics include classroom management, student behavior and motivation, curriculum design, educational reform, and the teaching profession. Classroom observation is a key component. Assignments include readings from educational literature, written reflections on classroom observations, practice teaching and constructing curriculum. The first of the three-course sequence necessary to complete the Teacher Education Program. Limited to 15; preference to juniors and seniors."
        ],
        [
            "inst",
            [
                "G. Schwanbeck"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.592[J] Educational Theory and Practice II"
        ],
        [
            "prerec",
            "Same subject as 11.130[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=CMS.591\" title=\"CMS.591[J]\" class=\"bubblelink code\" onclick=\"return showCourse(this, 'CMS.591');\">CMS.591[J]</a> "
            ]
        ],
        [
            "desc",
            "Concentrates on the theory and psychology associated with student learning. Topics include educational theory, educational psychology, and theories of learning. Students assume responsibility for full-time teaching of two or more classes at their designated school. Class sessions focus on debriefing and problem-solving. Second of a three-course sequence necessary to complete the Teacher Education Program."
        ],
        [
            "inst",
            [
                "G. Schwanbeck"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.593[J] Educational Theory and Practice III"
        ],
        [
            "prerec",
            "Same subject as 11.131[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=CMS.592\" title=\"CMS.592[J]\" class=\"bubblelink code\" onclick=\"return showCourse(this, 'CMS.592');\">CMS.592[J]</a> "
            ]
        ],
        [
            "desc",
            "Students continue their IAP student teaching through mid March. Topics include educational psychology, theories of learning, and using technology and evaluating its effectiveness to enhance student learning. Assignments include readings from educational literature, written reflections on student teaching, presentations on class topics and creating a project that supports student learning at the school where the MIT student is teaching. This is the third of the three-course sequence necessary to complete the Teacher Education Program."
        ],
        [
            "inst",
            [
                "G. Schwanbeck"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.594 Education Technology Studio"
        ],
        [
            "prerec",
            "Subject meets with CMS.894"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Uses media and technology to develop new forms of learning experiences for schools, workplace, and informal settings. Students participate in a range of projects that hone understanding and skills in learning science, instructional design, development, and evaluation. Topics vary but include developing new media and activities for massive open online courses, creating practice spaces for practitioners in the professions and humanities, and developing new approaches to assessment in complex learning environments. May be repeated for credit with permission of instructor if project content differs. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "J. Reich"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.595 Learning, Media, and Technology"
        ],
        [
            "prerec",
            "Subject meets with CMS.895"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Addresses new digital technologies that are transforming learning across the lifespan - from reading apps for toddlers, intelligent tutors for school children, and blended learning for college students, to MOOCs for adults and interest-based learning communities for hobbyists. Focuses on how these technologies shape people's lives and learning. Students explore how education technologies operate in complex social-technical systems, and acquire analytic tools and strategies that can be applied to other complex systems. They also refine their thinking about the opportunities, limits, and tradeoffs of educational technology. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "J. Reich"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.603 Independent Study"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Opportunity for individual research in comparative media studies. Registration subject to prior arrangement for subject matter and supervision by a faculty member."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.604 Independent Study"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Opportunity for individual research in comparative media studies. Registration subject to prior arrangement for subject matter and supervision by a faculty member."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.605 Media Internship"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring)"
            ]
        ],
        [
            "desc",
            "Part-time internships arranged in Boston and the wider Northeast for students wishing to develop professional experience in a media production organization or industry. Students work with a CMS faculty advisor to produce a white paper on a research topic of interest based on their intern experience. Students planning to take this subject must contact the instructor before the end of the preceding term."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.606 Media Internship"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Fall, IAP, Spring)"
            ]
        ],
        [
            "desc",
            "Part-time internships arranged in Boston and the wider Northeast for students wishing to develop professional experience in a media production organization or industry. Students work with a CMS/W faculty advisor to produce a white paper on a research topic of interest based on their intern experience. Students planning to take this subject must contact the instructor before the end of the preceding term."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.609[J] The Word Made Digital"
        ],
        [
            "prerec",
            "Same subject as 21W.764[J]\nSubject meets with CMS.846"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21W.764[J]. Limited to 18."
        ],
        [
            "inst",
            [
                "N. Montfort"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.611[J] Creating Video Games"
        ],
        [
            "prerec",
            "Same subject as 6.4570[J]"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=6.100A\" title=\"6.100A\" class=\"bubblelink code\" onclick=\"return showCourse(this, '6.100A');\">6.100A</a> or <a href=\"/search/?P=CMS.301\" title=\"CMS.301\" class=\"bubblelink code\" onclick=\"return showCourse(this, 'CMS.301');\">CMS.301</a> "
            ]
        ],
        [
            "desc",
            "Introduces students to the complexities of working in small, multidisciplinary teams to develop video games. Covers creative design and production methods, stressing design iteration and regular testing across all aspects of game development (design, visual arts, music, fiction, and programming). Assumes a familiarity with current video games, and the ability to discuss games critically. Previous experience in audio design, visual arts, or project management recommended. Limited to 36."
        ],
        [
            "inst",
            [
                "P. Tan",
                "S. Verrilli",
                "R. Eberhardt",
                "A. Grant"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.614[J] Critical Internet Studies"
        ],
        [
            "prerec",
            "Same subject as 21W.791[J]\nSubject meets with CMS.867"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Focuses on the power dynamics in internet-related technologies (including social networking platforms, surveillance technology, entertainment technologies, and emerging media forms). Theories and readings focus on the cultural, social, economic, and political aspects of internet use and design, with a special attention to gender and race. Topics include: online communication and communities, algorithms and search engines, activism and online resistance, surveillance and privacy, content moderation and platform governance, and the spread of dis- and misinformation. Instruction and practice in written and oral communication provided. Students taking the graduate version complete additional readings and assignments."
        ],
        [
            "inst",
            [
                "T. L. Taylor"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.615 Games for Social Change"
        ],
        [
            "prerec",
            "Subject meets with CMS.815"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines how various movements have tried over time to create games that enable players to enact social change. Students collaborate in teams to design and prototype games for social change and civic engagement. In a workshop setting, teams develop games and showcase them at an end-of-term open house. Features guest speakers from academia and industry as well as the nonprofit sector and the gaming community. Readings explore principals of game design and the social history of games. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "S. Osterweil"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.616[J] Games and Culture"
        ],
        [
            "prerec",
            "Same subject as 21W.768[J], WGS.125[J]\nSubject meets with CMS.868"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines the social, cultural, economic, and political aspects of digital games. Topics include the culture of gameplay, gaming styles, communities, spectatorship and performance, gender and race within digital gaming, and the politics and economics of production processes, including co-creation and intellectual property. Students taking graduate version complete additional readings and assignments."
        ],
        [
            "inst",
            [
                "T. L. Taylor"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.618[J] Interactive Narrative"
        ],
        [
            "prerec",
            "Same subject as 21L.489[J], 21W.765[J]\nSubject meets with CMS.845"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 21W.765[J]."
        ],
        [
            "inst",
            [
                "N. Montfort"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.619[J] Gender and Media Studies"
        ],
        [
            "prerec",
            "Same subject as WGS.111[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject WGS.111[J]."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.621 Fans and Fan Cultures"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: U (Fall, Spring)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Examines media audiences - specifically, fans - and the subcultures that evolve around them. Examines the different historical, contemporary and transnational understandings of fans. Explores products of fan culture, i.e., clubs, fiction, \"vids,\" activism, etc. Readings place these products within the context of various disciplines. Students consider the concept of the \"aca-fan\" and reflect on their own \"fannish\" practices. Requires several short papers. Students taking graduate version complete additional assignments. Limited to 20."
        ],
        [
            "inst",
            [
                "E. Schiappa"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.627 Imagination, Computation, and Expression Studio"
        ],
        [
            "prerec",
            "Subject meets with CMS.827"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Aims to help students invent and analyze new forms of computer-based art, gaming, social media, interactive narrative, and related technologies. Students participate in a range of new and ongoing projects that are designed to hone skills in research, development, design, and evaluation. Topics vary from year to year; examples include cognitive science and artificial intelligence-based approaches to the arts; social aspects of game design; computing for social empowerment; and game character, avatar, and online profile design. May be repeated for credit with permission of instructor. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "D. F. Harrell"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.628 Advanced Identity Representation"
        ],
        [
            "prerec",
            "Subject meets with CMS.828"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Studies and develops computational identity systems for games, social media, virtual worlds, and computer-based artwork. An interdisciplinary set of readings (cognitive science, computer science, art, and sociology) looks at both the underlying technology and the social/cultural aspects of identity. Includes topics such as developing improved characters, avatars, agents, social networking profiles, and online accounts. Engages students in on-going research projects. Explores how social categories are formed in digital media, including gender, class, and ethnicity, along with everyday social categories (such as those based on personality or shared media preferences). Experience required in one of the following: computer programming, graphic design, web development, interaction design, or social science research methods. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "D. F. Harrell"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.631 Data Storytelling Studio"
        ],
        [
            "prerec",
            "Subject meets with CMS.831"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Explores visualization methodologies to conceive and represent systems and data, e.g., financial, media, economic, political, etc. Covers basic methods for research, cleaning, and analysis of datasets. Introduces creative methods of data presentation and storytelling. Considers the emotional, aesthetic, ethical, and practical effects of different presentation methods as well as how to develop metrics for assessing impact. Work centers on readings, visualization exercises, and a final project. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.633 Digital Humanities: Topics, Techniques, and Technologies"
        ],
        [
            "prerec",
            "Subject meets with CMS.833"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines theory and practice of using computational methods in the emerging field of digital humanities. Develops an understanding of key digital humanities concepts such as data representation, digital archives, information visualization, and user interaction through the study of contemporary research in conjunction with working on real-world projects for scholarly, educational, and public needs. Students create prototypes, write design papers, and conduct user studies. Some programming and design experience is helpful but not required. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "K. Fendt"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.634 Designing Interactions"
        ],
        [
            "prerec",
            "Subject meets with 4.569[J], CMS.834[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Explores the future of mobile interactions and pervasive computing, taking into consideration design, technological, social and business aspects. Discusses theoretical works on human-computer interaction, mobile media and interaction design, and covers research and design methods. Students work in multidisciplinary teams and participate in user-centric design projects aimed to study, imagine and prototype concepts illustrating the future of mobile applications and ubiquitous computing. Students taking graduate version complete additional assignments. Repeatable for credit with permission of instructor. Limited to 12."
        ],
        [
            "inst",
            [
                "F. Casalegno",
                "T. Nagakura"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.635 Designing Active Archives"
        ],
        [
            "prerec",
            "Subject meets with CMS.835"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Investigates the digital archive as an emerging platform for critical inquiry and creative engagement through analysis, conceptualization, and experimentation with user-oriented design. Readings provide theoretical, analytical, and practical perspectives on topics such as participatory digital culture, data curation, visualization, and the archive's role in activism. Students work throughout the term to develop a group project. Students taking graduate version complete additional readings and assignments."
        ],
        [
            "inst",
            [
                "K. Fendt"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.636 Extending the Museum"
        ],
        [
            "prerec",
            "Subject meets with CMS.855"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Investigates the museum as a participatory public space and rethinks visitor engagement and museum education in light of digital technologies, including extended reality (XR) technologies. Students develop concepts, models, and prototypes that integrate physical and digital spaces in novel ways in close collaboration with partners at local museums. Readings provide theoretical, critical, and analytical foundations for collaborative class projects. Students taking graduate version complete additional readings and assignments."
        ],
        [
            "inst",
            [
                "K. Fendt"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.701 Current Debates in Media"
        ],
        [
            "prerec",
            "Subject meets with CMS.901"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=CMS.100\" title=\"CMS.100\" class=\"bubblelink code\" onclick=\"return showCourse(this, 'CMS.100');\">CMS.100</a> "
            ]
        ],
        [
            "desc",
            "Addresses important, current debates in media with in-depth discussion of popular perceptions and policy implications. Students use multiple perspectives to analyze texts emanating from these debates, and present their findings through discussions and reports. Explores emerging topics (e.g., piracy and IP regimes, net neutrality, media effects, social media and social change, and changing literacies) across media forms and from various historical, transcultural, and methodological perspectives. Examines the framing of these issues, their ethical and policy implications, and strategies for repositioning the debate. Instruction and practice in written and oral communication provided. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.702 Qualitative Research Methods"
        ],
        [
            "prerec",
            "Subject meets with CMS.802"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Focuses on a number of qualitative social science methods including interviewing, participant observation, focus groups, cultural probes, and visual sociology. Primary emphasis on understanding and learning concrete techniques that can be evaluated and utilized in any given project. Data organization and analysis will be addressed. Several advanced critical thematics are also covered, including ethics, reciprocity, \"studying up,\" and risk. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "T. L. Taylor"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.S60 Special Subject: Comparative Media Studies"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "U (IAP, Spring)"
            ]
        ],
        [
            "desc",
            "Seminar or lecture on a topic that is not covered in the regular curriculum."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.S61 Special Subject: Comparative Media Studies"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Seminar or lecture on a topic that is not covered in the regular curriculum."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.S62 Special Subject: Comparative Media Studies"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Seminar or lecture on a topic that is not covered in the regular curriculum."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.S63 Special Subject: Comparative Media Studies"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall)"
            ]
        ],
        [
            "desc",
            "Seminar or lecture on a topic that is not covered in the regular curriculum."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.THT Comparative Media Studies Pre-Thesis Tutorial"
        ],
        [
            "prerec",
            "Prereq: Permission of advisor"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Student works with an advisor to define his/her thesis. By the end of the term, student must have a substantial outline and bibilography for thesis and must have selected a three-person thesis committee. Advisor must approve outline and bibliography."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.THU Undergraduate Thesis in Comparative Media Studies"
        ],
        [
            "prerec",
            "Prereq: CMS.THT"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "The CMS Undergraduate Thesis is a substantial research project or comparable exercise. A written thesis ranges in length from 35 to 50 pages. Digital projects are assessed on the quality of research and argumentation, as well as presentation, and must include a substantial written component. Student gives an oral presentation of his/her thesis at the end of the term. Thesis is not required for CMS majors."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.UR Research in Comparative Media Studies"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Individual participation in an ongoing research project. For students in the Undergraduate Research Opportunities Program."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.URG Research in Comparative Media Studies"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "U (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Individual participation in an ongoing research project. For students in the Undergraduate Research Opportunities Program."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "head",
        "Graduate Subjects"
    ],
    [
        "block",
        [
            "title",
            "CMS.790 Media Theories and Methods I"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "An advanced introduction to core theoretical and methodological issues in comparative media studies. Topics covered typically include the nature of theory, the gathering and evaluation of evidence, the relationship of media to reality, formal approaches to media analysis, the ethnographic documentation of media audiences, cultural hierarchy and taste, modes of production, models of readership and spectatorship."
        ],
        [
            "inst",
            [
                "W. Uricchio"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.791 Media Theories and Methods II"
        ],
        [
            "prerec",
            "Prereq: CMS.790"
        ],
        [
            "terms",
            [
                "G (Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "An advanced introduction to core theoretical and methodological issues in comparative media studies. Topics covered typically include globalization, propaganda and persuasion, social and political effects of media change, political economy and the institutional analysis of media ownership, online communities, privacy and intellectual property, and the role of news and information within democratic cultures."
        ],
        [
            "inst",
            [
                "H. Hendershot"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.796 Major Media Texts"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Intensive close study and analysis of historically significant media \"texts\" that have been considered landmarks or have sustained extensive critical and scholarly discussion. Such texts may include oral epic, story cycles, plays, novels, films, opera, television drama and digital works. Emphasizes close reading from a variety of contextual and aesthetic perspectives. Syllabus varies each year, and may be organized around works that have launched new modes and genres, works that reflect upon their own media practices, or on stories that migrate from one medium to another. At least one of the assigned texts is collaboratively taught, and visiting lectures and discussions are a regular feature of the subject."
        ],
        [
            "inst",
            [
                "L. Parks"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.801 Media in Transition"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Centers on historical eras in which the form and function of media technologies were radically transformed. Includes consideration of the \"Gutenberg Revolution,\" the rise of modern mass media, and the \"digital revolution,\" among other case studies of media transformation and cultural change. Readings in cultural and social history and historiographic method."
        ],
        [
            "inst",
            [
                "E. Schiappa"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.802 Qualitative Research Methods"
        ],
        [
            "prerec",
            "Subject meets with CMS.702"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Focuses on a number of qualitative social science methods including interviewing, participant observation, focus groups, cultural probes, and visual sociology. Primary emphasis on understanding and learning concrete techniques that can be evaluated and utilized  in any given project. Data organization and analysis will be addressed. Several advanced critical thematics are also covered, including ethics, reciprocity, \"studying up,\" and risk. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "T. L. Taylor"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.806 Making Comics and Sequential Art"
        ],
        [
            "prerec",
            "Subject meets with CMS.306"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Applied introduction to comics and sequential art production. Builds skills in how to develop storylines; develop and draw characters, panels, and backgrounds; prepare for print production; and comprehend the basics of sequential language, composition, and layout. Students engage with crucial personal and political issues at stake across a range of comics genres: superhero, biographical, and countercultural. Addresses not just how we create comics, but why we create comics. Students taking graduate version complete additional assignments. Limited to 16."
        ],
        [
            "inst",
            [
                "M. Cordero"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.807 Critical Worldbuilding"
        ],
        [
            "prerec",
            "Subject meets with CMS.307"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Studies the design and analysis of invented (or constructed) worlds for narrative media, such as television, films, comics, and literary texts. Provides the practical, historical and critical tools with which to understand the function and structure of imagined worlds. Examines world-building strategies in the various media and genres in order to develop a critical and creative repertoire. Participants create their own invented worlds. Students taking graduate version complete additional assignments. Limited to 13."
        ],
        [
            "inst",
            [
                "J. Diaz"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.809 Transmedia Storytelling: Modern Science Fiction"
        ],
        [
            "prerec",
            "Subject meets with 21W.763[J], CMS.309[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Explores transmedia storytelling by investigating how science fiction stories are told across different media, such as the short story, the novel, the screenplay, moving image, and games. Students consider issues of aesthetics, authorship, and genre, while also contextualizing discussion within the broader framework of the political issues raised by film, TV, and other kinds of science fiction texts. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "H. Hendershot"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.813 Silent Film"
        ],
        [
            "prerec",
            "Subject meets with CMS.313"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines how the key elements of today's films - composition, continuity editing, lighting, narrative structure - were originally created. Studies the history of cinema, from its origins in the late 19th century to the transition to sound in the late 1920s and early 1930s. Students view a range of films (both mainstream and experimental) from all over the world, with a particular focus on US productions. Emphasis on how color, sound, and other developments paved the way for today's technological innovations. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "H. Hendershot"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.814 Phantasmal Media: Computer-Based Art Theory and Practice"
        ],
        [
            "prerec",
            "Subject meets with 21W.753[J], CMS.314[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Engages students in theory and practice of using computational techniques for developing expressive digital media works. Surveys approaches to understanding human imaginative processes, such as constructing concepts, metaphors, and narratives, and applies them to producing and understanding socially, culturally, and critically meaningful works in digital media. Readings engage a variety of theoretical perspectives from cognitive linguistics, literary and cultural theory, semiotics, digital media arts, and computer science. Students produce interactive narratives, games, and related forms of software art. Some programming and/or interactive web scripting experience (e.g., Flash, Javascript) is desirable. Students taking the graduate version complete a project requiring more in-depth theoretical engagement."
        ],
        [
            "inst",
            [
                "D. F. Harrell"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.815 Games for Social Change"
        ],
        [
            "prerec",
            "Subject meets with CMS.615"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Students will collaborate in teams to design and prototype games for social change and civic engagement. Run as a workshop in which student teams develop their games and showcase them at a semester-end open house. Features guest speakers from academia and industry as well as the non-profit sector and the gaming community. Readings will explore principals of game design, and the social history of games. Graduate students will complete additional assignments."
        ],
        [
            "inst",
            [
                "S. Osterweil"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.821 Fans and Fan Cultures"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: G (Spring)",
                "\nAcad Year 2024-2025: Not offered"
            ]
        ],
        [
            "desc",
            "Examines media audiences - specifically, fans - and the subcultures that evolve around them. Examines the different historical, contemporary and transnational understandings of fans. Explores products of fan culture, i.e., clubs, fiction, \"vids,\" activism, etc. Readings place these products within the context of various disciplines. Students consider the concept of the \"aca-fan\" and reflect on their own \"fannish\" practices. Requires several short papers. Students taking graduate version complete additional assignments. Limited to 20."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.827 Imagination, Computation, and Expression Studio"
        ],
        [
            "prerec",
            "Subject meets with CMS.627"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Aims to help students invent and analyze new forms of computer-based art, gaming, social media, interactive narrative, and related technologies. Students participate in a range of new and ongoing projects that are designed to hone skills in research, development, design, and evaluation. Topics vary from year to year; examples include cognitive science and artificial intelligence-based approaches to the arts; social aspects of game design; computing for social empowerment; and game character, avatar, and online profile design. May be repeated for credit with permission of instructor. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "D. F. Harrell"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.828 Advanced Identity Representation"
        ],
        [
            "prerec",
            "Subject meets with CMS.628"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Studies and develops computational identity systems for games, social media, virtual worlds, and computer-based artwork. An interdisciplinary set of readings (cognitive science, computer science, art, and sociology) looks at both the underlying technology and the social/cultural aspects of identity. Includes topics such as developing improved characters, avatars, agents, social networking profiles, and online accounts. Engages students in on-going research projects. Explores how social categories are formed in digital media, including gender, class, and ethnicity, along with everyday social categories (such as those based on personality or shared media preferences). Experience required in one of the following: computer programming, graphic design, web development, interaction design, or social science research methods. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "D. F. Harrell"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.830 Studies in Film"
        ],
        [
            "prerec",
            "Subject meets with 21L.706"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Intensive study of films from particular periods, genres, or directors, or films focusing on specific formal or theoretical problems. Previous topics include The Contemporary Horror Film, Film Remixes, Film Narrative, Heroic Cinema, and Color in Film. Students taking graduate version complete different assignments. May be repeated for credit with permission of instructor if content differs. Limited to 12."
        ],
        [
            "inst",
            [
                "P. Donaldson",
                "E. Brinkema"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.831 Data Storytelling Studio"
        ],
        [
            "prerec",
            "Subject meets with CMS.631"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Explores visualization methodologies to conceive and represent systems and data, e.g., financial, media, economic, political, etc. Covers basic methods for research, cleaning, and analysis of datasets. Introduces creative methods of data presentation and storytelling. Considers the emotional, aesthetic, ethical, and practical effects of different presentation methods as well as how to develop metrics for assessing impact. Work centers on readings, visualization exercises, and a final project. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.833 Digital Humanities: Topics, Techniques, and Technologies"
        ],
        [
            "prerec",
            "Subject meets with CMS.633"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines theory and practice of using computational methods in the emerging field of digital humanities. Develops an understanding of key digital humanities concepts such as data representation, digital archives, information visualization, and user interaction through the study of contemporary research in conjunction with working on real-world projects for scholarly, educational, and public needs. Students create prototypes, write design papers, and conduct user studies. Some programming and design experience is helpful but not required. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "K. Fendt"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.834[J] Designing Interactions"
        ],
        [
            "prerec",
            "Same subject as 4.569[J]\nSubject meets with CMS.634"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Explores the future of mobile interactions and pervasive computing, taking into consideration design, technological, social and business aspects. Discusses theoretical works on human-computer interaction, mobile media and interaction design, and covers research and design methods. Students work in multidisciplinary teams and participate in user-centric design projects aimed to study, imagine and prototype concepts illustrating the future of mobile applications and ubiquitous computing. Students taking graduate version complete additional assignments. Repeatable for credit with permission of instructor. Limited to 12."
        ],
        [
            "inst",
            [
                "F. Casalegno",
                "T. Nagakura"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.835 Desiging Active Archives"
        ],
        [
            "prerec",
            "Subject meets with CMS.635"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Investigates the digital archive as an emerging platform for critical inquiry and creative engagement through analysis, conceptualization, and experimentation with user-oriented design. Readings provide theoretical, analytical, and practical perspectives on topics such as participatory digital culture, data curation, visualization, and the archive's role in activism. Students work throughout the term to develop a group project. Students taking graduate version complete additional readings and assignments."
        ],
        [
            "inst",
            [
                "K. Fendt"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.836 Social Justice and The Documentary Film"
        ],
        [
            "prerec",
            "Subject meets with 21W.786[J], CMS.336[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Explores the history and current state of social-issue documentary. Examines how cultural and political upheaval and technological change have converged at different moments to bring about new waves of activist documentary film production. Particular focus on films and other non-fiction media of the present and recent past. Students screen and analyze a series of key films and work in groups to produce their own short documentary using digital video and computer-based editing. Students taking graduate version complete additional assignments. Limited to 18."
        ],
        [
            "inst",
            [
                "V. Bald"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.837 Film, Music, and Social Change: Intersections of Media and Society"
        ],
        [
            "prerec",
            "Subject meets with 21W.787"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines films from the 1950s onward that document music subcultures and moments of social upheaval. Combines screening films about free jazz, glam rock, punk, reggae, hip-hop, and other genres with an examination of critical/scholarly writings to illuminate the connections between film, popular music, and processes of social change. Students critique each film in terms of the social, political, and cultural world it documents, and the historical context and effects of the film's reception. Students taking graduate version complete additional assignments. Limited to 18."
        ],
        [
            "inst",
            [
                "V. Bald"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.838 Innovation in Documentary: Technologies and Techniques"
        ],
        [
            "prerec",
            "Subject meets with CMS.338"
        ],
        [
            "terms",
            [
                "Prereq: <a href=\"/search/?P=CMS.100\" title=\"CMS.100\" class=\"bubblelink code\" onclick=\"return showCourse(this, 'CMS.100');\">CMS.100</a> or permission of instructor "
            ]
        ],
        [
            "desc",
            "Discusses emerging technologies and techniques available to media-makers (e.g., location-based technologies, transmedia storytelling, crowdsourcing, and interactivity) and their implications on the film and television documentary. Studies the development of these tools and considers the many new directions in which they may take the genre. Includes screenings, meetings with documentary makers, and an experimental component in which students can explore new approaches to documentary production. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "W. Uricchio"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.839 Virtual Reality and Immersive Media Production"
        ],
        [
            "prerec",
            "Subject meets with CMS.339"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Provides an overview of historical developments and current innovations in virtual reality (e.g., gear, software, and storytelling techniques) and looks into new trends in augmented, mixed and holographic reality. Includes practical instruction and a step-by-step exploration of the fundamentals of virtual reality creation - from new visual languages and grammars, to storyboarding, scripting, sound design and editing, to new and innovative ways to capture, scan and reproduce 360-degree images. Students taking graduate version complete additional assignments. Limited to 18."
        ],
        [
            "inst",
            [
                "S. Rodriguez"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.840 Literature and Film"
        ],
        [
            "prerec",
            "Subject meets with 21L.435"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Investigates relationships between the two media, including film adaptations as well as works linked by genre, topic, and style. Explores how artworks challenge and cross cultural, political, and aesthetic boundaries. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "K. Surkan"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.841 Game Studies"
        ],
        [
            "prerec",
            "Subject meets with CMS.300"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Introduction to the interdisciplinary study of videogames as texts through an examination of their cultural, educational, and social functions in contemporary settings. Students play and analyze videogames while reading current research and theory from a variety of sources in the sciences, social sciences, humanities, and industry. Assignments focus on game analysis in the context of the theories discussed in class. Includes regular reading, writing, and presentation exercises. No prior programming experience required. Students taking graduate version complete additional assignments. Limited to 20."
        ],
        [
            "inst",
            [
                "M. Jakobsson"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.844 Exploratory Programming for the Arts and Humanities"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "Acad Year 2023-2024: Not offered",
                "\nAcad Year 2024-2025: G (Spring)"
            ]
        ],
        [
            "desc",
            "Introduces programming through \"free projects\" in which students choose (or discover) the direction of their project through exploration. Covers the fundamentals of programming and how to develop a programming practice. Students complete analytical and generative projects, using different media. Examines how to think with computation, how computation and media interact, and how computation can be understood as a part of culture. No background in programming required. Limited to 18."
        ],
        [
            "inst",
            [
                "N. Montfort"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.845 Interactive Narrative"
        ],
        [
            "prerec",
            "Subject meets with 21L.489[J], 21W.765[J], CMS.618[J]"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Provides a workshop environment for understanding interactive narrative (print and digital) through critical writing, narrative theory, and creative practice. Covers important multisequential books, hypertexts, and interactive fictions. Students write critically, and give presentations, about specific works; write a short multisequential fiction; and develop a digital narrative system, which involves significant writing and either programming or the structuring of text. Programming ability helpful. Graduate students complete additional assignments."
        ],
        [
            "inst",
            [
                "N. Montfort"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.846 The Word Made Digital"
        ],
        [
            "prerec",
            "Subject meets with 21W.764[J], CMS.609[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Considers the many uses of text, language, and writing in creative digital media. Focuses on non-narrative uses of text, such as in information display, visual and lyrical settings, and human-legible computer code. Considers the use of text within the context of computing and different computing platforms. Draws on concepts and approaches from poetics, the material history of texts, and computer science. Assignments include individual and group writing projects, which involve reading and modifying computer programs. Previous programming experience and writing coursework helpful. Students taking graduate version complete additional assignments. Limited to 18."
        ],
        [
            "inst",
            [
                "N. Montfort"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.848 Apocalyptic Storytelling"
        ],
        [
            "prerec",
            "Subject meets with 21W.748"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Focuses on the critical making of apocalyptic, post-apocalyptic and dystopian stories across various narrative media. Considers the long history of Western apocalypticism as well as the uses and abuses of apocalypticism across time. Examines a wide variety of influential texts in order to enhance students' creative and theoretical repertoires. Students create their own apocalyptic stories and present on selected texts. Investigates conventions such as plague, zombies, nuclear destruction, robot uprising, alien invasion, environmental collapse, and supernatural calamities. Considers questions of race, gender, sexuality, colonialism, trauma, memory, witness, and genocide. Intended for students with prior creative writing experience. Students taking graduate version complete additional assignments. Limited to 15."
        ],
        [
            "inst",
            [
                "J. Diaz"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.855 Extending the Museum"
        ],
        [
            "prerec",
            "Subject meets with CMS.636"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Investigates the museum as a participatory public space and rethinks visitor engagement and museum education in light of digital technologies, including extended reality (XR) technologies. Students develop concepts, models, and prototypes that integrate physical and digital spaces in novel ways in close collaboration with partners at local museums. Readings provide theoretical, critical, and analytical foundations for collaborative class projects. Students taking graduate version complete additional readings and assignments."
        ],
        [
            "inst",
            [
                "K. Fendt"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.860 Introduction to Civic Media"
        ],
        [
            "prerec",
            "Subject meets with CMS.360"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines civic media in comparative, transnational and historical perspective. Introduces various theoretical tools, research approaches, and project design methods. Students engage with multimedia texts on concepts such as citizen journalism, transmedia activism, media justice, and civic, public, radical, and tactical media. Case studies explore civic media across platforms (print, radio, broadcast, internet), contexts (from local to global, present-day to historical), and use (dialogic, contentious, hacktivist). As a final project, students develop a case study or project proposal. Students taking the graduate version complete additional assignments. Limited to20."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.861 Networked Social Movements: Media and Mobilization"
        ],
        [
            "prerec",
            "Subject meets with CMS.361"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Provides an overview of social movement studies as a body of theoretical and empirical work, with an emphasis on understanding the relationship between social movements and the media. Explores multiple methods of social movement investigation, including textual and media analysis, surveys, interviews, focus groups, participant observation, and co-research. Covers recent innovations in social movement theory, as well as new data sources and tools for research and analysis. Includes short papers, a literature review, and a final research project. Students taking graduate version complete additional assignments. Limited to 16."
        ],
        [
            "inst",
            [
                "S. Costanza-Chock"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.862 Civic Media Collaborative Design Studio"
        ],
        [
            "prerec",
            "Subject meets with CMS.362"
        ],
        [
            "terms",
            [
                "Prereq: One subject in CMS or MAS "
            ]
        ],
        [
            "desc",
            "Project-based studio focusing on collaborative design of civic media provides a service-learning opportunity for students interested in working with community organizations. Multidisciplinary teams create civic media projects based on real-world community needs. Covers co-design methods and best practices to include the user community in iterative stages of project ideation, design, implementation, testing, and evaluation. Students taking graduate version complete additional assignments. Limited to 16."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.863[J] Design and Development of Games for Learning"
        ],
        [
            "prerec",
            "Same subject as 11.252[J]\nSubject meets with 11.127[J], CMS.590[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Immerses students in the process of building and testing their own digital and board games in order to better understand how we learn from games. Explores the design and use of games in the classroom in addition to research and development issues associated with computer-based (desktop and handheld) and non-computer-based media. In developing their own games, students examine what and how people learn from them (including field testing of products), as well as how games can be implemented in educational settings. All levels of computer experience welcome. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "E. Klopfer"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.864 Game Design"
        ],
        [
            "prerec",
            "Prereq: One subject in Comparative Media Studies or permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Practical instruction in the design and analysis of non-digital games. Provides students the texts, tools, references, and historical context to analyze and compare game designs across a variety of genres. In teams, students design, develop, and thoroughly test their original games to better understand the interaction and evolution of game rules. Covers various genres and types of games, including sports, game shows, games of chance, card games, schoolyard games, board games, and role-playing games. Students taking the graduate version complete additional assignments. Limited to 20."
        ],
        [
            "inst",
            [
                "P. Tan",
                "R. Eberhardt"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.865 Immersive Media Studies"
        ],
        [
            "prerec",
            "Subject meets with CMS.340"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Critical examination of the history, aesthetics, and politics of virtual reality and related media. Focuses on virtual space and embodiment; cultural reception and industry hype; accessibility, surveillance, and data privacy; and debates surrounding the use of immersive media in social, work, art, and entertainment contexts. Projects include experimentation with VR development tools and critical analysis of existing immersive works. Graduate version includes additional research. Enrollment limited to 15."
        ],
        [
            "inst",
            [
                "P. Roquet"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.867 Critical Internet Studies"
        ],
        [
            "prerec",
            "Subject meets with 21W.791[J], CMS.614[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Focuses on the power dynamics in internet-related technologies (including social networking platforms, surveillance technology, entertainment technologies, and emerging media forms). Theories and readings focus on the cultural, social, economic, and political aspects of internet use and design, with a special attention to gender and race. Topics include: online communication and communities, algorithms and search engines, activism and online resistance, surveillance and privacy, content moderation and platform governance, and the spread of dis- and misinformation. Instruction and practice in written and oral communication provided. Students taking the graduate version complete additional readings and assignments."
        ],
        [
            "inst",
            [
                "T. L. Taylor"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.868 Games and Culture"
        ],
        [
            "prerec",
            "Subject meets with 21W.768[J], CMS.616[J], WGS.125[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Examines the social, cultural, economic, and political aspects of digital games. Topics include the culture of gameplay, gaming styles, communities, spectatorship and performance, gender and race within digital gaming, and the politics and economics of production processes, including co-creation and intellectual property. Students taking graduate version complete additional readings and assignments."
        ],
        [
            "inst",
            [
                "T. L. Taylor"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.871 Media in Cultural Context"
        ],
        [
            "prerec",
            "Subject meets with 21L.715"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Seminar uses case studies to examine specific media or media configurations and the larger social, cultural, economic, political, or technological contexts within which they operate. Organized around recurring themes in media history, as well as specific genres, movements, media, or historical moments. Previously taught topics include Gendered Genres: Horror and Maternal Melodramas; Comics, Cartoons, and Graphic Storytelling; and Exploring Children's Culture. Students taking graduate version complete additional assignments. Approved for credit in Women's and Gender Studies when content meets the requirements for subjects in that program. Limited to 12."
        ],
        [
            "inst",
            [
                "M. Marks"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.875 Reading Climate Through Media"
        ],
        [
            "prerec",
            "Subject meets with CMS.375"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Explores how climate is construed in the contemporary media in order to gain a better understanding of how views of climate change are shaped and received in the public sphere. Studies the pathways that take us from climate science to media content, from the big data of global scale to the particulars and narratives of the human experience. Surveys a variety of media forms--reports, articles, comics, videos, films, photography, poetry and fiction--that reflect on the contemporary human challenges of dealing with a changing natural environment of our own making. Emphasizes the role of media in shaping public opinion, both in the US and globally, and its influence on public (and voter) perceptions on which a vast body of regulation and funding for environmental management is based. Students work individually and in teams to produce a selection of the media forms studied. Students taking graduate version complete additional assignments. Limited to 20."
        ],
        [
            "inst",
            [
                "J. Paradis"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.876 History of Media and Technology"
        ],
        [
            "prerec",
            "Subject meets with CMS.376"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Surveys the interrelated histories of communications media and technological development, from the emergence of 19th-century forms of mass print media and telegraphy, to sound capture and image-based forms (e.g., film, radio, and television), to the shift from analog to digital cultures. Examines how new forms of communication exert social, political, and cultural influences in the global context. Explores how technological innovation and accelerating media affect social values and behaviors in the popular and global adoption of a media device. Includes two papers and a research project on aspects of media history. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "J. Paradis"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.877 Transmedia Art, Extraction, and Environmental Justice"
        ],
        [
            "prerec",
            "Subject meets with 4.376[J], CMS.374[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Exploration of today's extractive economies and the role that artists, media-makers, and transmedia producers play in shaping public perception, individual choices, and movement-building towards sustainability. Traces the contingent geological, material, community, and toxic histories of extracted materials used throughout our built environment, as well as civic resistance and reform that could alter extraction practices. Scaffolded workshops with artists and media producers support students' production of creative documentary and other media projects. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "J. Paradis",
                "J. Barry"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.888 Advertising and Media: Comparative Perspectives"
        ],
        [
            "prerec",
            "Subject meets with 21G.036[J], 21G.190, CMS.356[J]"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Compares modern and contemporary advertising culture in China, the US, and other emerging markets. First half focuses on branding in the old media environment; second half introduces the changing practice of advertising in the new media environment. Topics include branding and positioning, media planning, social media campaigns, cause marketing 2.0, social TV, and mobility marketing. Required lab work includes interactive sessions in branding a team product for the US (or a European country) and China markets. Taught in English and requires no knowledge of Chinese. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "J. Wang"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.894 Education Technology Studio"
        ],
        [
            "prerec",
            "Subject meets with CMS.594"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Uses media and technology to develop new forms of learning experiences for schools, workplace, and informal settings. Students participate in a range of projects that hone understanding and skills in learning science, instructional design, development, and evaluation. Topics vary but include developing new media and activities for massive open online courses, creating practice spaces for practitioners in the professions and humanities, and developing new approaches to assessment in complex learning environments. May be repeated for credit with permission of instructor if project content differs. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "J. Reich"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.895 Learning, Media, and Technology"
        ],
        [
            "prerec",
            "Subject meets with CMS.595"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Addresses new digital technologies that are transforming learning across the lifespan - from reading apps for toddlers, intelligent tutors for school children, and blended learning for college students, to MOOCs for adults and interest-based learning communities for hobbyists. Focuses on how these technologies shape people's lives and learning. Students explore how education technologies operate in complex social-technical systems, and acquire analytic tools and strategies that can be applied to other complex systems. They also refine their thinking about the opportunities, limits, and tradeoffs of educational technology. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "J. Reich"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.901 Current Debates in Media"
        ],
        [
            "prerec",
            "Subject meets with CMS.701"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Addresses important, current debates in media with in-depth discussion of popular perceptions and policy implications. Students use multiple perspectives to analyze texts emanating from these debates, and present their findings through discussions and reports. Explores emerging topics (e.g., piracy and IP regimes, net neutrality, media effects, social media and social change, and changing literacies) across media forms and from various historical, transcultural, and methodological perspectives. Examines the framing of these issues, their ethical and policy implications, and strategies for repositioning the debate. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.915 Understanding Television"
        ],
        [
            "prerec",
            "Subject meets with 21L.432[J], CMS.315[J]"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "A cultural approach to television's evolution as a technology and system of representation. Considers television as a system of storytelling and mythmaking, and as a cultural practice studied from anthropological, literary, and cinematic perspectives. Focuses on prime-time commercial broadcasting, the medium's technological and economic history, and theoretical perspectives. Considerable television viewing and readings in media theory and cultural interpretation are required. Previously taught topics include American Television: A Cultural History. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "D. Thorburn"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.920 Popular Culture and Narrative"
        ],
        [
            "prerec",
            "Subject meets with 21L.430"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Examines relationships between popular culture and art, focusing on problems of evaluation and audience, and the uses of different media within a broader social context. Typically treats a range of narrative and dramatic works as well as films. Previously taught topics include Elements of Style; Gender, Sexuality and Popular Narrative. Students taking graduate version complete additional assignments. Approved for credit in Women's and Gender Studies when content meets the requirements for subjects in that program. May be repeated for credit with permission of instructor."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.925 Film Music"
        ],
        [
            "prerec",
            "Subject meets with 21M.284"
        ],
        [
            "terms",
            [
                "Prereq: Permission of instructor "
            ]
        ],
        [
            "desc",
            "Provides a conceptual foundation and methodology for the study of music created for various types of (mainly) narrative films, from the medium's origins in the early twentieth century to the present. Close attention to select influential scores by composers active in Hollywood from the 1940s to the 1990s (e.g., Max Steiner, Bernard Herrmann, Quincy Jones, John Williams, Philip Glass). Those works are juxtaposed with landmarks of alternative film and musical styles from other countries and centers of production. Subsidiary topics include the history and challenges of live musical accompaniment to silent films, and the evolution of recording and sound-editing technologies from the studio era to the global present. Students taking the graduate version complete different assignments. Some background in the study of film and/or music is desirable, but not a prerequisite."
        ],
        [
            "inst",
            [
                "M. Marks"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.941 Immersive Social Worlds (New)"
        ],
        [
            "prerec",
            "Subject meets with CMS.341"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "Focuses on critical media sociology of immersive social worlds, from digital environments and avatar-based worlds to live action role-play (LARP) and theme parks. Draws on both historical and contemporary cases. Investigates key issues including communication and community; authorship and co-creativity; embodiment and identity; and ownership, governance, and management. Attention given to cultural and socio-technical nature of these environments and their ongoing construction within a broader media system. Students taking graduate version complete additional assignments."
        ],
        [
            "inst",
            [
                "Taylor",
                "T.L"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.942[J] Designing Virtual Worlds (New)"
        ],
        [
            "prerec",
            "Same subject as 2.178[J]\nSubject meets with 2.177[J], CMS.342[J]"
        ],
        [
            "terms",
            [
                "Prereq: None "
            ]
        ],
        [
            "desc",
            "See description under subject 2.178[J]."
        ],
        [
            "inst",
            [
                "K. Zolot"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.950 Workshop I"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Provides an opportunity for direct project development experience and emphasizes intellectual growth as well as the acquisition of technical skills. Students attend regular meetings to present and critique their work and discuss its implications."
        ],
        [
            "inst",
            [
                "J. Paradis"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.990 Colloquium in Comparative Media"
        ],
        [
            "prerec",
            "Prereq: None"
        ],
        [
            "terms",
            [
                "G (Fall, Spring)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Exposes students to the perspectives of scholars, activists, mediamakers, policymakers, and industry leaders on cutting edge issues in media. Registered CMS graduate students only."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.992 Portfolio in Comparative Media"
        ],
        [
            "prerec",
            "Prereq: CMS.950 or permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Students work individually with an advisor to produce a portfolio project which combines technical skills and a substantial intellectual component."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.993 Teaching in Comparative Media"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall, IAP, Spring)"
            ]
        ],
        [
            "desc",
            "For qualified graduate students interested in teaching. Offers experience in classroom and/or tutorial teaching under the supervision of a Comparative Media Studies faculty member."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.994 Independent Study"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Opportunity for individual research in comparative media studies. Registration subject to prior arrangement for subject matter and supervision by a faculty member."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.995 Independent Study"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall, IAP, Spring, Summer)"
            ]
        ],
        [
            "desc",
            "Opportunity for individual research in comparative media studies. Registration subject to prior arrangement for subject matter and supervision by a faculty member."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.S96 Special Subject: Comparative Media Studies"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (IAP, Spring)"
            ]
        ],
        [
            "desc",
            "Seminar or lecture on a topic that is not covered in the regular curriculum."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.S97 Special Subject: Comparative Media Studies"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall, Spring)"
            ]
        ],
        [
            "desc",
            "Seminar or lecture on a topic that is not covered in the regular curriculum."
        ],
        [
            "inst",
            [
                "L. Koslov"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.S98 Special Subject: Comparative Media Studies"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall)"
            ]
        ],
        [
            "desc",
            "Seminar or lecture on a topic that is not covered in the regular curriculum."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.S99 Special Subject: Comparative Media Studies"
        ],
        [
            "prerec",
            "Prereq: Permission of instructor"
        ],
        [
            "terms",
            [
                "G (Fall)"
            ]
        ],
        [
            "desc",
            "Seminar or lecture on a topic that is not covered in the regular curriculum."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ],
    [
        "block",
        [
            "title",
            "CMS.THG Master's Thesis"
        ],
        [
            "prerec",
            "Prereq: Permission of advisor"
        ],
        [
            "terms",
            [
                "G (Fall, IAP, Spring, Summer)",
                "\nNot offered regularly; consult department"
            ]
        ],
        [
            "desc",
            "Completion of a graduate thesis, to be arranged with a faculty member, who becomes the thesis supervisor. Required of all CMS students."
        ],
        [
            "inst",
            [
                "Staff"
            ]
        ]
    ]
]